{"uri": "https://www.theinertia.com/music-art/these-illustrations-dive-into-a-world-of-surf-surrounded-by-plastics", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/04/plasticsbylizzy2-343x254.jpg", "title": "These Illustrations Dive Into a World of Surf Surrounded By Plastics", "publish_date": "2019-04-22", "author": {"name": "Lizzy", "url": "https://www.theinertia.com/author/lizzy/", "type": "Community"}, "text_content": "Every single piece of plastic ever made still exists. One garbage truck of plastic is dumped into our ocean every minute. It's estimated that by 2050 almost all species of seabirds will have plastic inside their digestive system, and there will be more plastic in our ocean than fish. One million seabirds and 100,000 mammals and sea turtles die annualy due to plastics.\nThere is no nice story to tell. We are responsible for our choices, and only proper choices can change the future. Until we change this reality, the idylic vision of a surfing paradise is corrupted - and the promised land of our dreams is corrupted.\nThe End.\nNote: Find more of Lizzy's artwork on Instagram here.", "type": "photos", "photo": "https://cdn2.theinertia.com/wp-content/gallery/lizzysouldandsurf/plastics-5.jpg", "caption": "Photo: @lizzyartwork"}
{"uri": "https://www.theinertia.com/music-art/ocean-stoke-la-jolla-grassroots-collaboration-eco-minded-surf-skate-artists", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/04/oceanstokeprev-343x254.jpg", "title": "Ocean Stoke La Jolla Was a Grassroots Collaboration of Eco-Minded Surf and Skate Artists", "publish_date": "2019-04-08", "author": {"name": "Jared Aufrichtig", "url": "https://www.theinertia.com/author/jared-aufrichtig/", "type": "Community"}, "text_content": "Awesome people getting together to raise awareness about the ocean while celebrating a common love for the sea with art, culture, and music. Sounds rad, count me in….\nThis was what I was thinking September of last year when I got an email to help out with this amazingly-creative and multi-cultural art exhibition and benefit event connecting eco-conscious surf and street art into unique artworks to celebrate our ocean and the California coast. I had just done an indy art publication exhibition with a high-end gallery in Johannesburg, South Africa that included a bunch of my artist friends like Shepard Fairey, Roger Ballen, Risk, Pops Hosoi and many more. I was excited to show new artwork in San Diego and with a less formal, more like-minded surf-skate-ocean audience. I knew Pops had to be in there too, so with a couple of emails and a little convincing, I put him in the show.\n\nFast forward a few months, and I'm back in California helping get things ready for the big night. They line up some live music and ask me to spin a vinyl DJ set at the opening. I got word that Pops might not make it from Maui, but I'm not ready to break the bad news to everyone just yet.Advertisement \nThen we got the cool exhibition flyer with artwork by Ricky Blake depicting the La Jolla point with Chuy (Madrigal) and Pops doing jetski tow-ins, the infamous Paskowitz surf van as well as me faintly airing over the gallery in the background. I asked my buddy Bryce Leisy to help us make a little promo video to showcase all the talented artists. Christian manages to help organize Pops' trip out to California for the opening and we were back on track.\nYours truly, jamming.\nThe opening night was well attended by myriad ocean-loving surf-skate creatives including a few people I asked to be there to support me but I thought couldn't make it. Shaun, Carla, Paul, Tracy, and Luke Tomson showed up with my dad halfway through my DJ set.\nThe Tomsons gave me my first skateboard for my ninth birthday.Advertisement\nI was stoked! So much Aloha!\nEditor's note: Artists included Erin Yoshi, Ivan \"Pops\" Hosoi, Jared Aufrichtig, REMIO, Gomez Bueno, Gloria Muriel, Michael Amorillo, Breanne Custodio, Joshua Paskowitz, Nathan Ledyard, Chuy Madrigal, Ricky Blake, Nathan Gibbs, Bryan Helfand, Patrick Parker and Marcel Sel Blanco, Matthew Perdoni and more.\nArtist Erin Yoshi's Ocean inspired paintings. Photo: Jerry Jaramillo", "type": "video", "photo": "https://cdn1.theinertia.com/wp-content/gallery/oceanstoke/02_ocean-stoke.jpg", "caption": "The gallery filled in quickly. Photo: Jerry Jaramillo", "video": "https://vimeo.com/311366058"}
{"uri": "https://www.theinertia.com/music-art/the-paskowitz-pops-hosoi-surf-skate-art-show", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/03/feature-343x254.jpg", "title": "Honoring the Legacy of Family, Dedication, and Authenticity: The Paskowitz/Hosoi Live Art Show", "publish_date": "2019-03-26", "author": {"name": "Joshua Paskowitz", "url": "https://www.theinertia.com/author/joshua-paskowitz/", "type": "Community"}, "text_content": "I have always been a huge fan of Christian Hosoi. When I was young, my brother Jonny was on the Jimmy'z longboard surf team. He and Christian both had this long, dark hair and they always wore black.\nI thought we were related. He was a huge influence on me-I adopted the all black thing and felt like a Mexican Ian Astbury when I was jamming out in San Clemente back then with my old band Jesus Chrysler. God bless the eighties.\nThat was so great. I have completely forgotten about so many events, but I remember I met Christian at some rock show or something. I think Eddie Retagui and Christian were doing a skate demo. Music and art were always an outlet of the surf/skate culture, and no one knew that better than my mentor, Greg Escalante.\nI traded a surfboard for a microphone, then traded the mic for a brush, and that was it for me. Recently I was part of a group art show in San Diego with a brotherhood of surf artists like Nathan Ledyard, Chuy Madrigal, Rick Blake, Nathan Gibbs, Bryan Helfand, Patrick Parker, and others. We all organized into a collective of ocean-minded artists working to bring awareness to environmental conservation under the banner of Ocean Stoke.Advertisement \nI was super stoked to be a part of a show at the Misfit Gallery in La Jolla and work with some guys I admire like Jay Celat and the 9th Wave Gallery in Hawaii.\nMy buddy told me they were thinking of doing this thing with Pops Hosoi and I was like, \"oh that would be so sick.\" One thing led to another, and I got the opportunity to do a live painting with Pops and reconnect with Christian. I am so incredibly inspired by their relationship and their energy in promoting positive actions and healing through Faith.\nMy dad and I were super tight. He really sacrificed a lot for me to be able to live that dream of the Paskowitz family with the freedom and sense of belonging that was so unique. He rejected social conventions and totally dedicated our family values to adhere to the Aloha spirit that he learned from Duke Kahanamoku at Waikiki. He thought that was more important than anything. When I see how Pops and Christian have traversed some of that same territory, I feel an amazing sense of gratitude and hopefulness for our surf/skate culture.Advertisement\nWhen we were younger, there was a pretty clear demarcation between the surf culture and the normies-it seemed like the fringe element in surfing presented a problem in the sense that, although it was a youth-driven aspirational sport, it wasn't able to really be capitalized on because of the frightening gatekeepers who might enter into totally unexpected and misunderstood realms. I guess my family fell into that category. What I realized when Pops and I were working on our live piece was that the true cultural DNA has remained the same for all these years. Wave after wave of new influence has yet to fully eclipse the value of what the original founders discovered.\nMy dad said that, \"there is a wisdom in the wave, high born and beautiful, for those who would but paddle out.\" As I was learning about Pops' background, I realized that there are a lot of similarities to the Paskowitz family. He's a classically-trained artist who devoted his life to his kid and fostered his journey through the culture. It seems like the people who really devoted their whole being into the effort are the ones who ultimately made a fundamental impact.\nI think that kind of purity also informed Christian's epic style. You can't fake that. His whole life was a manifestation of the expression in his art. He lived for it. That's the big difference with how contrived and self-aware the environment is now.\nAs everyone was arriving, I met Pops and Christian and we talked a little story about mostly my brother Jonny, as he was the Paskowitz they hung out with most. I told them that Jonny and Duke Aipa were going to show up, and Christian shared a little story about Duke's dad, Ben Aipa. He is the man who inspired some of the greatest surfers of all time. See, surfing and skating were all born from the same genetic pool.\n\"The swallow tail design was from Ben Aipa,\" Christian said. \"And the Hammerhead was part of the inspiration from Ben's sting and swallow concepts.\"\nAs Pops Hosoi and I started working on our live painting and Duke Aipa started coming to life on the canvas, I had a kind of awesome realization: we were all part of something truly valuable. We're honoring the legacy of family, dedication and most importantly, authenticity. We were all part of the same surf family, founded by Duke Kahanamoku and our ultimate goal to preserve the Aloha Spirit that was handed down through the generations from father to son.Advertisement\nIt's such a humbling feeling to be a part of that.\nI knew I had to share this beautiful feeling that the real living spirit was still moving through the world. We are all a part of it, everyone who has gone into the water wanting to blow their brains out and come in feeling like Maximus Meridias. Every parent who feels that indescribable thrill seeing their kid's first wave, knowing that a lifetime of health and strength and community is on the horizon. Even surfing a lake or a river, or pulling a blue tarp over a skateboard… it's inescapable. As soon as you're involved, the zeitgeist starts creeping in.\nSo as we approach the advent of even more commercialization and mainstreaming, manifesting even greater interest and involvement (the Olympics, hello), remember that no one can go back in time and make this thing any less meaningful, raw, and real. As the culture progresses and expresses itself, the true organic roots will create new offshoots in art, music, and even on the environmental and political spectrum.\nSee more on Instagram: @Joshua Paskowitz,  @Pops Hosoi , @Aipa Surf", "type": "photos", "photo": "https://cdn3.theinertia.com/wp-content/gallery/paskowitz-hosoi/cover-shot-dorian-paskowitz-and-christian-hosoi.jpg", "caption": "Dorian Paskowitz and Christian Hosoi. Image: Supplied"}
{"uri": "https://www.theinertia.com/music-art/wyo-went-from-scoring-music-for-andy-irons-kissed-by-god-to-up-and-coming-rock-band", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/03/WYO-EPK-20180613.1-343x254.jpg", "title": "WYO Went from Scoring Music for 'Andy Irons: Kissed By God' to Up-and-Coming Rock Band", "publish_date": "2019-03-22", "author": {"name": "Jamie Tierney", "url": "https://www.theinertia.com/author/jamie-tierney/", "type": "Community"}, "text_content": "As a filmmaker, I've learned that writing music for films is a highly underrated and undervalued piece of the artistic puzzle. Picking your favorite song to go with a specific part of your film tends to get expensive and it might not even serve your story or set the mood the way you want it to. So if you find a musician who's good at making the exact track you're looking for, that's someone you should really get to know.\nCase in point, I met Andy Sorge 10 years ago when I worked at Quiksilver. He was scoring films for Brainfarm, the production company in Jackson Hole that made some incredible Travis Rice snowboard films. Andy was making mostly electronic music back then but he'd grown up playing classical and jazz music on a piano. Knowing this, I figured it was only a matter of time before he switched to a more organic sound.\nAndy spends most of his time in Los Angeles now and he and I have stayed friends through all those years, collaborating on many projects along the way. He and his writing partner, Scott McKay Gibson, did an incredible job making original music for the Andy Irons: Kissed by God documentary.Advertisement \nI've been happy to witness the birth and development of their band, Wyo. Wyo's a rock n' roll band with a big, expansive sound that pays tribute to the natural majesty of its Jackson Hole roots. If you're into the scope and sweep of U2, Arcade Fire or Radiohead, give their first album Untamed a listen on Spotify or Apple Music.\nWyo just finished recording their second record, \"Changes\" and recently released a highly cinematic video for their new song, \"Moonlight.\" I caught up with Andy just before he left with his band for a few gigs at the South by Southwest festival in Austin, Texas.\nWhat's the process for writing music for a soundtrack? What do you listen to, watch, or do to get inspired? Advertisement\nWhen writing music for a film you have to pay close attention to the momentum of the scene and the music that comes before and after. If there's dialogue, you write the music for what is being said. A basic way of thinking about it would be sad scene, minor chords, happy scene, major chords. But the trick is to fit the music to the emotional beats of the film.\nWhat's your favorite sequence of a film that you scored?\nIn the documentary Andy Irons: Kissed by God, there's a tragic sequence of events leading up to Andy's death. A year or two before completion of the film I knew I wanted to write music for this section because it gave me the opportunity to write with a lot of emotion. That is the most meaningful sequence of a film I've scored so far.\nYou grew up with a piano and classical music background and did mostly electronic-based music for your film work. What made you want to play in a rock band? \nI've always dreamed of having a band and not being tied to electricity and a computer to put on a performance. So I knew I was satisfying my creative needs by starting with a sound that was more organic and then building from there.\nWhat are your musical influences? Do you have any songs that are directly inspired by other artists? Advertisement\nLots of musical influences. No song, in particular, was inspired by another song by someone else, but I often times hear Jim Morrison from The Doors in the distance when I'm writing and maybe that's because my dad would blast his music in his convertible before dropping me off for preschool. The Doors, The Who, Michael Jackson, and many other classic acts.\nJackson is your favorite place to write and record music, right? How are you inspired by your surroundings there? \nWyoming is cinematic, peaceful, but also The Wild West. Those three things inspire me to write out there.\nYou made a ton of music before you started to play live. What's the biggest thing you've learned since you started playing shows? \nOne of the clear things I learned once we started performing was people generally like uptempo music when they are standing, especially late at night at a bar when they want to dance. We didn't have a lot of uptempo songs in our first album Untamed, so we upped the tempo with our second album, Changes.\nWhat's changed for your musically and in your life since your first album? Advertisement\nA lot has changed. We moved to L.A. but continue to write in Wyoming. It's all a constant and ever-changing exploration.", "type": "video", "video": "https://youtu.be/eb1KpO9Ee84"}
{"uri": "https://www.theinertia.com/music-art/dream-sesh-a-poem-about-everyday-moments-spent-in-the-ocean", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/03/jeremy-bishop-664695-unsplash-1-343x254.jpg", "title": "'Dream Sesh': A Poem About Everyday Moments Spent In the Ocean", "publish_date": "2019-03-12", "author": {"name": "Michael Schoaff", "url": "https://www.theinertia.com/author/michael-schoaff/", "type": "Community"}, "text_content": "Photo: Jeremy Bishop //Unsplash\n\n\n\n\n\n\n\nthe weary burnt orange moon crashes out into the sea\nan invigorated almond yellow sun rises from the sleeping land\nazure green concentric lines bend in procession toward the shoreline\nbecoming wedging peaks, they pitch and peel across the flawless sandbar\nwarm dry offshore winds guide natives to their saltwater playground\na brief respite of cerebral preparedness convenes at the water's edge\nthe moderately challenging paddle out builds the mounting stoke\nthe vast lineup abounds with opportunities for soul restoration\nthe warmth of the water and air creates a realm of serene well-being\nthe clarity and translucency of the surface seems a depthless mirror of splendor\na calm between sets lulls the congregation into a placid state of mindfulness\nthe mood an eager high-spiritedness for the brilliance to come\ndarkened bumps out the back, cause frantic positioning for the arriving swells\nstroking underneath and into a shifting peak, bottom dropping out as feet dig in\nthe euphoric weightless adrenaline-filled glide seemingly effortless\nthe reflective paddle back out, an endorphin-filled moment of existential bl", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/experimental-indie-jazz-montalban-quintet-swamis", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-08-at-10.48.12-AM-343x254.png", "title": "Here's an Experimental Indie Jazz Music Video Dedicated to Swami's", "publish_date": "2019-03-08", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "Some say art imitates life, others say life imitates art. Whatever your persuasion, there's something to be said for the similarities to be drawn between San Diego-based experimental indie jazz group Montalban Quintet's \"Swamis,\" the accompanying music video above, and the actual surf spot from which the track draws its name.\nWhen Swami's (the surf break) is on, the place becomes a maelstrom of longboards, shortboards, mid-lengths, human limbs, and neoprene. An expression of performance art that's chaotic to say the least,  as orderly swell lines wrap toward the headland.\nThat Montalban Quintet - a group formed by Pinback drummer Chris Prescott - would find inspiration in the waves for an experimental jazz track is fitting. More than any genre, jazz is improvisational, at times chaotic, bewildering, and beautiful.Advertisement \nThrow on some headphones and vibe to this and tell us it doesn't remind you of jockeying for position at the San Diego pointbreak.", "type": "video", "video": "https://youtu.be/VGunJKrcUj8"}
{"uri": "https://www.theinertia.com/music-art/carpool-karaoke-kelly-slater-shaun-white-tony-hawk", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/02/GOATs-343x254.jpeg", "title": "Three GOATs Sing Carpool Karaoke Around Los Angeles", "publish_date": "2019-02-15", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "Kelly Slater, Tony Hawk, and Shaun White step into a Range Rover. Three GOATs in their respective sports. Ah, to be a fly on the wall you say.\nDream no more. Recently the trio collided in a spin-off of late night host James Corden's Carpool Karaoke, called Carpool Karaoke: The Series (the only notable difference is it's sans James), and to be honest we're not sure what's better. Hearing all three belt \"My Sharona\" or talking about what it's like to be the Michael Jordan of their sports, and who the Michael Jordan of cereal mascots, tv dads, and superheroes might be. Tony the Tiger, Tim \"the Toolman\" Taylor, and Michael Jordan, in case you were wondering.\nHot tip: to watch the full 13-minute clip, you'll have to download the Apple TV app on your phone. But, it's totally worth it.", "type": "video", "video": "https://youtu.be/7QHPxtufaXk"}
{"uri": "https://www.theinertia.com/music-art/this-is-what-happens-when-norways-black-metal-music-scene-meets-its-surf-scene", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/02/avast-343x254.jpg", "title": "This Is What Happens When Norway's Black Metal Music Scene Meets Its Surf Scene", "publish_date": "2019-02-14", "author": {"name": "Henrik Bydal", "url": "https://www.theinertia.com/author/henrik-bydal/", "type": "Community"}, "text_content": "Norway is better known for its black metal scene, dark days, and cold weather than its surf. So this is what happens when you combine that magnificent, distinct heavy metal sound with beautiful surfing from the coastline of Jæren.\nMetal band Avast has a sound that combines black metal with post-rock to create hypnotic pieces. Most would expect harsh-sounding music and screaming vocals, according to the band's vocalist, Hans Olaf Myrvang, but the music/surf video they created with Ivar Vasstveit is purely instrumental.\n\"We wanted to do something original and different for our genre,\" Hans says. \"Our name, Avast, is an old nautical word that means 'stop.' As a band, we have strong views on our society and especially on how we as a human species treat our planet. We see pollution everywhere, and especially at sea. We're concerned, and we're not alone. However, the main reason it all came together is Ivar Vasstveit put together a beautiful film of surfers in raw nature. Powerful, emotional instrumental music fits that like a wetsuit glove.\"Advertisement \nEditor's Note: If you want more of Avast, visit them here. You can also find more of Ivar's work here, and more from the Norwegian surf scene on the SurfNorges website.", "type": "video", "video": "https://youtu.be/8poQz-8Agtw"}
{"uri": "https://www.theinertia.com/music-art/paul-fisher-aka-fishers-hilarious-grammys-red-carpet-interview", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/02/FISHER-343x254.jpg", "title": "Paul Fisher, AKA FISHER's Hilarious Grammys Red Carpet Interview", "publish_date": "2019-02-13", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "Remember the days when Paul Fisher used to entertain us all with his hilarious interviews? He was, for a short time, surfing's unofficial class clown before he became FISHER, a now Grammy-nominated music producer/DJ. Well now he's the one with the microphone being thrown in his face and the result is exactly what you'd expect: hilarious.\nIn 2018, FISHER released Losing It, a track that earned him a nomination for the Best Dance Recording at the 61st Annual Grammy Awards, which is a pretty darn big deal. He arrived on the red carpet in typical fashion and offered up what might be the most hilarious interview the Grammys has ever seen.\n\"You are certainly the most Australian thing here,\" he's told after dropping an f-bomb to open the whole thing up. Watch and enjoy.", "type": "video", "video": "https://youtu.be/xANbX20VhGI"}
{"uri": "https://www.theinertia.com/music-art/valentines-day-stand-by-me-lake-powell-endless-summer", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/02/r1wD6mGBV-343x254.jpg", "title": "Let This Stunning Rendition of 'Stand by Me' Be Your Valentine's Day Soundtrack", "publish_date": "2019-02-13", "author": {"name": "The Inertia Mountain", "url": "https://www.theinertia.com/author/the-inertia-mountain/", "type": "Staff"}, "text_content": "Independent of your thoughts around Valentine's Day - whether you enjoy it or think it's a manufactured holiday, whether you're happily betrothed or single - the time is particularly opportune to think about love.\nIf it's love for another person or love for the ocean and the outdoors, every kind of love needs its own soundtrack. And, may we suggest to you it be the lyrical stylings and harmonies of the Canadian guitar-wielding duo Endless Summer?\nFronted by twin brothers Bob and Clint Moffatt, last year the duo began a special project traveling to some of the most beautiful landscapes in the world performing stripped down original singles and covers. The one above is a cover of Ben E. King's \"Stand by Me\" that's chilling with the natural acoustics of Lake Powell.Advertisement \nThe pair has also set up shop in Glenwood Canyon, Kuta Beach, Vail, and the streets of Nashville (where they now call home).\nIf you're looking for a last minute gift this Valentine's Day, look no further than these stunning videos. Best of all they're free. And for those that aren't feeling the love, fret not. The third video down is a cover of Britney Spears' \"Hit Me Baby (One More Time).\" You're welcome.\n\n\n\nCheck out more from Endless Summer here.", "type": "video", "video": "https://youtu.be/mlBIpwtNxxE"}
{"uri": "https://www.theinertia.com/music-art/the-hu-a-mongolian-heavy-metal-band-will-make-you-want-to-shred-something", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2019/01/music-343x254.jpg", "title": "'The HU,' a Mongolian Heavy Metal Band, Will Make You Want to Shred Something", "publish_date": "2019-01-10", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "Have you heard music like this before? Music that makes you want to pound your way out through heavy surf while taking six on the head, or straightline a chute high in the mountains. That probably wasn't what The HU was thinking about when it created its unique brand of heavy metal music featuring guitars and traditional Mongolian chanting mixed with native instrumentation, but it all works together rather seamlessly and might inspire you to get out there now.\nThe HU has garnered more than nine million views on its two YouTube videos. People are listening. But how did heavy metal infiltrate Mongolia, you ask?\nWhen the Soviet Union crumbled, Western influence flooded into the country between the late 1980s and early 1990s. Mongolian musicians apparently preserved old traditions while weaving in new ones,  Thalea Stokes, a University of Chicago ethnomusicology doctoral student, told NPR music. Well, the sound works, and it has a lot of people pumped on Mongolian heavy metal.", "type": "video", "video": "https://youtu.be/jM8dCGIm6yc"}
{"uri": "https://www.theinertia.com/music-art/how-this-artists-finds-beauty-in-our-plastic-pollution-problem", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/12/Untitled-1-2-343x254.jpg", "title": "How This Artists Finds Beauty in Our Plastic Pollution Problem", "publish_date": "2018-12-27", "author": {"name": "Gustavo Lermen Silva", "url": "https://www.theinertia.com/author/gustavo-lermen-silva/", "type": "Community"}, "text_content": "Ricardo Ramos, aka Xicogaivota, was born in Lisbon in 1978 and is an extraordinary artist fueled by a very noble purpose: he just wants his children and the next generation to see what he has seen. It's exciting to uncover the process of how that purpose funnels into everything from where he chooses to work to the materials he uses.\n\"You look at these pieces and you see plastic garbage,\" he says. \"I look at them and I see perfect shapes. I see beautiful pieces, impossible colors that you can't find anywhere else, stories. I would love to know where they come from, what they saw, and how far have they traveled. That's why I keep them.\"\n\"I'm addicted to these places,\" he adds. \"I have a need to see puddles, to see rocks, and to absorb all that beauty. I want to keep them as beautiful as I find them and I would love to see my childrens go there in a few years and (feel) just get as crazy as I did when I saw this unique and incredible place for the first time.\"Advertisement \nThis is a perfect translation of the expression \"acting locally, thinking globally.\" We should all be grateful for the work of a creative mind like this.\nFind more of Xicogaivota's work here.\n\n", "type": "video", "video": "https://vimeo.com/305909360"}
{"uri": "https://www.theinertia.com/music-art/creativelines-that-draw-inspiration-from-the-daily-routine-in-and-out-of-the-water", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/12/IMAGE_1-343x254.jpg", "title": "#CREATIVELINES That Draw Inspiration From the Daily Routine In and Out of the Water", "publish_date": "2018-12-21", "author": {"name": "Guillem Roig", "url": "https://www.theinertia.com/author/guillem-roig/", "type": "Community"}, "text_content": "My artwork combines drawing, painting, and illustration disciplines together in one and my inspiration comes from the daily routines of life, in and out of the water, and the scenes that impact me each day. I would say that my works are the expression of being part of a consumer system, trying to apply a critical perspective to capitalism and its daily consequences. From there, I mix this with influences from urban and pop culture, surfing, skating, and graffiti.\nNote: You can find more of Guillem's unique artwork here.", "type": "photos", "photo": "https://cdn1.theinertia.com/wp-content/gallery/guillem/image_1.jpg", "caption": "Guillem Roig"}
{"uri": "https://www.theinertia.com/music-art/exploring-the-inner-workings-of-trent-mitchells-fascinating-underwater-photography", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/12/inneratlas_tmitchell_burn_0003-343x254.jpg", "title": "Exploring the Inner Workings of Trent Mitchell's Fascinating Underwater Photography", "publish_date": "2018-12-13", "author": {"name": "Robert Sherwood", "url": "https://www.theinertia.com/author/robert-sherwood/", "type": "Community"}, "text_content": "This is a short film featuring devoted Australian photographer Trent Mitchell and his experimental pursuits with the medium of photography. The film documents Trent's creative process in making his latest bodysurf series, Inner Atlas.\n\"What we see and how we feel are two different things,\" Trent says. \"If I could bridge that gap with pictures, to capture that energy, that's hitting the mark for me.\"\nYou can find more from filmmaker Rob Sherwood here and from photographer Trent Mitchell here.", "type": "video", "video": "https://vimeo.com/304743186"}
{"uri": "https://www.theinertia.com/music-art/listen-to-this-photographers-beautiful-take-on-why-slab-waves-are-natural-art", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/12/GRG_1456-6-343x254.jpg", "title": "Listen to This Photographer's Beautiful Take on Why Slab Waves Are Natural Art", "publish_date": "2018-12-12", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "We've all heard, understand, and appreciate the notion that no two waves are alike. For many of us, it's one of the sentiments we draw upon to elaborate on why and how we get so obsessed with riding them in the first place. And there's probably no other type of wave that throws this idea right back in our face harder than violent, thrashing, wompy, but oh-so-beautiful slabs.\n\"This wave really encompasses the definition of a photograph,\" says photographer Greg Rabejac. \"It shows something that ordinarily is invisible to the naked eye and which, in addition, will disappear in a matter of seconds.\"\nRabejac regularly photographs one particular wave in the southwest of France because he's infatuated with the idea that each wave is its own sculpture. And each frame he captures is an entirely different work of ephemeral art.Advertisement \n\"The wave has its own characteristics; the texture, form, substance, colors, are just incredible and unique compared to a classic surf wave.\"\n \n\n", "type": "video", "video": "https://youtu.be/HQfasuxAQ-0"}
{"uri": "https://www.theinertia.com/music-art/felicity-palmateer-skin-deep-nude-surfing", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/11/felicitypalmateernakedsurfing1200-343x254.jpg", "title": "Felicity Palmateer Is Releasing a Nude Surf Film Called 'Skin Deep'", "publish_date": "2018-11-26", "author": {"name": "Alexander Haro", "url": "https://www.theinertia.com/author/alexander-haro/", "type": "Staff"}, "text_content": "Making a nude surf film is a risky thing to do these days, but that's what Australian big wave enthusiast Felicity Palmateer is doing. The film is called Skin Deep, and she's been working on it for three years. Filmed in Fiji, Hawaii, and all over Australia, the four-minute short is set for release in early December.\nPalmateer is an artist, and Skin Deep is, in her own words, an \"art project.\" Of course, surfers in the nude is nothing new-Kelly Slater, Coco Ho, Courtney Conlogue, Laird Hamilton, and Maya Gabeira have each bared it all in ESPN's Body Issue.\nNow, nudity in and of itself shouldn't be a bad thing. It shouldn't be thought of as sinful, nor should simply looking at a naked body and appreciating it be considered immoral. Unless you're living in strict adherence to the Bible's puritanical tenets and really good at lying to yourself, you know that those are just natural functions of a normal person. ESPN's Body Issue isn't supposed to be sexual. It's supposed to be a celebration of, as I said a while back, \"the human body and what we're capable of when we're not using sugar and Instagram to slowly turn ourselves into vile, sludge-filled bags of rancid custard.\" This, I assume, is in a similar vein to Palmateer's art project.Advertisement \nIt should be said, however, that anything that involves a naked body isn't going to be simply an appreciation of the body for everyone, especially when it's on the internet. Oh, sure, the artist or photographer can have the most artistic and innocent aspirations for their work, but when there are soft boobs and round butts and hard pecs and horny people basking in the blue glow of their computer screens late at night, those aspirations are thrown out the window for something a little more… carnal.\nPalmateer is completely aware of all that. \"I think with social media,\" she told The Sunday Telegraph, \"…you make your coffee wrong and someone has something to say about it. This is art and it's supposed to be thought-provoking. I'm happy if it provokes discussion. I hope people see it the way I do. It's successful if it captures people's imaginations or provokes talk.\"\n\n", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/how-the-bar-stool-preachers-started-making-punk-rock-with-a-message", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/11/25-343x254.jpg", "title": "How 'The Bar Stool Preachers' Started Making Punk Rock with a Message", "publish_date": "2018-11-06", "author": {"name": "Corey Jones", "url": "https://www.theinertia.com/author/corey-jones/", "type": "Community"}, "text_content": "The Bar Stool Preachers\n\n\n\n\n\n\n\nThe Bar Stool Preachers are a band that's excited to tell you about their beliefs, their passions, their goals, and their dreams. In August, the six-piece group from Brighton, England released its sophomore album \"Grazie Governo,\" an infectious collection of ska-infused ditties intended for today's skankin' youngster and intellectual punk alike. I recently caught up with frontman TJ McFaull (son of Colin McFaull of the legendary punk band, Cock Sparrer) to chat surfing, festival memories, and his fascination with the band Abba.\nThe term \"bar stool preacher\" has an obvious meaning, but is there a particular story or person that inspired the band name?\nWith the pub culture in the UK, we all grew up knowing a bar stool preacher. We all knew that one uncle that would get too drunk and start saying shit. For me, there was specifically one great uncle who was always the guy where it was like \"Oh, he's talking again?\" He was the one dude that would spout whatever he felt was appropriate at the moment. There was a song from a cult-hero band in London - the band was called Chas & Dave - and one of their lyrics was \"Barstool preaching. That's my old man's game!\" and as soon as we heard it, it was like \"That's it! That's us!\"\nMy girlfriend and I were listening to your new record, Grazie Governo. She doesn't know a lot of punk or ska but she heard the first track and described your music as \"21st Century storytelling.\" What do you say to that?Advertisement \nFuck yeah! That is, without a doubt, one of the best compliments we've had, especially from someone that doesn't have the scene context. We're in a lucky position at the moment in that not many bands sound like us. We've always focused on the narrative and used the band as a way to try and relate to people. That's missing from music right now. There is no sense of community. Being a touring band that gets across the world, we see the same things everywhere from Berlin to Baltimore. People feel completely underrepresented and unheard. So yeah, \"21st Century storytelling\" is absolutely perfect because that's what we are trying to do.\nYou funded this album yourselves, correct?\nWe did, man. We absolutely did. We're still eating dog food but we managed to put out an album ourselves again (laughs). We had a few good offers from decent-sized record labels but we wanted to keep autonomy of our music. We understand the creative process and it's really hard to disengage with the connection you have to your own product. We've always had a rule that if you don't care about our band as much as we care about our band, you're not going to be part of the plan.Advertisement\nIn another interview, someone asked you about your reception on stage as a new band and you said \"I remember one big skinhead at a particular London show looking at us with our beards and spike green hair that looked seriously unimpressed before we'd even started. By the end, he was properly dancing away, all the while trying to look like he wasn't enjoying himself!\" Do you still find yourselves in those situations?\nHell yeah. The underdog card is something that we love. A lot of the modern music world right now has this mentality like \"I'm going to doubt you until you prove to me that you're worthy of my time.\" That comes down to a few things. Live music is underfunded right now, so people show up and think \"If I'm spending my time and money on you, you better be good.\" For us, it's always been like \"Ok, let's go out and impress these people. Let's do whatever we can to make sure that whoever comes to our gig has the time of their life.\" We play music to people sometimes that don't necessarily align themselves with our leanings. It's always a bit of a trying time to engage with everyone that is in the crowd. We deliver a message and try to talk about things that are important to us, but sometimes when you try to feed medicine, you've got to put it in peanut butter if you know what I mean. You need to make people dance and have a good time before they're willing to listen to your message.\nYour band has pretty diverse musical tastes ranging from the Menzingers, Woodstock bands, hip-hop, the Bosstones, NOFX and more. How does this mix of influences affect the music you write?\nYou kind of have to open your head up to other people, especially if you're going to be married to five men at one time. You have to be totally accepting of what other people like and think, and you have to assume that they're always right, which is not an easy thing to do. The musical diversity of the band provides us a really, really good springboard for new ideas. Some of our favorite bands - like The Menzingers or Bouncing Souls, for example - seem to have this set formula that works for them, but for us, it's always been about what you can write and what you can create that has the most value to you. That's hard to balance when you have five or six people in the dynamic. But again, if you work under the assumption that the guy next to you has a valid opinion, you're always on good footing.\nWhat music is currently in your listening rotation that a fan of yours might be surprised to know about?\nOh, that's dirty laundry man! I won't drop the other guys into the mix except for our drummer. Our drummer likes a lot of modern pop and old jazz. It's a bizarre mix with him. One minute he's listening to Rihanna and the next it's Duke Ellington. For me, I love Abba. They wrote some of the greatest pop songs of all time! With our next album, we're jumping into something we call the \"Abba chorus\" technique (laughs). It's like come up with a verse, come up with a chorus, then write a better chorus and turn the first one into a verse. Those guys had hooks coming every which way.Advertisement\nI hear you are a master diver and you surf.\nWell, first of all, this is one of the most \"out there\" interview sources we've ever had. When Vanessa got in touch and said we'd be doing an interview with a surf site, I said \"Alright!\" It's fucking cool man. I've been diving for 14 or 15 years and I grew up as a kid with massive ADHD. I was in therapy starting at age 8 or 9 trying to get in touch with my own head. My parents suggested that maybe I would enjoy diving which was really left field for some kid from East London, but as soon as I did my first dive it felt natural. I've always felt a huge affinity to the ocean. I just can't help that. It's always been undeniable in me. The feeling of insignificance helps me to ground my head when everything is going a million miles an hour. To have something where it's like \"this thing is it's completely own entity and I'm here doing my thing\" always helped me keep a finger on my own mental health more than anything else. With diving obviously comes a hell of a lot of time in and out of water and if you're a person like myself that gets a kick out of being anywhere near it, you might as well find some sort of activity where you can enjoy the rest of it.\nSurfing, for me, probably came into it at about age 17 or 18. My last big trip to dive was at Komodo National Park. It was wicked. I was out there for three months leading people around and teaching classes and that sort of stuff.\nHave you written any songs about the ocean?\nDefinitely, in the future, I'd be open to exploring it. There is a song on the new album that was included on the official Spotify punk playlist called \"2:22\" and it's about not being able to relate to a partner. For me, the best example of that is when you're going against a current or you're just out in the middle of the ocean. That song probably has the most water metaphors or conveys the feeling of being in the ocean at the same time as struggling with your emotions.\nWhat surprises you most about touring in Europe versus the United States?Advertisement\nThe US is a lot like the UK. You turn up to the venue and they give you a bag of chips and a begrudging handshake (laughs). In Europe, they get a lot more government subsidies so they respect and treat the artists better. So I'll do Europe versus America and the UK.\nThe reception, without a doubt, has always been incredible for us in all the European territories. The difference is that a lot of the stuff in the UK or America is a lot of self-made artists. Especially in the subculture, people don't want to hear any more Ed Sheeran or Justin Bieber. They want to hear someone with heart, someone with more of a message. In Europe, it's still a little bit glossier. But again, they get a lot of people that are genuinely interested in music out there. The artists get treated really well there.\nCheck out The Bar Stool Preachers on tour this fall with the Interrupters. For tour dates, visit here.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/exploring-the-link-between-art-and-environmental-activism-through-public-murals", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/10/Ernesto_Maranje_Sea_Walls_1-343x254.jpg", "title": "Exploring the Link Between Art and Environmental Activism Through Public Murals", "publish_date": "2018-10-08", "author": {"name": "Michael Drentea", "url": "https://www.theinertia.com/author/mike-drentea/", "type": "Community"}, "text_content": "In 2014, the Pangeaseed Foundation launched a program focused on educating people on the ways we can all contribute to saving our oceans. Sea Walls became an opportunity for artists to share messages of sustainability, ecology, and design by painting public murals all over the world and spreading awareness of our impact on our constantly changing planet.\nI caught up with Akira Biondo, Director of Operations of Pangeaseed at the KAABOO Music Festival in Del Mar, California, who was speaking to many ocean lovers and surfers alike. \"There are numerous ways people can get involved to help save our oceans and one of the ways Pangeaseed achieves this is through our ARTivism Sea Walls that are painted and raise awareness of our plight,\" she says.\n\nBy collaborating with a new growing community of nearly 300 contemporary artists, Pangeaseed has created over 300 murals in 13 countries around the world. Our oceans are Earth's life support system, providing nearly 70 percent of the oxygen we breathe in our atmosphere. \"Over a sixth of the animal protein people eat, medicines that keep us alive and healthy, and so much more, human impact in the form of overfishing, climate change, development, plastics, and other forms of pollution are taking a toll on the health of our seas. Unfortunately, these critical issues are often complex, multi-faceted and hard to understand for the average citizen,\" Biondi adds.Advertisement \nSo through public art, Sea Walls has a huge opportunity to translate facts into visual stories to engage and bring awareness to people in a non-confrontational manner.\nFor example, Melbourne-based artist George Rose started painting large-scale murals after abandoning her formal studies in traditional design to pursue her passion as a large-scale painter of radiant colors. Most recently, George has worked on projects for Instagram, Jansport, Mastercard, and even a recent blockbuster Star Wars film. When not working on commercial projects, she is usually traveling the world showing her street art on a global scale.\nErnesto Maranje is a Chicago-born, Miami-raised artist out of Hialeah, a suburb in Miami predominately known as a Cuban community. Maranje's career really started in 2011 while he was serving with the U.S. Coast Guard. His artwork depicts many animals that show a bond and unity between us all and reminds viewers of our connection with nature and with each other. His message in his murals and illustrations shows why we should all strive to protect and conserve nature.Advertisement\nLearn more about the Sea Walls art and activism program here.", "type": "video", "photo": "https://cdn3.theinertia.com/wp-content/gallery/sea-walls-art/ernesto_maranje_sea_walls_1.jpg", "video": "https://vimeo.com/225693186"}
{"uri": "https://www.theinertia.com/music-art/this-is-what-happens-when-you-throw-a-surf-inspired-music-festival-in-jersey", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/10/Springsteen-ThePopBreak-343x254.jpg", "title": "This Is What Happens When You Throw a Surf-Inspired Music Festival in Jersey", "publish_date": "2018-10-03", "author": {"name": "Tim Torchia", "url": "https://www.theinertia.com/author/tim-torchia/", "type": "Community"}, "text_content": "A much-anticipated music festival just landed right in my backyard of Asbury Park, New Jersey. The excitement of bringing live music, art, and surf culture to the area was something I wasn't going to miss. The historic boardwalk in Asbury Park has hosted numerous concerts and events over the years, like the Warped Tour in the late 1990s, but nothing like a bonafide music festival of this magnitude.\nWhen I arrived on day one of the festival I could tell immediately the site was bigger than I'd anticipated and well organized. The festival had hydration stations and was committed to raising awareness of minimizing plastic pollution and promoting recycling. On the beach, bands were already starting to play and I could just tell it was going to be a great day.\nMeanwhile, the swell that was projected really never came together. There was enough of a pulse in the water for the surfers to put on a show in front of thousands of people, though. As I shot in this arena-type atmosphere it was pretty electric with bands like Soja, Blondie, and the Preservation Hall Jazz Band playing during the heats. When day one of the surfing element was complete everyone hung around catching the beautiful sunset, grabbing dinner from the food vendors and getting hyped for Incubus to perform.\nDay two was just as beautiful. The surf conditions were a bit better and the festival was packed. The crowd was able to see surfers like Brett Barley, Balaram Stack, Sam Hammer, and Pat Schmidt blasting airs. The girls like Cassidy McClain, Quincy Davis, Autumn Hays, and Morgan Inglay surfed great. What struck me was how the crowd interacted with the surfers along the fence line. Bands like Kaleo, The Original Wailers, and Milky Chance played the live soundtrack for all the surfing.Advertisement \nAfter the surfing wrapped I went into a shaping booth set up in the park area of the festival. When I arrived at the tent east coast shaper Ricky Caroll was mowing through a blank as onlookers gathered around to watch him hand shape a blank piece of foam. As we finished our conversation around the tent G.Love & Special Sauce ended their set and the crowd quickly moved from the park back to the beach to get ready for Social Distortion and Jack Johnson. Social D did not disappoint and was joined by special guest, The Boss, Bruce Springsteen! After that set, Jack closed out the festival on the Surf Stage.\nI would be remiss if I didn't congratulate producer, Danny Clinch, C3 Presents and Founder Tim Donnelly on executing such a special festival that people will be looking forward to every year now.\n", "type": "photos", "photo": "https://cdn1.theinertia.com/wp-content/gallery/torchia-jersey-surf-music-festival/tim_torchia_shn_autumn_hays-6122.jpg"}
{"uri": "https://www.theinertia.com/music-art/jake-shimabukuro-queen-bohemian-rhapsody-ukulele", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/09/Bohemian-Rhapsody-343x254.jpg", "title": "This Guy Played the Most Stunning Rendition of Bohemian Rhapsody on His Ukulele", "publish_date": "2018-09-14", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "If you've been to Hawaii, you have likely picked up a ukulele and played around with it. Jake Shimabukuro was no different-until he was much different. Growing up in Honolulu, Shimabukuro picked up a ukulele at the age of four. His mother taught him the basics and he took it from there. Ten years later, Shimabukuro realized that he was, according to his website, \"doing something a little different with the four-stringed instrument - OK, a lot different.\"\nIn 2005, he played a song called While My Guitar Gently Weeps. Someone uploaded it to YouTube, and it blew up. \"Before I got a chance to check it out myself,\" he said, \"the video had gone viral and a lot of music industry folks seemed to know about it. It was crazy!\"\nNow, he's recognized one of the world's best ukulele players. He's been on the top of the Billboard World Music Charts. he's played the Hollywood Bowl, Lincoln Center, and the Sydney Opera House. He's played at Bonnaroo, SXSW, the Playboy Jazz Festival and Fuji Rock Festival. He's been on The Today Show, Good Morning America, Jimmy Kimmel Live!, and  Late Night with Conan O'Brien. He's even played for Her Majesty Queen Elizabeth II. And after you've watched his incredible rendition of Queens's Bohemian Rhapsody, you will understand why he's been able to do all that by playing the ukulele.", "type": "video", "video": "https://youtu.be/IYhcN8p4yhg"}
{"uri": "https://www.theinertia.com/music-art/meet-the-beach-goons-san-diegos-most-un-surf-surf-band", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/08/beachgoons2-343x254.jpg", "title": "Meet the Beach Goons: San Diego's Most Un-Surf Surf Band", "publish_date": "2018-08-30", "author": {"name": "Corey Jones", "url": "https://www.theinertia.com/author/corey-jones/", "type": "Community"}, "text_content": "The Beach Goons\n\n\n\n\n\n\n\nIn just a few short years, San Diego's Beach Goons (comprised of founding frontman Pablo Cervantez, bassist David Orozco, and drummer Chris Moran) have gone from playing local libraries to entering the national buzz band conversation, courtesy of their unique merger of punk, surf, and cumbia music. On their new album, hoodratscumbags (released via GRNDVW), the band conjures an early Strokes-meets-Arctic Monkeys sound that equally captures vintage reverb, distorted guitars and an insane amount of energy.\nHere are some highlights from a conversation with the band itself on the heels of their new album's release:\nPablo, you're 19 years old, so that must mean you started this band when you were an infant. Tell me about your musical upbringing.\nPablo (guitar, vocals): (laughs) I picked up the guitar because my dad had a guitar laying around growing up. I saw it one time, grabbed it, and it felt fun to play. After that - I must have been nine or 10-years old - I begged my mom to buy me a guitar and she finally did. I had an older sister who was really into Depeche Mode and The Cure and a bunch of 80's New Wave. I got really into that, which pushed me to do something with music. That's how it all started.Advertisement \nIs it true hoodratscumbags took you guys two years to write? Why so long?\nPablo: Yeah, that's true. We were really focused on the songs and how they came out. It was all about getting the songs to how we wanted them and working on the record as hard as we could to pump out the best thing possible.\nDavid (bass): We were also shopping the record around and waiting for the right label that we wanted to work with to put it out.Advertisement\nGRNDVW is the label that ultimately put out the album. How did you link up with those guys?\nPablo: They actually emailed us randomly and asked if they could come to a show and if we could get them on a guest list, which we did. After that, they invited us to their offices and that was that.\nYou all will be playing Riot Fest in Chicago in a few weeks. How excited are you for that?\nPablo: We're super stoked. We've never even been to Chicago. That show came through our booking agent and the label. We had nothing to do with it. They offered it to us and we were stoked to go.\nIf each of you could pick a band at Riot Fest to join you on stage for a song, who would it be?\nDavid: Madonna….(pauses for a few seconds). What am I talking about? I mean, Blondie.Advertisement\nChris (drums): Definitely Blink-182. I don't know about the current version of Blink-182, but maybe 2001 Blink-182.\nPablo: GWAR. And I'd love to get Gary Numan on stage with us.\nWhat about the reverse? What band sets would you like to crash?\nDavid: Cypress Hill.\nChris: I would do Sum 41. Are they playing?\nPablo, you've been the sole constant member of the band. What have been the biggest challenges in finding a constant drummer and bassist? Would you ever add a fourth member?Advertisement\nPablo: The difficult part about it has to do with writing the music. When I didn't have members it was me just doing everything in my room by myself. It helped me shape the style and the sound I wanted but adding Chris and David definitely helped a little more and kind of took the stress away. We would definitely add another member and it would probably be a second guitarist just to fill out the sound.\nI read that some of your musical influences include Sly and the Family Stone, Chicano Batman and Descendents. When it comes to your instruments, who would each of you consider your biggest musical influence?\nPablo: I would say James Jamerson on bass from the Motown record family. That was very inspirational on bass to me.\nChris: As far as drummers, I don't know. I definitely grew up on \"dad rock\" music. My dad was super into classic rock and I was really into The Who and the Stones and stuff like that. So I'd probably say Keith Moon. Not to say I listen to The Who a bunch now, but he was definitely who I tried to emulate when I first started learning drums. I wanted to be him.\nDavid: Yeah, it would be Karl Alvarez [from Descendents]. Any bass player that plays really fast and does insane fills is just sick…And [Alvarez] plays with his fingers! It's insane.\nYour song \"Without U\" has 4.5 million plays on Spotify. By any niche-genre standard, that's a lot. Do you ever stop to think about that?Advertisement\nPablo: That really puts it in perspective, but I don't really focus on that kind of stuff. I've seen that number a couple of times and I'll be shocked and amazed and grateful, but most of the time I'm not really focused on it. When I am, it's just insane to even comprehend.\nDavid: It blows my mind. It's crazy because some of the artists that I like…it's just funny to compare the streams and followers.\nBeach Goons\nYou all are in a growth phase where you're going from local favorite to regional buzz band. What was the turning point for you in realizing you were starting to get attention?\nChris: We all agree that there is a big difference between a local band and a national touring band. We're about to get our first taste of touring nationally in a few weeks. We're just really stoked. The shows are getting bigger and bigger and people are just responding super well. Bigger bands come up and are super nice to us. It's awesome. We're grateful for everything.\nPablo: I feel that it built up over time, but there was also a turning point at the beginning of 2017. That's when we stopped playing house shows and just stuck to venues and we really felt a big difference when that happened.\nChris: We started getting paid then, too (laughs).Advertisement\nSpeaking of house shows, you played regularly throughout San Diego for a long time. What are your top San Diego neighborhoods for house shows?\nPablo: I used to love playing down here in Logan. There is a spot called The Stronghold and I used to throw shows there. That's one of my favorite spots. Probably San Isidro too.\nDavid: When I was 13 years old, Lemon Grove was poppin'. It was crazy. There were punk shows there all the time. These days, I don't know. Maybe North Park?\nChris: They get pretty wild all over. It's hard to say.\nYou guys have solid Mexican roots. How do you decide which songs you're going to sing in Spanish and which ones to do in English?\nPablo: We don't. It kind of just happens. If I feel like the song needs to be sung in Spanish, I'll sing it in Spanish. If I feel it needs to be sung in English, I'll sing it in English.Advertisement\nYou've recently stated a desire to distance yourself from the \"surf music\" genre despite your known affiliation with it. Can you speak to that?\nPablo: We try to stay away from that label. Tying down surf music to the whole beach image is just too played out.\nChris: It's been done to death, especially in San Diego. There are bands that are still doing it but to us, it just feels like it's time for something new. We want to distance ourselves from that title as much as we can.\nPablo: I went into the band kind of wanting that association, but because of other bands coming up at the time, it became kind of about fitting the sound just to be able to play shows with them. Over time, we've naturally grown out of it.\nCheck out hoodratscumbags and watch Beach Goons play Riot Fest in Chicago's energetic and fun Douglas Park, September 14-16, 2018. Tickets are on sale now.\n\n", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/how-an-infatuation-with-graffiti-grew-into-my-lifes-work-as-an-artist", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/08/Tutti-Nieves-343x254.jpg", "title": "How Graffiti and the Outdoors Influenced My Life as an Artist", "publish_date": "2018-08-28", "author": {"name": "Henry White", "url": "https://www.theinertia.com/author/henry-white/", "type": "Community"}, "text_content": "At the young age of 13, I became heavily interested in the world of street art and graffiti. Instead of algebra homework, I studied the works of artists like Dondi, Basquiat, and Seen - trying to replicate their letterforms down to every detail. I spent hours if not days scrolling around forums, blogs, and websites focused on my newfound passion.\nI used to beg my mom to drop me off twice a week after school at a place called Elementz. It was a small nonprofit that served the local community as a hip-hop youth center, offering workshops in breakdancing, rapping, and graffiti writing. A few weeks in, we were hired by auto shops around the corner to legally paint their walls, my formal introduction to lettering and the foundation for my nontraditional creative expression. For two years, Elementz provided me the space to explore, learn, and develop my talent.\nIn college, I substituted my pens and pencils for skis and climbing gear. Moving from Cincinnati to the front range of Colorado was too exciting to sit at a desk for long. During that time I studied geography, led backpacking trips, taught climbing courses, and interned for Paradox Sports, an adaptive climbing nonprofit. It was a whole new frontier for me.\nNow living in Los Angeles, I combine my passion for the outdoors with my artistic process. Sustainability and artistic craft are gaining huge momentum in Southern California and I want to be part of that. Whether it is within the outdoor industry, environmental nonprofit world, or conservation groups, I believe creative design, unique branding, and authentic messaging can help make an even greater impression. Throughout the years, climbing, skiing, and surfing have instilled this conscious awareness in me. The outdoor community inspires my art. The simplistic lines, bright colors, and circles represent the clarity and positivity one receives in the mountains and ocean.", "type": "photos", "photo": "https://cdn3.theinertia.com/wp-content/gallery/henry-white-illustrations/alpinesticker.jpg", "caption": "by Henry White"}
{"uri": "https://www.theinertia.com/music-art/this-is-what-it-looks-like-when-animals-shred", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/08/Tigershred-343x254.jpg", "title": "This Is What It Looks Like When Animals Shred", "publish_date": "2018-08-28", "author": {"name": "Kate Barattini", "url": "https://www.theinertia.com/author/kate-barattini/", "type": "Community"}, "text_content": "You may remember the 2015 release of the painted series Animal Shred. Artist Kate Barattini referred to photos of human shredders and if they beckoned for a new and improved animal head, they would get one.\nWe see a familiar favorite in this new series of paintings. You may remember Craig Anderson flying through the air as a lion from 2015 and now we can find Ando tucked into Cloudbreak's sweet shade as another big cat. You'll also find Karina Rozunko perched as an alluring Red Tailed Hawk and Dane Gudauskas tromping through the snow post-cold water session in \"Moose Shred.\"\nThe release of these paintings was held, via a PBR sponsored party (they went through nearly 1,000 beers) in Charleston, South Carolina where Kate teamed up with talented surf photographer, Justin Morris, to present Animal Shred in two mediums - one painted and the other photographed. Justin and some trusting local surfers collaborated to bring Animal Shred to life with a showcase of photos that are equally as bizarre as they are lovely.\n\"Surfing with those masks on was incredibly difficult making for a lot of laughs in the water,\" exclaims Barattini. \"I do wish shortboarding with the masks on was possible and I think it would be if we had better surf; it's certainly something to look forward to in the future. However, I am really stoked on the shots Justin came away with. It's always wonderful working with him and it is exciting to see the concept shared in a new form.\"Advertisement \nSee more of Kate Barattini's work here and Justin Morris' here.", "type": "photos", "photo": "https://cdn2.theinertia.com/wp-content/gallery/animal-shred-kate/moose-shred.jpg", "caption": "Moose Shred, by Kate Barattini"}
{"uri": "https://www.theinertia.com/music-art/kelly-slaters-daughter-taylor-had-an-art-show-in-montauk-and-it-was-a-huge-success", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/08/kVi4Xl4A-343x254.jpg", "title": "Kelly Slater's Daughter, Taylor, Had an Art Show in Montauk and It Was a Huge Success", "publish_date": "2018-08-22", "author": {"name": "Dylan Heyden", "url": "https://www.theinertia.com/author/dylan-heyden/", "type": "Staff"}, "text_content": "Taylor and Kelly Slater pose for a proud dad moment at Taylor Slater's first solo art show in Montauk. Photo: Courtesy of Danielle Beckmann\n\n\n\n\n\n\n\nWe've been a fan of Kelly Slater's daughter, Taylor Slater, for some time. In the way that Kelly Slater is a world champion and multi-hyphenate, his daughter Taylor is excelling in the art world producing beautiful works from resin and paint on wood to incredible photography to stunning short films.\nHer meteoric rise recently caught the attention of Danielle Beckmann, curator at 1Ocean Collection, who knew that a young artist of Taylor's ability needed an opportunity to showcase her work. The result? Taylor held her first solo art show ever earlier this month, called \"One Ocean Seven Strawless Seas,\" at the Montauk Beach House, and it was wildly successful.\nFor the show, Taylor partnered with Lonely Whale, a New York and Seattle-based non-profit that cultivates innovative ideas to solve problems plaguing the world's oceans. As it were, the environmental activist apple doesn't fall too far from the proverbial tree.\n\"Untouched Beauty\" by Taylor Slater.\nFor Taylor, the ocean is her source of inspiration, and to tie in the need to protect it was simply a natural extension for her.Advertisement \n\"My art is really a reflection of the places I've been,\" Taylor told me in a phone call before the show. \"I've had the opportunity to travel to some of the world's most beautiful places with my dad - from Hawaii to Australia - and those are the places that inspire me. You'll notice that not one of my paintings shows a lineup littered with trash because I want to show the beauty of the natural environment.\"\n\"Ehukai\" by Taylor Slater.\nIn some sense, Taylor's artwork in the way its meant to depict famous coastlines like Ehukai Beach Park and Sandy's from above is equal parts moving and aspirational. No colorful umbrellas, people, or trash dot the space meant to represent the sand on the beach. Not a single surfer sits out in the lineup.\nWhen I spoke to Danielle Beckmann in the days following the show, she was still buzzing. \"It was the single most moving display of support for a young artist I've ever seen in my lifetime,\" she said.Advertisement\nThe artist enjoying the day. Photo: Courtesy of Danielle Beckmann\nPops Kelly Slater turned up to support along with serious art collectors from New York City and beyond. \"Jimmy Buffett even made an appearance,\" said Beckmann.\nThe weekend, said Beckmann, was an absolute whirlwind.\nJimmy Buffett, Taylor Slater, and Kelly Slater. A cheeseburger in paradise. Photo: Travis Beckmann\n\"I'm humbled by this opportunity to share my work with the public,\" said Taylor. \"Being able to connect with and support Lonely Whale's efforts with their #strawlessocean campaign feels right. I hope this brings other artists to the forefront and inspires them to join this amazing effort.\"\nCheck out more of Taylor Slater's art on her website or follow her on Instagram at @taylrsltr and @taylrsltrartofficial.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/how-this-american-artist-is-helping-south-africans-tackle-the-water-crisis-in-cape-town", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/08/02-web_Jared-Aufrichtig_Water-Into-Gold_IPAF-South-Africa-Mual-2018_Photo-by-Daniel-Knab-343x254.jpg", "title": "How This American Artist Is Helping South Africans Tackle the Water Crisis in Cape Town", "publish_date": "2018-08-16", "author": {"name": "Juan Hernandez", "url": "https://www.theinertia.com/author/wan-hernandez/", "type": "Staff"}, "text_content": "This year, the Cape Town International Public Arts Festival focused on raising awareness of the mishandling of nature and more specifically, spreading messages that hit home about the impending \"Day Zero\" - a mark on the calendar when Cape Town is expected to run out of water and its four million residents will be required to collect daily water rations: less than seven gallons (25 liters) for each person.\nFor a long time now, Cape Town was expected to completely run out of water as the result of an extreme drought. In February of this year, Day Zero was pushed back to July. And then it was moved back once more to an indefinite date in 2019. The indefinite date seems appropriate given that while the people of Cape Town have been making positive efforts to conserve water and fight off a disaster, there's still uncertainty about when and how the problem will ever actually be solved.\nJared Aufrichtig, an artist from Los Angeles, was one of the 35 artists in the International Public Arts Festival this year whose work helps the festival raise money and awareness to aid Cape Town's fight against Day Zero. He created a public mural called \"Water Into Gold\" and leads youth development workshops, painting more murals with Cape Town's kids.Advertisement \n\"A change in the behaviour fundamentally starts in the mind,\" the IPAF says about the festival and their Salt River School. \"A small incremental change in the way we think spurs on an evidential change in our behaviour.\"\nThe sentiment is pretty straightforward. Awareness through art can influence people to make the small, positive changes toward getting Cape Town out of their disastrous drought. It doesn't put water in reservoirs but it can help keep South Africans focused on the changes they've had to make: cars don't get washed, sidewalks aren't hosed down, showers are kept under two minutes, and so on. All preservation efforts that have kept pushing that Day Zero date back further and further.\nIPAF's Salt River tours give visitors a history of the neighborhood and tours of the murals created by 70 different artists from around the world. Guests then learn a bit about each artist's technique and the story behind their murals, just like Jared's, followed by a workshop and meeting with the artist personally. All the revenue from the guided tours is then used to uplift children in the community through art education and raise more awareness for the people of Cape Town and their mission to fend off Day Zero.Advertisement\nLearn more about IPAF here. \nArtist Jared Aufrichtig teaching one of his workshops with Cape Town's youth. Photo: Daniel Knab", "type": "video", "video": "https://youtu.be/kvDgKhd3Peo"}
{"uri": "https://www.theinertia.com/music-art/reel-big-fishs-johnny-christmas-on-the-end-of-the-iconic-vans-warped-tour", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/08/johnny-christmas-343x254.jpg", "title": "Reel Big Fish's Johnny Christmas on the End of the Iconic Van's Warped Tour", "publish_date": "2018-08-04", "author": {"name": "Kasey Schmidt", "url": "https://www.theinertia.com/author/kasey-schmidt/", "type": "Staff"}, "text_content": "This is the final run of the historic Van's Warped Tour. But it's not the end.\n\n\n\n\n\n\n\n\"All good things must come to an end.\" It's cliché and it's sentimental, but it's certainly true in the case of the Van's Warped Tour.\nIn November of last year, creator Kevin Lyman announced the end to the traveling ensemble of the dreaming, screaming, up-and-coming bands. For over two decades, they have faced the wrath of the American summer to bring a unique, affordable experience to every major city in the country. Starting in late June and extending into early August, bands and fans travel cross-country to meet one another and share their love for music. The last stop on the tour will be at Coral Sky Amphitheater in Palm Beach, FL on Sunday, August 5th.\nReel Big Fish stepped onto the scene in the late '90s with a not-so-serious ska-punk style. Hits from the '90s like \"Sell Out\" and their cover of A-ha's \"Take On Me\" featured the fast and furious tempo of a blaring trumpet. Recently, I got the chance to listen to the pipes behind that iconic trumpet: Johnny Christmas.\nJohnny is as affable as the notes he sends out of his trumpet. He is just as jolly as his last name conveys, and he had a perfect perspective on the life of a traveling Warped Tour band member.Advertisement \n\"It's wonderful and terrible all at the same time,\" he said, recounting the unfathomable heat of the summer, the sun beating down on a parking lot filled with fans all grooving and cheering on up to five bands at a time. \"Wonderful bands… all at the same time? Not so wonderful.\"\nThe tour truly is unique. Johnny described the moments: the meet-and-greets and the connections with fans, the times when he's tired, sweating, and sun-poisoned, but still can't wait for the next day. He spoke of the flow of knowledge that moves through a community of bands all traveling together, some of them veterans, some of them teenagers with a dream, but all of them spending the summer fueling their passion for music. \"It's huge for these music fans to meet their heroes,\" said Johnny. \"And it doesn't cost them an arm and a leg to do it… or a pancreas.\"\nJohnny wants Van's Warped Tour fans to follow the bands that they have been chasing since their tender teenage years. He reminded them to keep following their childhood heroes and to keep traveling in search of a new or nostalgic sound. Image: Facebook/Reel Big Fish/Will Byington\nNot long into our conversation, I asked Johnny what message he would send to the fans wandering the country and wondering what's next. He paused for a moment, and I could almost hear him stroking his mustache in thought. \"Don't give up on your bands,\" he responded. Maybe it was the poor reception or maybe it was my haste to write down everything he said, but the word I heard at the end of that phrase was different. Initially, I heard Johnny say, \"Don't give up on your dance.\"Advertisement\nFor some reason, the parallels between these two phrases struck me as wonderful. Johnny wants Van's Warped Tour fans to follow the bands that they have been chasing since their tender teenage years. He reminded them to keep following their childhood heroes and to keep traveling in search of a new or nostalgic sound.\nThe message I received, however, was much broader. We travel to concerts, drive across the country, and stand in the sun for five hours of the day listening for that same sound that made our world light up at seventeen. We move and grow and work and play and age and forget-and sometimes, we give up on the things that make us really happy. As much as we think this might be inevitable, it doesn't have to be. Nothing ever truly ends, and no one ever has to give up on something that makes them happy.\nLater in the call, Johnny told me about Reel Big Fish's new album coming out in the fall of this year. It's titled \"Life Sucks, Let's Dance.\" He described his goal to live sincerely and promised his listeners a message to inspire. \"We're going to make you laugh, we're going to make you dance, we're going to make you raise your middle finger,\" he said. \"We're going to make you forget about your problems and live.\"\nCall it my terrible hearing, or call it a sign from the universe, but the message I received from my chat with Johnny Christmas was clear:  Whatever it is, don't give up on your dance.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/how-does-a-music-festival-in-san-diego-lay-out-the-blueprint-for-protecting-our-oceans", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/07/Ice_Cube_Cougar_Chronicle_Drentea_Kaaboo-1-343x254.jpg", "title": "How Does a Music Festival In San Diego Lay Out the Blueprint for Protecting Our Oceans?", "publish_date": "2018-07-31", "author": {"name": "Michael Drentea", "url": "https://www.theinertia.com/author/mike-drentea/", "type": "Community"}, "text_content": "Photo: KAABOO\n\n\n\n\n\n\n\nSeptember's KAABOO music festival is an adult playground of music, art, comedy, cuisine, crafts, and indulgences carefully curated to appeal to all five of your senses. This year's KAABOO Del Mar 2018 lineup has some of the biggest musicians and artist performing including the Foo Fighters, Katy Perry, Halsey, Post Malone, Wiz Khalifa, Gucci Mane, Incubus, and more. But its focus on reducing our carbon footprint, recycling, and reducing single-use plastics reveal a positive trend in today's festival organizing approach.\nOffstage, the 4th Annual Rock'n Chef Competition will take place Saturday, September 15. Chefs will be competing head to head for a \"winner-takes-all\" prize. The 2018 participating chefs include Dakota Weiss (Sweetfin), Joe Sasto III (Cal Mare), Tu David Phu (Hawker Centre), and Claudette Zepeda-Wilkins (El Jardín). Finalists earned their opportunity to compete for the grand prize through several qualifying rounds in regional competition throughout Southern California.\nOutside of all the music and commotion, KAABOO was organized with a dedication to protecting our oceans, waves, and beaches. For every dollar of every pass sold by KAABOO, donations will be split equally among four community partners, all chosen based on their impact in the local San Diego community. For example, their donation to the Surfrider Foundation San Diego will contribute to supplies for cleaning up local beaches.\nEnvironmental sustainability is also embedded into the festival's culture and is represented by plenty of recycling bins prominently placed throughout the park:Advertisement \nRecycling and Composting\nGuests can look for the blue recycling receptacles to dispose of recyclables, instead of throwing them in the trash. KAABOO hopes to increase our recycling by 15 percent this year compared to last year.\nIn addition, KAABOO will send all pre-consumer food to the Del Mar Fairgrounds Worm Farm, a vermicomposting site at the Del Mar Fairgrounds. Worm farming is a simple way of turning vegetable and fruit scraps into great potting soil.\nReducing Single-Use Plastic\nThe festival will have complimentary water stations. Guests can grab souvenir bottles from one of the apparel and merchandise stores on site and then just refill them with cold, clean water. KAABOO and Surfrider Foundation will be providing water bottles to staff to avoid the use of disposable plastic bottles.Advertisement\nReduce Carbon Footprint, Ride Together\nKAABOO Del Mar offers several eco-friendly transportation solutions to accommodate your needs:\nCarpooling: find people driving or looking for a ride from your area and ride together\n-Public transportation: hop on a Coaster, Sprinter, Breeze, bus or trolley\n-Ridesharing/taxi\n-Coach Buses: arrive and return on the same day without driving\nLearn more about KAABOO 2018 in Del Mar here.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/lucky-757-is-an-old-school-surf-rock-throwback", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/07/757Angel-343x254.jpg", "title": "Lucky 757 Is an Old School 'Surf Rock' Throwback", "publish_date": "2018-07-20", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "Photo: Lucky 757\n\n\n\n\n\n\n\nMusic is a clear and direct way to pay tribute to the past and in surfing, no sound creates more nostalgia than that reverb-drenched electric guitar. It's so distinct you can picture Miki Dora cruising First Point Malibu with Dick Dale providing the soundtrack anytime you hear it.\nIn The Encyclopedia of Surfing, Matt Warshaw defines \"surf rock\" by two categories: \"The pulsating, reverb-heavy, 'wet'- sounding instrumental form exemplified by guitarist Dick Dale, and the smooth-voiced, multitracked harmonized vocal style invented by the Beach Boys,\" he says. \"Purists argue that surf music is by definition instrumental.\"\nIf anybody is giving an appropriate nod to those days, it's Virginia-based band, Lucky 757.\n\"We were originally drawn to surf rock because we grew up on and loved the sound of The Ventures, Dick Dale, and The Safaris,\" band member Sam Haga says.\"We started learning a lot of their tunes and wanted to put out our own take of surf instrumental music, so we started writing some tunes. Mar Agitado came first which translates as, Rough Seas. We loved it and knew we had to keep going after that.\"Advertisement \n\nThe band releases their newest album, Lonesome Lagoon, on July 21, 2018.  A dive into the backstory of how they came together in 2014 and have developed their music to show a clear and conscious connection to the roots of their sound. \"Lucky 757 started out as a rockabilly band playing tunes from Gene Vincent (from our hometown in Virginia) and his Blue Caps, Carl Perkins, Jerry Lee Lewis, and others,\" Sam adds. \"This paved the way for us to get into surf rock just as Dick Dale had played rockabilly before pioneering surf music. Nokie Edwards of The Ventures also played with Buck Owens and the Buckaroos. Both genres were critical to popularizing the whammy bar and use of reverb which are still widely used.\"\nGive 'em a listen and you'll recognize it, clear as day.Advertisement\nUpcoming dates for Lucky 757 performances can be found here, including their July 21 album release show at Turner's High Noon Bar in Avon, North Carolina. Find them on iTunes here.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/ocean-sole-flip-flop-conservation-art", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/06/ocean-sole-343x254.jpg", "title": "This Kenyan Group Is Turning Discarded Flip Flops Into Amazing Works of Art", "publish_date": "2018-06-30", "author": {"name": "Alexander Haro", "url": "https://www.theinertia.com/author/alexander-haro/", "type": "Staff"}, "text_content": "If you have been to a beach in your life-which, if you're reading this website, you probably have-you have seen garbage. It washes up on all corners of a globe, a plastic pandemic of epic proportions. We haphazardly throw our plastics out the windows of our lives, strewing them along roadways, into ditches, and down drains. Plastic is everywhere in our lives, and each piece, from the keys on your keyboard to the bottle of juice in your fridge, will be around long after we're gone. There are a variety of different outfits attempting to do something about it, but none of the results are quite as eye-catching as Ocean Sole's, a Kenyan marine conservation group that collects thousands of discarded flip flops and turns them into incredible works of colorful art.\n\nOcean Sole was started in 1999 by Julie Church, a Kenyan biologist who noticed that children were making toys out of old sandals that washed up on beaches of Kiwayu, a tiny island in the Lamu Archipelago in Kenya's Kiunga Marine National Reserve. There isn't much on the island-one school, no hospital, and few jobs save for fishing. Church, however, saw an opportunity to create jobs and clean up the place in the process. She encouraged residents to collect, wash, and cut up old flip flops into works of art. One year later, Ocean Sole sold their first batch of artworks in Nairobi. Soon after, WWF Switzerland heard what Ocean Sole was doing and placed an order for 15,000 upcycled turtles.\nBy 2005, word was spreading. Their mission and their products were in stores in Rome, London, New York, Paris, Amsterdam, Singapore, and Australia, and the number of employees went from three to 50. Now, Ocean Sole has cleaned up well over 1,000 tons of flip flops and provides income to 150 Kenyans. It also contributes 10 percent of their revenue to marine conservation programs. It makes whales, turtles, manta rays, octopuses, and dolphins, among many other animals, as well as door stops, keychains, and jewelry, all from garbage.Advertisement \nLike they say, one man's trash is another man's treasure. Church asked a very simple question that we should all consider more often: \"When someone says they're throwing something away,\" Church said back in 2014, \"where is 'away?'\"\nSee more from Ocean Sole on their website and follow them on Instagram and Facebook.\n\n", "type": "video", "photo": "https://cdn2.theinertia.com/wp-content/gallery/ocean-sole/os1.jpg", "video": "https://youtu.be/2Cb4cZp0n4k"}
{"uri": "https://www.theinertia.com/music-art/xavier-rudd-performs-acoustic-storm-boy-the-inertia-hq", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/06/xavierrudd1200-343x254.jpg", "title": "Xavier Rudd Performs Brand New Album, 'Storm Boy,' at The Inertia HQ", "publish_date": "2018-06-19", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "When Australian singer/songwriter Xavier Rudd breezed through barefoot in a tie-dye denim jacket and hat to serenade us with songs from his new album, Storm Boy, we were not bummed. We were actually moving offices that day, but we decided to stave off the move because we were so pumped to have him.\nTo be clear, we didn't intentionally set out to have Xavier turn up as we said goodbye to our humble Venice offices. But it turned out to be a perfect reprieve from packing and an excellent little send-off. Something for the floors above to remember us by.\nSo without further ado, we present to you the sweet sounds of Xavier Rudd.Advertisement \nEditor's note: Xavier is currently on his Storm Boy World Tour. For more information, and to see him live in a town near you click here.\n \n\n", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/this-is-vance-joy-with-a-pop-up-concert-at-a-skate-park-in-texas", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/06/vance-joy-343x254.jpg", "title": "This Is Vance Joy With a Pop-Up Concert at a Skate Park in Texas", "publish_date": "2018-06-14", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "James Gabriel Keogh-who took his stage name Vance Joy, from the Peter Carey novel Bliss-has a way with the ukelele. Here, the writer of the uber-hit \"Riptide\" wails on his uke in a Grand Prairie, Texas skate park, playing the song, \"Saturday Sun,\" ahead of a concert stop supporting his new album, Nation of Two.", "type": "video", "video": "https://youtu.be/a-UxPhCY9K4"}
{"uri": "https://www.theinertia.com/music-art/these-collages-perfectly-capture-the-creative-chaos-that-is-riding-a-longboard", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/06/Stumble-VI-2018-1-343x254.jpg", "title": "These Collages Perfectly Capture Longboarding's 'Creative Chaos'", "publish_date": "2018-06-05", "author": {"name": "Filipa Costa", "url": "https://www.theinertia.com/author/filipa-costa/", "type": "Community"}, "text_content": "I started creating the Stumbles Series in the beginning of 2018. These small digital collages were inspired by a particular song with the same name (from Kraak &Smaak) and are an ode to longboard culture.\nI try to capture the flowing movements of the many characters, not only by their own display but also in the particular way they insert themselves within the different layers, colors, patterns, and textures.\nThe handmade collages were created for Surf Leça and once they were completed I realized how much I enjoyed the work. From small dimensions to large canvases, paper cuts, billboards, fins, and surfboards, I started to make my own universe filled with \"creative chaos\" that is a path to an exotic and fragmented environment.\nThe main influences in this work include:Advertisement \nSurf: It is part of my roots and family history (I started working in my father's surf shop when I was a teenager). The sea is a source of inspiration (I have always lived by the sea and today I work right in front of the beach).\nLeça da Palmeira: This is where I live and work. It is a land full of charm and a very interesting heritage.\nInterior Design: Interior design was part of my studies and I work every day with this in Surf Leça. The colors and patterns are a constant in my works.Advertisement\nIndia: I have a fascination with the country thanks to its cultural and religious diversity. It is possible to see influences in my work like mandalas and even the figure of some Hindu gods such as Ganesh, Lakshmi, Brahma, Shiva, and Vishnu.\nFraming: Framing is one of the things I'm most concerned about. All my digital collages come with a carefully chosen frame, considering the format and color(s) of the work. I like to highlight them from the bottom and give them tri-dimension and consequently movement. All collages are different because I use pens on the top of the prints as a way to personalize them.\nEditor's Note: Filipa Costa created Surf Leça in Portugal, an innovative surf shop that doubles as an art gallery.", "type": "photos", "photo": "https://cdn1.theinertia.com/wp-content/gallery/leca-longboards/stumble-i-2018.jpg", "caption": "Stumble I, 2018Photo: Filipa Costa"}
{"uri": "https://www.theinertia.com/music-art/this-art-inspired-surf-contest-brings-new-meaning-to-the-words-expression-session", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/05/art-and-surf-composite-beard-343x254.jpg", "title": "This Art-Inspired Surf Contest Brings New Meaning to the Words 'Expression Session'", "publish_date": "2018-05-07", "author": {"name": "Matt Beard", "url": "https://www.theinertia.com/author/matt-beard/", "type": "Community"}, "text_content": "Sliding into my own artwork somewhere in La Jolla. Photo: PMK\n\n\n\n\n\n\n\nSomehow, I keep falling into this role. I never intend to be an event organizer but what else can be done when a good idea comes around and nobody else is going to take charge? So I find myself once again attempting to gather a dozen surfing artists from both coasts of the US and corralling them on the beach in Carlsbad.\nOn the morning of May 12, they'll all gather to show off their surf-inspired art in a unique way. Rather than hanging their work in a gallery, they'll actually be creating it on the beach immediately after catching waves. It's all part of an informal competition hosted by the San Diego Film Festival. This year's event will take place along the shores of Carlsbad State Beach with the main surfing portion taking place from 8-9 am, followed by an open-air art session until 1 pm where each artist will create one work of art from start to finish on the sand. In keeping with tradition, the official artist of the San Diego Surf Film Festival, Wade Koniakowsky, has been nominated (and agreed) to be the judge for this year's event. \"I'm really looking for art that tells the story of this gathering… or good bribes, it's not like they pay me for this gig,\" Koniakowsky says.\nThis will be the third year that I've been organizing these semi-competitive events, in conjunction with the San Diego Surf Film Festival. Art shows featuring surf-themed art have become commonplace all over the world, but they are often held indoors and sometimes nowhere near the ocean. In settings like these, the words \"surf\" and \"art\" are presented as these unmovable concrete nouns, instead of the verbs that they really are. The artists and public alike stand around at these events wearing things like…shoes. So the Expression Session Invitational was created to remedy that artistic gap.\nSome of this year's participating artist's include Jeremy Harper (Santa Barbara, CA), Jesse Miller (Laguna, CA), Jeff Yeomans (San Diego, CA), Colleen Gnos (Avila Beach, CA), and Jon Baker (Atlantic City, NJ). A complete list of artists and more information about this year's event, as well as event highlights and photos from previous years can be found here.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/creative-lines-that-fuse-inspiration-from-music-and-surf", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/05/Longboardtwins-343x254.jpg", "title": "Creative Lines That Fuse Inspiration From Music and Surf", "publish_date": "2018-05-04", "author": {"name": "Alexandra Siebert", "url": "https://www.theinertia.com/author/alexandra-siebert/", "type": "Community"}, "text_content": "Editor's Note: Alexandra Siebert is an Illustrator from Germany. Currently, she lives in France next to Hossegor, working as an illustrator and surf instructor.\nI started to surf when I was a teenager. Since then, I was traveling and surfing a lot. In my Communication Design Studies, I focused on Illustration. My work is a lot about traveling and surfing but also inspired by experience and music.\nYou can find more from Alexandra on Instagram here, as well as her upcoming #CreativeLines takeover of the Inertia's Instagram here.", "type": "photos", "photo": "https://cdn2.theinertia.com/wp-content/gallery/creative-lines-alexandra-siebert/alaiasurfing.jpg", "caption": "Alexandra Siebert // @alexandra.siebert"}
{"uri": "https://www.theinertia.com/music-art/i-started-doodling-surf-and-skate-art-on-my-binders-as-a-kid-and-never-stopped", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/05/IMG_9829-343x254.jpg", "title": "I Started Doodling Surf and Skate Art on My Binders as a Kid and Never Stopped", "publish_date": "2018-05-02", "author": {"name": "Sean Bernhardt", "url": "https://www.theinertia.com/author/sean-bernhardt/", "type": "Community"}, "text_content": "I've always been inspired by surfing and skateboarding. I first took interest in them when I was very young - probably around just 8 or 10-years old - doodling random surf or skate logos on my binders. Then after 8th grade, I started pushing myself to experiment more and more with my art, taking art classes over the years.\nI always took advantage of going to the beach whenever I could, living so close to it. Street art and graffiti inspired me a lot growing up too. It made me look at things in a completely different way and experiment more often. After years of experimentation with so many mediums, in 2012 or so, I started to draw more. I traveled to Nicaragua and did some work for Vissla and Jaks Garage in Japan, sharing a ton of my work on social media. More and more people started hitting me up for commissioned branding work and apparel designs, and now I've gathered a steady flow of freelance work for myself, grateful to be doing what I enjoy with the freedom to do whatever I choose artistically. The more I create, the more psyched people seem to get, which in turn keeps inspiring me even more.\nLately, I've been making a lot of collages and drawing, experimenting with even more new ideas - random things that come to mind in the late hours of the night, rushing to jot them down on my phone so I don't forget them by the time the morning comes.\nEditor's Note: You can find more of artist Sean Bernhardt's work online as well as on Instagram. He also has a clothing line, Evil Paradise, featuring his artwork.", "type": "photos", "photo": "https://cdn3.theinertia.com/wp-content/gallery/sean-bernhardt-art/img_0157.jpg", "caption": "Photo: Sean Bernhardt// @space_bat_killer"}
{"uri": "https://www.theinertia.com/music-art/this-surf-shop-doubles-as-a-wave-riding-art-gallery", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/05/Stoked_Group-Art-Show_Surf-Leça-I-343x254.jpg", "title": "This Surf Shop Doubles as a Wave-Riding Art Gallery", "publish_date": "2018-05-02", "author": {"name": "Filipa Costa", "url": "https://www.theinertia.com/author/filipa-costa/", "type": "Community"}, "text_content": "\"If surf is the phenomenon of Leça da Palmeira, why not view it in an artistic way?\" This was the starting point of an innovative project in Portugal by Filipa Costa.\nThe adventurous spirit comes from her father, Francisco Costa, founder and former owner of the first surf shop in Leça da Palmeira. With such an interesting background, Filipa proposed a unique concept for the shop after completing her studies in art history. The shop would function as equal parts art gallery and surf shop.\nLocated on the busiest street in Leça da Palmeira, this \"beach gallery,\" as Filipa calls it, contrasts from other businesses in the area. It's a comfortable and relaxed environment decorated with vintage and retro furniture inherited from her grandparents, which perfectly matches its concept. Surf Leça is a true taste of surf culture and never forgetting its ties to bodyboard, snowboard, yoga, meditation, and street art.\nSince April 2012 Surf Leça has hosted several exhibitions, participated in art markets, and hosted events related to surf and environmental causes. In its collection are names like Catarina Machado, Tó Mané, Isabel Monteiro, Filipa Costa, João Pedro Rocha, Bart, Porto in Patterns, Elena Grib, Lizzy Artwork, Tamara Artwork, Marita Forss, Márcia Luças and Miguel Sotto Mayor.Advertisement \nThe current group art show is \"STOKED.\" Exploring techniques like painting, drawing, illustration, collage, photography on canvas, paper, cardboard, a surfboard, fins and even an ironing board, this art show is represented by artwork displayed on surfboard fins. Artists include: Marlin Fins customization by António Alfarroba, Bart by Ana Lisa, Catarina Machado, Cláudia Guerreiro, Elena Grib, Filipa Costa, Hanna Szymanska, Isabel Monteiro, João Catarino, Lizzy Artwork, Márcia Luças, Maria Valadares, Marta Baptista, Miguel Sotto Mayor, Nuno Draws, Pedro Ferreira, and Porto in Patterns.\nWorkshops, urban interventions, yoga and meditation classes, movie sessions, and environmental and charity fundraisers are all on the calendar for this unique take on a surf shop, many of them in partnership with tourism and cultural organizations in the region. And Surf Leça is always receiving portfolios from young artists who identify with the shop's theme.\nNote: You can learn more about Surf Leça on both Instagram and Facebook.", "type": "photos", "photo": "https://cdn2.theinertia.com/wp-content/gallery/surfleca-v2/leca1.jpg"}
{"uri": "https://www.theinertia.com/music-art/surf-inspired-art-that-captures-the-little-things-in-our-wave-obsessed-lives", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/04/scimmia-nuova-343x254.jpg", "title": "Surf-Inspired Art that Captures the Little Things in Our Wave-Obsessed Lives", "publish_date": "2018-04-27", "author": {"name": "Danilo Petraccini", "url": "https://www.theinertia.com/author/danilo-petraccini/", "type": "Community"}, "text_content": "I live in a small village in Italy surrounded by nature and the sea. My art is inspired by a passion for surfing, by nature, by travel, and for the respect of the environment and animals. I love bearded people and I like to convey the joy of living and the ironies I see in everyday life.\n \nEditor's note: You can follow Nilo and find more of his work on Instagram here. We're big fans! And be on the lookout for Nilo's upcoming takeover of The Inertia's Instagram page here.", "type": "photos", "photo": "https://cdn1.theinertia.com/wp-content/gallery/danilo/adventure.jpg", "caption": "This design represents when surfers go in search of waves, bringing every essential thing for survival, and we marvel at the beauty of nature as in this case the moon. Photo: Danilo Petraccini"}
{"uri": "https://www.theinertia.com/music-art/surf-and-ocean-inspired-double-exposure-photography", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/04/espo-double-exposure-CS-343x254.jpg", "title": "Surf and Ocean-Inspired Double Exposure Photography", "publish_date": "2018-04-25", "author": {"name": "Brenton de Rooy", "url": "https://www.theinertia.com/author/brenton-de-rooy/", "type": "Community"}, "text_content": "Showcasing a unique take on surf photography, the Essence of H2O exhibit dove into Brenton de Rooy's collection of double exposure surf photography along with other surf and ocean-inspired works to share his deep connection to the ocean.\nBrenton grew up in Forster, a small coastal town on the Mid North Coast of Australia. Spending most of his time in the ocean, it was only a matter of time until he picked up a camera and started shooting images.\nBrenton's approach to his photography is an extension of his laidback, easy going and fun personality while holding high standards and being a perfectionist when it comes to this art form. He continues to push his own boundaries by experimenting and developing different abilities, not just through the lens but also in post-production. This fine art approach to surf photography is strongly represented in this exhibition.\nNote: You can follow photographer Brenton de Rooy on Instagram here.", "type": "photos", "photo": "https://cdn1.theinertia.com/wp-content/gallery/brenton-de-rooy/aaron-x-kirra.jpg", "caption": "Photo: Brenton de Rooy // @brentonderooyphoto"}
{"uri": "https://www.theinertia.com/music-art/over-the-past-15-years-ive-painted-over-400-vistas-across-840-miles-of-california-coast", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/04/Screen-Shot-2018-04-22-at-19.03.09-343x254.jpg", "title": "Over the Past 15 Years, I've Painted Over 400 Vistas Across 840 Miles of California Coast", "publish_date": "2018-04-23", "author": {"name": "Matt Beard", "url": "https://www.theinertia.com/author/matt-beard/", "type": "Community"}, "text_content": "It's been more than five years since I last shared my work on this platform. At that point, at least for the moment, my art life was done. Turkey was cooked. Over it. An odd thing to write in a public forum like this, but stress leads us to all sorts of strange decisions, no?\nFortunately, the project that brought me to the brink of artistic ruin finally ran its course and I embarked on a quiet mission to disappear into the rocky folds and winding roads of the California coast in every part of the state. It was a return to what mattered - an unplugging of sorts and a reconnecting of others where I remembered what had driven my art for so long - painting the entire California Coast.  After 15 years of working toward this goal, I am proud to introduce this first volume of my life's work.\nCalifornia is a big place. I don't make any claims to having truly painted all of it. There's always a spot around the corner to explore, and only so much time in a day. But I have made a point to paint as much of it as I possibly can and I don't know of too many artists out there who have dedicated themselves to the whole state's coastline with quite as much intentionality as I have.Advertisement \nWhile I have painted over 400 locations on the 840 miles of California's coast, averaging about 2.07 miles between each painting, there is still a lot of work to do. For every vista painted there's a multitude of others that will have to wait for another day. It doesn't matter how many times one makes this trip, many a stone will always be left unturned.\n\nMany hours of driving and hiking, many nights of sleeping in cars and on couches, many unsuccessful efforts at dodging poison oak and ticks, many fences hopped, and many more efforts to access private coastlands that have ended in frustration as I've put in time and paid my dues (or at least my parking tickets). I think you'll enjoy this volume of work, carefully presented with much respect to the people who call these places home, and glued together with the ramblings of my mind and heart often recorded at night in the van before dozing off to sleep on the side of the road.Advertisement\n\nMany will ask, \"why are none of the locations named anywhere in this book?\" If this was a guidebook to the California Coast, it would surely be one of the worst ever made. So be it. For as long as I can recall, I've had an awkward policy of refusing to name locations and the reason for my restraint is simple: respect. As a lifelong surfer, I know the frustrations that crowds can bring. As a lifelong lover of the outdoors, I also know the damage that we can collectively do to the natural beauty of a place when we arrive en masse. Many places I paint are vulnerable to both of these problems and out of respect for those that live there and seek regular solace in these settings off the beaten path. I make every effort to celebrate their beauty without handing the keys to the kingdom over to the Legions of the Unjazzed, to borrow a phrase from Phil Edwards.\nSure, I could name the obvious ones and not worry about revealing what is already widely known, but even that could bring unwelcome attention by making those hidden treasures all the more conspicuous just by their lack of specifics. Those who know will know, those who don't will instead wonder and seek and find on their own. By withholding the easy answers, I am providing something greater in exchange, a journey of open-ended discovery.\nWelcome to California. Please enjoy the trip. And remember to do your part when you're out exploring your own Golden State. Be kind, drive safe, pack your trash, and leave no trace.\n- Matt Beard\nNote: You can learn more at mattbeardart.com/book Advertisement\nVarious samples of my artwork from the California Coast.", "type": "video", "video": "https://youtu.be/BfOlY6VtFGg"}
{"uri": "https://www.theinertia.com/music-art/the-atlantic-ocean-just-dropped-the-hottest-single-of-2018", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/04/keynvor1-343x254.jpeg", "title": "The Atlantic Ocean Just Dropped the Hottest Single of 2018", "publish_date": "2018-04-20", "author": {"name": "Dylan Heyden", "url": "https://www.theinertia.com/author/dylan-heyden/", "type": "Staff"}, "text_content": "Surfers are all too familiar with the myriad sounds of the ocean. The hiss the water makes as it reaches the shoreline and slides up the sand. The explosive way the lip of a hollow wave cracks through its trough. The sounds are so familiar, in fact, they've become downright mundane.\nA recent collaboration, though, between Sharp's Brewery in Cornwall, UK and Universal Music seeks to harness the musicality of the ocean's sounds. \"We took the sounds of the ocean and turned them into a recording artist called 'Keynvor,'\" explains the video above, \"Keynvor\" being the Cornish word for ocean. \"Every stream will create royalties for the ocean, allowing it to protect itself.\"\nKeynvor's first single is in collaboration with Sebastian Plano the contemporary composer from Argentina. All royalties go to Surfers Against Sewage.Advertisement \nWe recommend you stop what you're doing, throw those headphones on and enjoy the musical stylings of the Cornish Sea:\n\n\n", "type": "video", "video": "https://youtu.be/Dk_SFnPiqA4"}
{"uri": "https://www.theinertia.com/music-art/tom-wegeners-love-for-wooden-alaias-will-make-you-a-fan-of-all-things-finless", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/04/Screen-Shot-2018-04-17-at-12.32.18-343x254.jpg", "title": "Tom Wegener's Love for Wooden Alaias Will Make You a Fan of all Things Finless", "publish_date": "2018-04-17", "author": {"name": "Dean Saffron", "url": "https://www.theinertia.com/author/dean-saffron/", "type": "Community"}, "text_content": "Salt of the Earth follows the journey of making the ancient traditional Alaia finless surfboards to cruising the perfect points of Noosa. Here, it shares Tom Wegener's story as a master shaper based in the Australian community, where he makes amazing traditional handmade wooden surfboards. He's an icon as both a shaper and an all-around character.\n\"It's like a symphony as you peel the wood off with your hand tools,\" he says. \"And there's so much to the character of every piece of wood.\"", "type": "video", "video": "https://youtu.be/GelVu80P3pI"}
{"uri": "https://www.theinertia.com/music-art/believe-it-or-not-punk-rock-bowling-is-turning-20-years-old-in-2018", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/04/punk-rock-bowling-343x254.jpg", "title": "Believe It Or Not, Punk Rock Bowling Is Turning 20 Years Old in 2018", "publish_date": "2018-04-17", "author": {"name": "Corey Jones", "url": "https://www.theinertia.com/author/corey-jones/", "type": "Community"}, "text_content": "Photo: Punk Rock Bowling / Andrew Repcik\n\n\n\n\n\n\n\nMark Stern is a punk rock luminary. After helping form Los Angeles punk band Youth Brigade in 1980, he co-founded BYO Records, which released records by a number of influential, if not genre-defining bands for over 30 years. Today, his time is consumed by his iconic music festival creation, Punk Rock Bowling, which showcases the world's finest punk rock bands and will be celebrating its 20th anniversary in Downtown Las Vegas May 25-28. I talked to Mark to get the skinny on this year's festival.\nLast year was your first year holding Punk Rock Bowling at the Downtown Las Vegas Events Center. How did the venue change go?\nEverything went great! If you had been to years prior, we had a lot of challenges because we built everything from scratch. We had a parking lot and had to bring in everything and build the whole set. The [Events Center] had been asking us for a couple years to come over there and we finally worked it out and it was great. They have the video monitors, the air-conditioned bathrooms, and it's right next to the Golden Nugget, which is our main hub. It's just central. And also, last year was the first year - I don't know if you made it to any movies last year - but there's this cool theater down the street owned by the same people who own Gold Spike. We did movie screenings there. We used to do them at a club. It was perfect last year. It holds like 150 people and has a bar, great sound, everything. We showed Iggy's movie and a couple others. This year we got The Godfathers of Hardcore and we're about to announce another next week.\nDid anything go wrong last year?\nNot really. There were a couple little hitches here and there but it's always like that, like when someone blows up my phone because there is no microphone at the Golden Nugget and the Bouncing Souls are about to play. That happened. I took an elevator down and ran into a sound guy and was like \"Hey, you got a microphone?\" He says \"Sure.\" I said, \"I'll take it over.\" It's things like that.\nWho were the first and last bands you booked this year?\nThat's a good question. Let me look at my list (laughs). My first band might have been - well, I had a bunch on hold already so it's hard to order them. I had been talking to Turbonegro for a while about having them back. And I was working on a lot of stuff right from the beginning, like L7 and The Partisans. [That booking] was six years in the making.Advertisement \nSix years? What goes on back and forth for six years?\nThey all have jobs and live in different parts of the world and they don't really play that much. I'm like \"Well, you guys can still stand and walk and play guitars. Let's make this happen.\" I'm a huge Partisans fan so I'm pretty excited about that. And they're a band we've never had. That's kind of what I was trying to do this year - go after some stuff that's never appeared. Steve Ignorant and X have never played. Suicidals have never played. We branched out a little bit. We've never had Rise Against - that's a first. And also At the Drive In. Those bands are a little different for the hardcore Punk Rock Bowling fan, but to me it all sort of fits in the same genre.\nSpeaking of branching out, when you first announced your lineup, the reaction on the internet was harsh…\nIt's crazy. If you think about it, there's a small pool of bands that we work with. It's pretty limited. I try and branch out whenever we can. Getting Iggy last year was pretty big for us. One year I brought Devo out. I had Refused one year and that did really well. But there were also a lot of people that bagged on Refused. We got tons of shit about Devo too, but it turned out to be one of the best sets we've had. For me, that was one of the first bands I saw when I was 17 years old. That band is the real deal. They're so good. I had that same issue the first time I had The English Beat play. I put them on with NOFX and got a lot of shit about it. It's funny because you'd think it's punk rock and people are more open-minded. People give you a hard time when you're just booking all the Epitaph and Fat Wreck Chords stuff - it's like \"Oh, it's the same lineup every year,\" but I know that if we try new things and get people out there they'll have a good time.\nMy daughter said to me a few years ago, \"What are you going to do when all these bands die?\" (laughs). She's 18 now. She grew up with NOFX and Pennywise and everything and turns me on to some bands that are good, and some that I don't' like. But I've put bands on the bill that I found out through her. All our opening bands and all that - they're all new. We have Crazy & the Brains playing this year and Slaves from the UK. It's all different. It's funny that no one is going to bag on that because it is different from what we do. But they do want to bag on the headliners. And the thing is, if that's what keeps you away from Punk Rock Bowling - like two headliners that you're not familiar with - then I don't get it because there's GBH, Suicidal Tendencies, Angelic Upstarts, Against Me! - these bands that have always played Punk Rock Bowling or that style. People can be harsh but I try not to read it anymore. Sometimes I take it personally because I book everything but honestly, I've known the Rise Against guys for decades. I just saw them at a 500 capacity club six months ago in LA. They were awesome. They're on the radio, but they come from this scene.Advertisement\nYour band Youth Brigade is playing on Friday with TSOL. Why not put yourself on the main stage?\nWell, we did the main stage in 2016. Before that, we hadn't played for six years. I don't really like playing it (laughs). There is too much stuff going on. But since it's our 20th year, it was kind of like \"Eh, we should play.\" I talked to Erin at Fat Wreck Chords about doing a Fat show, then thought we'd do a BYO show. So that's how our show started. We put a whole Fat show together for Saturday with Lagwagon and Dillinger Four and Good Riddance - that's a pretty stacked lineup. Then we had the BYO show which was awesome with 7 Seconds, Youth Brigade, SNFU. We announced that then SNFU had to cancel because the singer isn't doing well. So then I got ahold of this band Stretchmarks which was on BYO back in the early 80s. They're Canadian. They were in. Everything was set, then a week later the bass player had to go fix a satellite dish in Winnipeg in the middle of winter and he slipped off the ladder and broke his back in two places, so they canceled. I was like \"Oh man, this whole bill is jinxed!\"\nIn an interview a few years back, you said that PRB breaks the record for alcohol consumption in downtown Vegas. Have you seen figures?\n(Laughs.) Yeah, we've gotten figures from the hotels we're at. The casinos have talked to me about it. Before we were a festival, we were staying downtown at Binion's and they ran out of booze. Also, the Gold Coast, which was one of the first festivals - they also ran out of booze - not completely out, but pretty much anything good was out. People ended up going to the mini-mart across the street and to the gift shop. They were walking around the street with bottles of Patron and things like that. Anything they could get their hands on. Everyone was like \"Who are you people?!\" It was like \"Hey! It's Punk Rock Bowling!\"\nYeah, as I looked around last year I noticed plenty of casual tourists that probably expected a calmer weekend. I think The Golden Nugget and all the hotels should put up a casual warning like \"Attention! You're visiting on Punk Rock Bowling weekend!\"\nWhat's funny is that people that aren't part of the festival always tell me \"I thought you guys were just so weird, but then I started talking to you people and you guys are really nice.\" It's like \"Well, yeah. Everyone is really nice.\"Advertisement\nOur first year, we were at this place called Sam's Town, which is in Henderson. They have a trailer park out back. It's a nice place but it's for older people. They bus them in and that's where they go. Well, of course, they aren't our crowd and were kind of scared. But by the end of the weekend, there were old ladies dancing in the lounge to Manic Hispanic (laughs). I go to Vegas a lot for meetings during the year and will bump into pit bosses at the tables and they're like \"Punk Rock Bowling! When are you guys coming back?\" [Sam's Town] is really bummed that we left there.\nThe Denver and Jersey shows were a no-go this year. Can you speak to that?\nWe kind of just wanted to concentrate on Vegas for our 20 year anniversary. It's a lot of work doing other cities. Asbury - as much as I loved it - it's just different for us. We try to control everything and out there we don't. It got a little frustrating. It's not like we can just go in and it's our venue. We have to deal with all their rules and regulations. We don't get to control the bar or the bar prices and stuff like that. It sucks because the vibe there is great and people have a good time. Last year was one of my favorite shows because we had The Specials and Charles Bradley. We also had a bunch of east coast reunion stuff like Lifetime, The Explosion, The Pietasters. And H2O played. It was really cool.\nEditor's Note: Punk Rock Bowling is taking place at the Downtown Las Vegas Events Center May 25-28, 2018. For more information and to purchase tickets, visit www.punkrockbowling.com and follow them at @punkrockbowling.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/vissla-just-released-a-thomas-campbell-collection", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/03/thomas-campbell-343x254.jpg", "title": "Vissla Just Released a Thomas Campbell Collection", "publish_date": "2018-03-31", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "You have, of course, heard of Thomas Campbell. The man is a creative genius, and his medium often involves all things surf. You name it and Campbell does it-artist, photographer, filmmaker, sculptor, whatever, if it's pleasing to the eye, he's got his fingers in it. He's the guy who made such films as The Seedling, Sprout, and The Present, all of which are some of the best in the genre. His work's been all over world with solo exhibitions in New York, Paris, Tokyo, Denmark, The Netherlands, San Francisco, Los Angeles, and Morocco. The guy is, at heart, an artist. He's \"quiet, trend-setting, and ineffably cool,\" according to Matt Warshaw of EOS fame. And since he's often found lurking around the Vissla label, so they put together a collection showcasing a bunch of his work.\nThomas Campbell Collection from Vissla on Vimeo.", "type": "video", "video": "https://vimeo.com/262240185"}
{"uri": "https://www.theinertia.com/music-art/watch-jack-johnson-and-stephen-colberts-sleep-through-the-static-duet", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/03/jack-johnson-and-colbert-343x254.jpeg", "title": "Watch Jack Johnson and Stephen Colbert's 'Sleep Through the Static' Duet", "publish_date": "2018-03-14", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "Jack Johnson appeared on the Late Show with Stephen Colbert on Tuesday night as the show's musical guest. And in a whimsical turn of events, Colbert turned Johnson's \"Sleep Through the Static\" into a live duet.\n\"Our host sits in with one of his favorite artists for the first-ever network television performance of this Jack Johnson classic,\" reads the video description on the Late Show's Youtube channel.\nAs it happens, Colbert's no stranger to singing with his musical guests. During his tenure at The Colbert Report, he once performed with Ben Folds. Point being, Colbert's got pipes.", "type": "video", "video": "https://youtu.be/QfUHjdmiQxY"}
{"uri": "https://www.theinertia.com/music-art/5-must-see-films-from-the-santa-barbara-international-film-festival-for-ocean-lovers", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/03/the-dude-343x254.jpg", "title": "5 Must-See Films from the Santa Barbara International Film Festival for Ocean Lovers", "publish_date": "2018-03-01", "author": {"name": "Branden Aaroyan", "url": "https://www.theinertia.com/author/branden-aaroyan/", "type": "Community"}, "text_content": "The show must go on. That was the philosophy of festival organizers and locals heading into this year's Santa Barbara International Film Festival. It came on the heels of a rough month with two evacuations. First, for the largest fires in California's history and the second for the debris flow of mud shutting down the 101 freeway. Everyone was in the mood for something uplifting, reminding us of the passion that makes life burn brightly. And so right on schedule, the Santa Barbara International Film Festival of 2018 turned on the projectors and became a beacon of positive light. For ten days, the town filled in again with A-list actors, world-class directors, writers, producers, and film fans of all ages. Compassion seemed to be a consistent theme throughout the films on display, reminding us that in these trying times of political turmoil and global warming, the only thing that will save us is us.\nJeff Bridges produced, narrated and appeared in the film Living in the Future's Past with outstanding nature cinematography from around the world, showing us how we make a choice every day as we live in our future's past. The film focused on global warming and the quickly approaching environmental breaking point.\nThere was a wide spectrum of international films premiered in Santa Barbara while many films on display had already earned top honors, audience choice awards, and breakthrough performances in other film festivals. Just about every film was great but there wasn't enough time to see them all.Advertisement \nOne unique aspect of this festival is its appreciation for youth. 10-10-10 is a five-month mentorship program for high school students in a friendly competition for best student script, all while getting real-life experience next to seasoned professionals. And of course, Mike's Field Trip to the Movies opens up the Arlington theater for free to 4,000 fifth and sixth-grade students to experience the thrill of seeing it all on the big screen with a director's Q&A after. The entire festival is well supported by wonderful, amazing, and generous supporters, adding up to over $4.47 million.\nHere are a few other noteworthy films from the 2018 Santa Barbara International Film Festival: \nChasing the Thunder\nAdvertisement\nSea Shepard Conservation Society successfully takes down one of six major illegal fishing vessels fueling a multi-billion dollar industry while wiping out our ocean's resources.\nDirtbag: The Legend of Fred Beckey\n\nAn intimate and thorough look into the life of one of the most eccentric climbers in the world and the major effects he had on the sport, lifestyle, and industry.\nLeaning into the Wind: Andy Goldsworthy\nA journey alongside an artist of incomparable measures who sees, creates, and invites us to view nature in a new way and with a deeper understanding.\nBeyond-An African Surf Documentary\nAdvertisement\nThese filmmakers returned to SBIFF again this year with their second surf travel story. This one focuses on West Africa and the stories of unlikely local coast dwellers who share the love of surfing.\nBlue\n\nAn incredibly inspiring film aiming to help save the ocean and in turn save us. \"The ocean is the mother of all life on this planet. By 2050 there will be more plastic in the ocean than fish.\"\nThis year's winners chosen by the SBIFF jury:\nAudience Choice Award: Mark Hayes' SKID ROW MARATHON\nShort Film Award: Kyle Morrison's MOTT HAVENAdvertisement\nBest Live Action Short: Richard Vans AUDITION\nBest Animated Short: Randall Christophers THE DRIVER IS RED\nBest Documentary: Grant Korgan and Geoff Callan THE PUSH\nBest International Feature: Gjorce Stravreski SECRET INGREDIENT\nIndependent Cinema: Molly McGlynn MARY GOES ROUND!\nSpain/Latin America award: Pablo Solarz THE LAST SUITAdvertisement\nSpecial Mention: GET THE WEED\nBest Nordic Film: Antti-Jussi Annila THE ETERNAL ROAD\nStand up Award: SKY AND GROUND\nSocial Justice for Documentary Film: Ludovic Bonleux GUERRERO", "type": "video", "video": "https://vimeo.com/243404072"}
{"uri": "https://www.theinertia.com/music-art/capturing-surfing-with-the-nearly-extinct-infrared-film", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/02/259856_062-343x254.jpg", "title": "Capturing Surfing With the Nearly Extinct Infrared Film", "publish_date": "2018-02-27", "author": {"name": "Ryan Struck", "url": "https://www.theinertia.com/author/ryan-struck/", "type": "Community"}, "text_content": "Infrared film has been around for quite some time. I'm certainly not the first person to use it, nor will I be the last. What makes this stuff so special is that it is no longer made, so coming across it is like finding a unicorn. I first got my hands on some in 2012 and since then have bought a few rolls when my funds allowed. Eventually, I just sunk a good bit of my savings into stocking my freezer.\nI've loaded the film into my 120mm Bronica around the globe. I've shot on a strike mission in Panama, brought it along hikes in Denali National Park in Alaska. I've even seen the beautiful waters of Tahiti turn jet black through the altered lens of this camera and film combo. When I first started shooting 120mm infrared film, it was about mimicking an effect - the earth turns pink! But eventually, it grew into what I wanted to see. \"Would this scene or person look interesting here? Was this worthy of permanently recording?\"\nSo many times I found a place or an idea within the place. I would pull the dark slide, frame up, check focus, and I would raise my eyes from the waist level viewfinder just to watch. I would look and go back to the viewfinder. Check focus again. My finger ready to record. Sometimes I wouldn't even press the shutter. Not from indecision or lack of wanting, but realizing what I was looking at wouldn't translate. It wouldn't say what I wanted. It was in this space that I could truly meditate on photography.\nEditor's Note: You can find more from photographer Ryan Struck on Instagram here or online here..", "type": "photos", "photo": "https://cdn1.theinertia.com/wp-content/gallery/ryan-struck-feb-27/3_panama.jpg", "caption": "Photo: Ryan Struck"}
{"uri": "https://www.theinertia.com/music-art/the-art-of-a-paskowitz-the-last-son-of-doc-shares-his-incredible-work", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/02/josh-feat-343x254.jpg", "title": "The Art of a Paskowitz: The Last Son of Doc Shares His Incredible Work", "publish_date": "2018-02-16", "author": {"name": "Joshua Paskowitz", "url": "https://www.theinertia.com/author/joshua-paskowitz/", "type": "Community"}, "text_content": "I like friends. My name is Joshua Ben Paskowitz. I am a surfer and a painter. I am the last son of Doc Dorian Paskowitz, surfer and doctor. My dad loved surfing. He raised us off the grid and in connection with the global surf community instead of schools or anything like that. We said homeschool\", but that was a joke because there was no school nor any home. My room, when I was my sonDorian'ss age (9) was the rear window ledge of a 1976 Chevy Impala, behind the rear passengers' heads. Like where they stick the baby on board thing? That was my spot. I believe I coined the phrase \"hellhole\" to describe the arctic chill of the frozen glass at night and the ant-under-a-magnifying-glass heat in the daytime. I taught myself how to read and write, but my father made sure we understood the Aloha style. He made it very clear these values were absolute. He didn't take any money for being a doctor and he helped a lot of people. I saw him bring people back to life and shit. I never saw him doubt his own commitment, and in retrospect, it was pretty remarkable.\nSurf Family\nJoshua, Dorian, and Amoret Paskowitz.\nWe were a part of a surf family that shared the love of the ocean and the passion born from a total commitment to it. My father believed in the purity of that natural order; he valued that part of life more than anything. I never forget to honor him every day since he passed away. I'm grateful for his example and I try to capture that in my work. I've done a lot of different stuff, kind of a catch all of the family. I have been drawing my whole life. Started a band at an early age. I was in \"Jesus Chrysler\", and my brother was in \"Johnny Monster\". I helped my brother at Black Flys in the '90s and got to hang out with Sublime, which was cool. I was in the Band \"The Flys\" when my brother figured out a way to market his band. We ended up living the dream and even opened up for the Rolling Stones, just like Spicoli dreamed. Shit, Sean Penn loved Doc. He wanted to play Doc. He had us over for hours at his pad and told us that surf was a huge deal to him. His prize possession was a green Gerry shaped bolt. Go figure. Anyway…my other brother is the name dropper, not me.\nStones like SpicolliAdvertisement \nJoshua and Kelly Slater at an event for Surfing 4 Peace, a person-to-person and cross-border cooperation initiative that aims to bridge cultural and political barriers between surfers in diverse communities in the Middle East and around the world.\nNow, I'm all about expressing my narratives through art. Acrylics on canvas and fiberglass. It's a tribute to the surf history my family was a part of; those great characters and the culture that shaped the course of my life.\nI spent my early years devoted to drawing with pen and ink and obsessed with comics, anime and heavy metal magazine. Later on, I picked up a brush and really committed to painting and the development of a style that I hope still has a remnant of the great stuff that inspired me as a kid. I really had to find my own way and it forced me to have my own voice. A lot like my dad-he could have been a regular doctor, but there wouldn't be a Paskowitz family as we know it if he had. Because Doc raised me outside of convention, I don't have the same desire to buck the system. I'm more interested in building community than running off to my own utopia. I'm more interested in developing some of the concepts that he pioneered.\nFrom surfing to vanlife to mindfulness to healthcare and even family values, Doc was not a perfect person. He was, however, a tremendous outlier and a brilliant soul. I was his prototype and he meant a lot to me. When I lost my dad, I went into a deep depression. I felt like I was struggling to find my purpose. Luckily, my friends helped me get through it. Especially my friend Greg.Advertisement\nYes, My Friends\nGreg Escalante and Joshua.\nArt and surf is an amazing intersection of culture and no one knew it better than my friend Greg Escalante. Greg was one of the original founders of Juxtapoz Magazine and, along with Robert Williams, one of the progenitors of the lowbrow or pop surreal art movement. It's really all about commercially viable and entertaining art that emerges from organic niches instead of traditional art world shit. Like surf art/skate art/tattoo/hot rod art underground comix and really any outsider DIY bollocks that has a gang of proponents. Like street art or glass art. Fuckin $250,000 bongs and shit.\nGreg famously championed some absolute legends in the game-guys I look up to-so when Greg called me at 5 am every morning to get me out in the water I would say yeah, even if I didn't want to go. I knew of Greg Escalante by his reputation for quite some time. I met Greg in 2013, but we really started spending a lot of time together in 2014. Greg tirelessly encouraged me.\nWe became very close through our mutual love of art and surfing. He was able to broaden my conception of what I could do and my potential as an artist. He was always including me and constantly thinking of how he could connect people and magnify inspiration. We lost Greg this past September and I'll never forget to include him in my prayers every day along with my dad. He said one thing to me I'll always cherish in my memory: \"You're a Success waiting to Happen!\"\nGreg was such a incredible support and fostered so many talented artists. His word gave me the strength to believe in myself. The scope of his vision was immense, yet he was sensitive enough to care about all the little details. I am forever grateful to be on his radar. No more waiting, my friend.\nAnd… SceneAdvertisement\nThe Doc, happiest in his locker.\nWell, thanks for letting me share my little story about my journey through surfing to art. It's a work in progress. I really appreciate all the other amazing artists that I see elevating the category. The ocean will always be a very primal focus in art and every other aspect of life on earth. It's a thing like family.\nI just loved my family. I adored my mom and dad and all their nutty wonderfulness. Yes, it was hardcore, but it's very cool that we did come so far and were lucky enough to share our time with some absolutely beautiful friends that became family. I'm grateful I was given the cards I have been given. Art is surf and surf is art. No one can truly describe what it's like to go to San Clemente Island with Flippy Hoffman or sit with Doc and Pat Curren and talk story by a single candle or to have Miki Dora in the camper with us, but thank God I know and I hope I can get some of that magic in my work.\nKeep surfing with Aloha,\nJoshua Ben Paskowitz\nSee more from Joshua on Alohadoc.com and Joshuapaskowitz.com. Follow him on Instagram@Joshuapaskowitz\n\n", "type": "photos", "photo": "https://cdn3.theinertia.com/wp-content/gallery/joshua-p/stylemaster.jpg", "caption": "Style Master. Art: <a href=\\\"https://www.instagram.com/joshuapaskowitz/\\\">Joshua Paskowitz</a>"}
{"uri": "https://www.theinertia.com/music-art/why-mean-jeans-sold-out-to-make-a-pop-punk-album-full-of-jingles", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/02/Mean_Jeans_Patrick_Houdek_450-343x254.jpg", "title": "Why Mean Jeans 'Sold Out' to Make a Pop Punk Album Full of Jingles", "publish_date": "2018-02-15", "author": {"name": "Corey Jones", "url": "https://www.theinertia.com/author/corey-jones/", "type": "Community"}, "text_content": "Mean Jeans\n\n\n\n\n\n\n\nThe most punk rock thing you can do in 2018 is sell out. At least that's what Portland punk band Mean Jeans thinks. Since forming over a decade ago, Mean Jeans has cemented a jocular sound in a similar vein as bands like Riverdales, The Queers, and other pop-punk stalwarts. On JINGLES COLLECTION, their brand new album on Fat Wreck Chords, Mean Jeans puts the comical jingle treatment on 23 brands ranging from Wendy's to Hot Pockets. I talked to guitarist, Billy Jeans about the new record, his favorite Ramones songs, and the band he'd most like to see cover his own tunes.\nThere are 23 brands covered on this album. I've seen the public responses from Coors and Mountain Dew, but how many of the other companies know what you're doing? What has been their response?\nThe project began fairly organically. The idea was to create a Mountain Dew jingle for fun. We decided to post it on the internet and encourage our followers to hit up Mountain Dew as a joke, but also as a fun experiment to see if we could get Mountain Dew to respond. Our followers' responses were great. We were loving that and we wound up three days later being contacted by a marketing director who sent us forty cases of Mountain Dew and some t-shirts. To be completely honest, as soon as you have forty cases of Mountain Dew it becomes a burden because what the hell are you going to do with forty cases of Mountain Dew? We still have them. Even just deciding who has to hold onto the forty cases caused a rift between us. But regardless, the experiment was kind of successful. We were all totally satisfied with the results so I polled our followers and asked them what other brands they'd be interested in hearing a jingle about and we landed on Coors Light. So anyway, we kept going with this cycle. To be honest, we were just having so much fun writing jingles so we decided to make a bunch of them. The songs that we've \"released\" so far were sort of the beginning of the project. The rest of what's on the album I guess you could call the \"unreleased\" songs.\nHow did Rain-X Wiper Blades and Kinkos end up as song subjects?Advertisement \nWell, it's been brought to our attention since posting our tracklist that Kinkos no longer exists, and that Camel Light doesn't exist either. We grew up making punk flyers at Kinkos. Rain-X Wiper Blades…well, we've got terrible wiper blades on our van and apparently, those are top-of-the-line so we had to show some love.\nYou recently posted a photo of a fan with a Kraft Mac and Cheese tattoo inspired by your jingle. Is that for real? How does that make you feel?\nWell, I would have had to be at the tattoo shop to verify if it was a Mean Jeans fan getting that tattoo, so I can't confirm it. But I would say that the more fun parts of being in a band are when people send you really stupid tattoos of your band. Surely there are thousands of bands whose fans have gotten more tattoos than those of Mean Jeans. We're not that big. But the people who really do like Mean Jeans are…Advertisement\nDevoted?\nNo, I was going to say out of their minds (laughs). I've seen some silly ass tattoos over the years and I love that shit! Keep 'em coming.\nA lot of time passes between when an album is recorded and when it gets released. Do you get sick of hearing the songs by the time the album sees the light of day?\nAlways. The Jingles record came together remarkably fast. I'll give Fat Wreck Chords credit for that. What I'll say is this: Until five years ago or so, vinyl production all but died outside the punk community. There are so few vinyl facilities left that once someone like Taylor Swift releases her album on vinyl, she puts her order in, and if I own a record pressing plant, of course I'm going to say yes to that order. The plant truly has to make the records one by one. It's this ridiculous, archaic process - which I'm a fan of as a record collector - but it pushes back the release schedule. As an artist, you've been waiting for your record to come out to see how people react, which can influence what you do next. Under the current timeline, you'll be putting out a record once every three years. I remember reading something - maybe it was Michael Jackson's Thriller or Bad - where the recording dates and the release dates were like two weeks apart. It was insane. That was such a more natural cycle on the artist side. Write a song, cut it, put it out. Now it's write an album, record it, then write another album before anyone hears the first one.\nYou're often compared to the Ramones. What is the best Ramones cover song you have ever heard?\nI've done a bunch of interviews about the Jingles collection and I would say the primary question asked to me is why the fuck did you make a Jingles album? That's a valid question. I can answer it in a number of ways. One element is - for someone like myself who has had a lifelong obsession with the Ramones - you go through phases of what the best Ramones record is, or what era you're into. Casual Ramones fans like the first three or four records and those are all great. But then everything changes. The production changes. I'll find myself convinced that some pretty bad albums like Brain Drain, Animal Boy, Acid Eaters - some late Ramones stuff that I originally thought was questionable - I'll start to think those are the best albums they did. But then, if you really dig deep, you'll find their 1995 Steel Reserve malt liquor jingles. They did three of them, which makes even less sense. My journey of Ramones appreciation has landed me on believing wholeheartedly that their 1995 Steel Reserve jingles are the peak of their catalog. That has been an inspiration for where Mean Jeans is at right now with the Jingles collection.Advertisement\nIf a band were to cover a Mean Jeans song, what band would you most like to see do it?\nThat's a tough question. You just mentioned Rancid. All of us grew up on Rancid, particularly Let's Go and …And Out Come the Wolves. We listen to Wolves on the road all the time. There are so many songs on that album and they're pretty much all the same chord progression so it's kind of inexplicable how they're all so good. If I could see Rancid from the Wolves era cover any Mean Jeans song, my life would be complete.\nThis doesn't get talked about a lot but I see you guys have covered two Nirvana songs for tribute albums in the past?\nAll of us are definitely Nirvana fans. I assume pretty much everyone who likes rock music is. In both of those cases, it was a friend of ours who runs Robotic Empire Records who was putting together Nirvana tribute albums for Bleach and Nevermind. A lot of the contributing bands were actually people that we grew up with in northern Virginia. As background, all of us are actually from Arlington, Virginia. Our drummer and I started the band there and played one show and were kind of like \"We need to get out of here if we're going to do this band thing.\" We've been in Portland the last ten years, so technically the band is from Portland, even though I now live in LA. I just moved here.\nWhy the move from Portland to LA?\nWell, I was kind of bored of Portland. The winters are very dark and rainy and cold. I had an opportunity to sublet a place in [the Silver Lake neighborhood of LA] last year for a few months. I took that opportunity and it was totally awesome. It turns out that bouncing back and forth between Portland and LA is pretty easy. It doesn't cost that much. I live in a house in LA that doesn't cost that much and I was living in a house in Portland with some people that cost too much. I was just looking for some adventure.Advertisement\nIn many ways, I feel that there is an exodus of people going from LA to Portland given how crazy expensive it's become to live in LA. People are flocking…\nDefinitely. I still have a lot of love for Portland but when we moved there eleven years ago there were no real goals. It was like \"Let's do this rock and roll band.\" We didn't know anybody. It was kind of the perfect place for our needs at the time. It was a good community, a lot of low brow punk bands, and everything was cheap as fuck. We sort of lived in what would now be considered the \"desirable neighborhoods.\" It didn't even occur to me that we were getting a great deal. As all things change, it's really grown a lot and become developed. I'm not grumpy that it's not the way it was, but it's more that ten years ago it was perfect for me.\n \nDo you guys surf now that you're in California?\nNo, but I'm new to LA so someone give me a surfboard. I'm ready to go! My buddy was surfing yesterday and said he saw a six-foot shark jump out of the water. So, the shark's out…just saying.\nFor tour dates, visit here.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/listen-to-jack-johnsons-interview-about-activism-songwriting-and-donald-trump", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/02/jack-johnson-343x254.jpg", "title": "Listen to Jack Johnson's Interview About Activism, Songwriting, and Donald Trump", "publish_date": "2018-02-11", "author": {"name": "Alexander Haro", "url": "https://www.theinertia.com/author/alexander-haro/", "type": "Staff"}, "text_content": "Did you know that Jack Johnson made the finals of the Pipe Masters Trials in 1992? It's true, he did! Did you also know that he's still better at surfing than 99.9 percent of the surfing population? It's true, he is! But wait, there's more. That honey-voiced string-plucker who is the background music for every campfire on earth also has a list of demands for the venues that host his concerts.  Carbon offsets! Energy efficient light bulbs! A recycling policy to die for! Bicycle valets!\nJack got on the phone with Kyle Meredith to talk about his latest album, All The Light Above It Too.  Since no one can escape the political turmoil we find ourselves embroiled in every single day, Johnson and Meredith got to talking about the current administration. Johnson, who's been an environmental activist for a long time had a lot to say about everything from climate change to plastic pollution. Political commentary isn't anything new for him, either, but now it's just a little more obvious because… well, because nearly everything seems political now.\n\"There's always been political commentary on the records,\" he said. All the different records have had political or social commentary, but this time around it was interesting because it was one of the catchier songs. With the administration taking office there was a lot of attention on the fact that I had this song that was referencing \"I don't care for your paranoid us-against-them fearful kind of walls.\"Advertisement \nSee more from Jack Johnson on Jackjohnsonmusic.co", "type": "video", "video": "https://youtu.be/HH8QkcMpae0"}
{"uri": "https://www.theinertia.com/music-art/inside-the-mind-of-andy-davis-and-his-iconic-surf-inspired-art", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/02/andydavis_gotit_1000-343x254.jpg", "title": "Inside the Mind of Andy Davis and His Iconic Surf-Inspired Art", "publish_date": "2018-02-09", "author": {"name": "Shelby Stanger", "url": "https://www.theinertia.com/author/shelby-stanger/", "type": "Community"}, "text_content": "Photo: Andy Davis //AndyDavisDesigns\n\n\n\n\n\n\n\n\nAndy Davis is quite possibly my favorite artist ever and the man behind some of today's most recognizable surf-inspired artwork. He has been called one of the best surf artists of our generation. Using bright colors and organic, curvy shapes, Andy's artwork gives you the feeling of being near the water and exudes a pure, simple joy and aloha spirit. You've seen his work in films by Thomas Campbell, from brands like Billabong, Roxy, and his own brand Free, on huge murals, in big stores. Now he's even landing on the panels of Igloo coolers.\nHere, Andy talks about how he forged his own path, passing on traditional education for real work experience, surrounding himself with friends, and continuing to create what he wanted along the way. He has a great sense of humor and a bold outlook on life.\nNote: You can find more episodes of Wild Ideas Worth Living here. And you can find more from Andy Davis on Instagram here.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/these-illustrations-are-borne-of-a-longtime-surfer-being-landlocked-in-milan", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/02/Pizza-Surfing-copy-343x254.jpg", "title": "These Illustrations Are Borne of a Longtime Surfer Being Landlocked in Milan", "publish_date": "2018-02-09", "author": {"name": "Julio Giannoni", "url": "https://www.theinertia.com/author/julio-giannoni/", "type": "Community"}, "text_content": "Living far from the sea is not an easy thing for me. I'm an outdoor person, used to go surfing several times a week, and now it's a little bit different.\nI live in Milan now. I left my country, Venezuela, almost 5 years ago and I have to say it has been a positive decision to move to a European Metropolis in order to develop my knowledge and practice art and design. On the other hand, I really miss going surfing several times a week.\nSo last November me and some good friends who live in Spain organized this super spontaneous surf trip to Zarauz, Basque Country.\nI had such a nice time and remained so stoked after all those days of surfing, that when I went back to Milan, I decided that somehow I had to use my talent to create something nice, understandable, and fun about how I experience surfing, and that's when The Moustache Guy was born. Hope you enjoy it!", "type": "photos", "photo": "https://cdn3.theinertia.com/wp-content/gallery/moustache-guy/pizza-surfing.jpg", "caption": "Original Artwork by Julio Giannoni"}
{"uri": "https://www.theinertia.com/music-art/sessions/company-of-thieves-rocks-the-inertia-sessions", "category": "Sessions", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/02/companyofthieveslivetheinertia1200-343x254.jpg", "title": "Company of Thieves Rocks The Inertia Sessions", "publish_date": "2018-02-06", "author": {"name": "Zach Weisberg", "url": "https://www.theinertia.com/author/zach-weisberg/", "type": "Staff"}, "text_content": "Genevieve Schatz, with fiery orange hair and fiery orange pants, accompanied by bandmates Marc Walloch and Chris Faller, recently dropped by our Venice HQ and treated the staff to a super soulful performance as part of the latest installment of The Inertia Sessions. Their band, Company of Thieves, which formed in Chicago more than a decade ago, recently reunited and is in the midst of a tour with Walk the Moon. \n\"We don't have a scene, we're not trying to be anyone or anything, we weren't those kids who were in cliques at school,\" singer Genevieve Schatz writes on the band's Facebook page. \"We were everyone's friends. We were curious and lonely and desperately trying to see the world beyond the manicured lawns and paved parking lots of Wal-Marts in the suburbs of Chicago.\" \nI can attest that they are very friendly people. And as current Los Angeles residents, Chicago's suburbs are firmly in the rearview.Advertisement \nAs newly independent artists with a new EP on the horizon they just released a new song called, \"Treasure,\" which they performed live at the office. It's available for free download on their website. They're playing in Los Angeles this week, so if you're local and don't have plans, go to their website right now and buy tickets for their show at the Palladium on Friday, February 9th. It will be fun, and your friends will think that you're interesting for suggesting that that you see them. \nCheck out their full tour dates here, and sit back and enjoy this live performance. Makes me want to get some orange pants! And makes me really excited to continue The Inertia Sessions, where super talented artists passing through Los Angeles drop by the HQ to record a stripped-down set. In case you missed G. Love, check his out here. We did that one in Byron Bay. Byron Bay is good.\nGigantic thanks to Company of Thieves for sharing their talents with us. Learn more about them here.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/why-an-nyc-indie-artists-newest-single-is-named-after-surfings-enigmatic-anti-hero-miki-dora", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2018/01/ac43a965-03a4-4d60-91d5-77fecc527187-343x254.jpeg", "title": "Why an NYC Indie Artist's Newest Single Is Named After Surfing's Enigmatic Anti-Hero Miki Dora", "publish_date": "2018-01-18", "author": {"name": "Dylan Heyden", "url": "https://www.theinertia.com/author/dylan-heyden/", "type": "Staff"}, "text_content": "Miklos Sandor Dora is quite possibly the least understood cultural symbol to emerge from surfing during what Matt Warshaw calls the \"boom years.\" The Encyclopedia of Surfing describes him thus: \"Irresistible American surf rogue, originally from Hollywood, California; the light-footed master of Malibu during the 1950s and '60s, and surfing's definitive outlaw figure.\"\nIn an article for LA Weekly, Jamie Brisick explained, \"If you took James Dean's cool, Muhammad Ali's poetics, Harry Houdini's slipperiness, James Bond's jet-setting, George Carlin's irony and Kwai Chang Caine's Zen, and rolled them into one man with a longboard under his arm, you'd come up with something like Miki Dora, surfing's mythical antihero, otherwise known as the Black Knight of Malibu.\"\nMiki was a living breathing contradiction - he was simultaneously part of the same surf community he derided. His antics from mooning the judges at the 1967 Malibu Invitational to spreading false rumors about his own sexuality for kicks are the stuff of surf legend. And over 15 years since his death, he continues to be a person of interest far beyond the sphere of surf, as evidenced by NYC indie artist Amen Dunes' recently released single, 'Miki Dora.' We caught up with the man behind Amen Dunes, Damon McMahon to get some context behind the track:Advertisement \nThe first single off your new album Freedom is called 'Miki Dora' who was an enigmatic, living breathing dichotomy. What was your introduction to Dora as a person, and what about his story inspired you to write a song titled after him?\nI've always been intrigued by surfing from afar, always wanted to do it but never did.\nMiki Dora just seemed, first off, like a kindred spirit stylistically. He approached surfing like I approach music: subtly, tastefully, and with some nastiness to balance it out.\nAs for his story, he embodied something I was conveying with this record, though I didn't know it at the time.\nMiki Dora, like all my songs, just came to me. I was sitting at my desk, was hit with a moment, and then looked him up online, ingested his vibe, and wrote the song. It all happened in about an hour.\nWhat came out ended up connecting with the eventual theme of Freedom, which is an album essentially about a relinquishing of self through exploration of its various forms, the multiple identities we (I) cling to: from my childhood self, to my heritage, to my parents, to male icons (like Miki) I always looked up to. He embodied one of those identities: the dark side of ego and masculinity, pride and a fall from grace, but also a hero's beauty, power, and liberation.Advertisement\nAmen Dunes is the brainchild of Damon McMahon. Photo: Michael Schmelling\nOne of the interesting things about Miki Dora is his celebrity transcended and continues to transcend the boundaries of surf culture to which he simultaneously belonged and thumbed his nose at. What do you hope to express with a song that in a way re-introduces him and his story to fans of your work that may not necessarily be familiar with Miki Dora?\nWell, to be honest I had no intention except that he embodied something within me, and within our culture, that I thought was relevant. And even preceding all that, he kind of just came to me.\nYour new album, Freedom, incorporates a number of characters. In some senses, Miki Dora is one of the more obscure ones. What made you want to release this track as the first single from the album?\nThat's a good point, he's one of the more obscure ones. We all just thought musically it would be the right first move, but maybe subconsciously there is something universal about Miki that made it seem like a good first \"character\" if you will to put forward.\n\nWho was Miki Dora as you understand him and how do you feel that his life resonates with you? How do you hope it'll resonate with others?\nWell, I can relate to him on a number of levels. Superficially, I also had my run-ins with bad behavior and getting in trouble with various things. Then as I mentioned, I relate to his internal divide, the pull of his pride and bravado, and how that is a detriment in life. I also relate very strongly to the way he approached his art, and how he felt in his scene. But honestly, that sense of being an outsider I'm trying to let go of. Life's too short. Maybe that's why the song has strong feelings of regret and reflection on a life lived that way. I hope people can see that side of it too. It's neither a pure critique or a pure celebration.", "type": "video", "video": "https://youtu.be/RONXqXaF8oI"}
{"uri": "https://www.theinertia.com/music-art/g-love-kicks-off-the-inertia-sessions-in-byron-bay", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/12/glove1200byron-343x254.jpg", "title": "G. Love Kicks off The Inertia Sessions in Byron Bay", "publish_date": "2017-12-20", "author": {"name": "Zach Weisberg", "url": "https://www.theinertia.com/author/zach-weisberg/", "type": "Staff"}, "text_content": "A few years ago Garrett Dutton aka G. Love graciously dropped by The Inertia HQ in Venice to play a secret acoustic show on our rooftop. We were celebrating the relaunch of the website as well as the launch of his new album at the time, Sugar. As a fan of G. Love and Special Sauce's \"Cold Beverages, Cereal and Milk, Baby's Got Sauce\" and more, I was pretty pumped that Philly's resident bluesman (and surfer) was ushering in a new era for The Inertia\nThree years later, while in Byron Bay for the Byron Surf Festival, we reconnected. He brought his trademark vibes and guitar to the festival, and we managed to sneak away for an acoustic performance on the sand followed by a quick surf at The Pass. In doing so, G. Love proudly kicked off another new era for us.\nWelcome to The Inertia Sessions, where we host quick acoustic sets from talented established and up and coming artists in our orbit.Advertisement \nAnd if you're looking for a stocking stuffer, G. Love just dropped a brand new Christmas album, Coming Home for Christmas. Check it out on Spotify here and iTunes here.\nVideo shot by Gabe Reuben and edited by Alex Smolowe.\n\n", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/this-artist-uses-plastic-found-on-the-beach-to-create-amazing-work", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/12/Screen-Shot-2017-12-13-at-12.21.09-343x254.jpg", "title": "This Artist Uses Plastic Found on the Beach to Create Amazing Work", "publish_date": "2017-12-11", "author": {"name": "Gustavo Lermen Silva", "url": "https://www.theinertia.com/author/gustavo-lermen-silva/", "type": "Community"}, "text_content": "The work of artist Xicogaivota is amazing. Xico is a beach plastic collector, removing plastics and other materials from remote beaches and turns them into works of art. The marine debris is no longer waste, now repurposed as raw material for his creations.\nIn a dystopian society built on uncontrolled consumption and inconsequential discard, it is a praiseworthy attitude. What started out as a way to make rather than buy Christmas gifts for loved ones is now his trademark work. Xico's work has the power to create awareness about our plastic waste dilemma and contribute to a more sustainable way of life.\n Advertisement \n\"My work is not only what you see, it is essentially what you do not see,\" Xico says.", "type": "video", "video": "https://vimeo.com/246620034"}
{"uri": "https://www.theinertia.com/music-art/how-the-australian-band-empat-lima-got-their-start-with-indonesian-garage-pop-covers", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/11/Screen-Shot-2017-11-19-at-17.50.18-343x254.jpg", "title": "How the Australian Band Empat Lima Got Their Start With Indonesian Garage Pop Covers", "publish_date": "2017-11-20", "author": {"name": "Nathan Rivalland", "url": "https://www.theinertia.com/author/nathan-rivalland/", "type": "Community"}, "text_content": "Photo: Theresa Harrison\n\n\n\n\n\n\n\nRecently, I had a great chat with the up and coming Australian girl group, Empat Lima, about their style that's inspired by the garage sounds of the 60's Asian/Western Pop explosion. Their upbeat sound is something I expect to see skyrocket as they look for a record label to release their music.\nMy infatuation with them actually started not too long ago, when I watched them at The Curtin Bandroom in Carlton with the Frowning Clouds and Parsnip. I'd made a quick stop at the record shop before the gig and some blokes were talking about great this group Empat Lima was. Sure enough, I saw the show and they didn't disappoint. I fell in love with the sweet sounds of Bowie on the Beach, which is a great song.\nHere are some highlights from my chat with Carla, Sooji and Steph.\nSo, where did you get such an amazing name? Is it Spanish?Advertisement \nEmpat Lima is actually Indonesian. We started out inspired by a group called Dara Puspita, who played garage rock in the 60's, and we were all a bit smitten with the country and the sounds from around the Southeast Asia. Empat Lima means 45.\nHow long have you been playing together and where did you meet?\nBeen playing for about five years now. Sooji heard Steph sing and fell in love. They had a little party together and decided to start a band playing Indonesian garage pop song covers. They also decided that it should be an all girl group so we were thinking of drummers that would suit. I'd just got back from living in Indonesia and was hanging out the front of the milk bar in Brunswick. Steph hollered at me. I agreed to have a jam. Sooji and I met in the jam room and the rest is history.Advertisement\nWhat is the inspiration for your music?\nNature, mythology, South Asia, dreaming, life, death, and love.\nSo you've released a bit of music on the web. Can we expect a new album soon?\nActually, yes. We have recorded an album and are in the process of looking for a label to release it.\nWhere did you get such an amazing range with your voice? It's absolutely mindblowing.\nSteph: I love listening to lots of different styles of vocals. It's my natural instrument. I've learned a lot about singing while taking long walks in the bush and driving in traffic, riffing off the radio, belting out phrases. It's the main reason I drive these days, singing sessions in my studio. Good acoustics and captive audiences at the lights.Advertisement\nFavorite 80s jam?\nSteph: Grandmaster Flash, The Message, was released on my birthday.\nCarla: I Can't Wait, Nu Shooz\nWhat's been the best part of forming a band?\nCarla: having a gang of people that you get to see each week\nSooji: Collaborating on whatever kind of project you can think up.Advertisement\nIf I gave you $5 dollars right now, what would be the first thing you would buy? \nSooji: Nothing, I'm saving up for a new bass guitar.\nSteph: Usually if people give me $5 they want a coffee or a drink or an Empat Lima EP. But I'll probably use it to buy some spanokopita and salad for lunch tomorrow.\nCarla: A golden gay time.\nAny advice for any up and coming musicians wanting to get their music out there?\nCarla: Be true to your own style and keep working at itAdvertisement\nSooji: Just get it out! Anywhere!\nSteph: Practice lots. Play lots. People want to hear music. Play with other people. People have the power. Music is the future.\nNote: You can find more from Empat Lima online here and on Facebook here.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/how-the-white-buffalo-kickstarted-his-music-career-in-a-chris-malloy-film", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/11/WB1-343x254.jpg", "title": "How The White Buffalo Kickstarted His Music Career In a Chris Malloy Film", "publish_date": "2017-11-17", "author": {"name": "Corey Jones", "url": "https://www.theinertia.com/author/corey-jones/", "type": "Community"}, "text_content": "Jake Smith, also known as the White Buffalo, got his career started when his music was featured in the surf movie Shelter in 2006\n\n\n\n\n\n\n\nFor more than 15 years, singer-songwriter Jake Smith, known by the stage name The White Buffalo, has taken a workingman's approach to building his prolific brand of dark roots rock/country-folk/blues. An avid surfer, his career was catapulted by the success of his song \"Wrong\" in the Chris Malloy surf film, Shelter, in 2006. Since then, he has released seven studio albums (including this year's \"Darkest Darks, Lightest Lights\") and seen his music featured in numerous outlets including the shows Sons of Anarchy, Californication, and others.\nIn three words, describe your new record \"Darkest Darks, Lightest Lights.\"\nDark, light and in between.\nThe song that initially grabbed my attention was \"Nightstalker Blues.\" But I'd like you to tell me if a person picked up this record for the first time and could only listen to three songs, which best capture what you want to convey on the album?Advertisement \nIf I had to pick three songs I would hit \"The Observatory\" or \"If I Lost My Eyes\" for something that's a little more somber and introspective. On the dark side, I would go either \"Nightstalker Blues,\" which is pretty gnarly, or \"Border Town / Bury Me In Baja.\" And for something that kind of feels good, maybe \"Heart and Soul of the Night.\"\nYou recorded the album in LA. How did the recording process for this one compare to prior ones?\nThis one was a little different because I didn't have a whole lot of songs going in, so there was some urgency in writing while we were recording that was different than in the past. I luckily hit a very prolific time where I was writing close to a song every day and completing it from beginning to end. That, as well as the initial approach, was to record vocals and guitar first to give it this kind of raw power that would keep those two things connected, which we didn't end up doing on all the songs but we did it on a handful of them. So that was a bit of a departure as well.Advertisement\nI know that in the past you re-recorded and re-released one of your albums. How important is it to you that fans be familiar with your old material?\nI don't think it's that important. If they like it and they want to go into the back catalog, it's a nice introduction and hopefully people enjoy what I do. But as far as any kind of lineage or any need to sell the old material to accept this material, I think it's not necessary.\nThe holidays are approaching and I heard you have a Christmas song in the works. What can you say about that?\n(laughs) I do. Yeah, I recorded this Amazon acoustic Christmas thing and they asked me if I would write [a Christmas song]. Initially it felt out of my wheelhouse and then I sat down and wrote one. But yeah, it's probably a different approach to a Christmas song. But it feels good.\nIt's no secret that there is this DIY quality to what you do. You double as your own tour manager, load your own van, drive from show to show. Is all of this out of desire or necessity?\nIt's a little of both. When I think I can do the job and don't have to pay somebody to do it and I can just work a little harder, I prefer to bring that money home. But I know that many bands at our level do things differently. We don't roll with techs or roadies or sound and lights, which is three guys in a van going from town to town. It's part of the punk ethos and part of the idea that you can do it yourself. I've been doing it for so long that I'm fairly comfortable doing it. We'll see if things change in the future at some point.Advertisement\nI was floored to learn that you grew up listening to bands like Bad Religion, Bad Brains and other punk acts. You've even played Riot Fest and toured with Flogging Molly and Chuck Ragan. What influence does punk rock play in your songwriting style?\nI think there is an underlying aggression in how we perform, and in some of the darker songs and high energy songs. There is a little bit of a punk element still. More so it's probably the approach to doing shit yourself, you know? For us, we're not really in a \"scene.\" We're more of an island where it's just genre-bending and we're not totally associated with other acts or genres. It is kind of this punk thing, this lone wolf idea that it's us against the world.\nToday's music landscape is dominated by hip hop and pop, which command a disproportionate share of attention. Where do you see the place of guitar-driven music today?\nI just want people to feel something. I want to create something that isn't disposable. The ultimate goal is to create something timeless that somebody can listen to in twenty years, or where somebody twenty years ago would have listened to it. Music that moves people is kind of a dying art. Whether it's sorrow, fear, heartbreak, love, happiness - there are so many emotions. A lot of pop music today is kind of this frivolous, disposable stuff.\nYou're playing The Fonda in Los Angeles in January. As an LA guy, what does it mean for you to be headlining a venue like that?\nI always want to progress and move onto bigger and better things, so it's great. We've played there the last two or three times we've been in LA and it's a nice spot. I like things to build and move forward in every market. We've probably played more in LA and the surrounding areas than we have anywhere, so playing The Fonda is a good feeling.Advertisement\nName an artist, living or dead, that you would choose to collaborate with on a record.\nTom Waits or Bob Dylan.\nI'm told you're an avid surfer. A while back, Chris Malloy featured your song \"Wrong\" in his movie Shelter. Have you explored other opportunities to collaborate with the surf community?\nEarly on in my career, that was kind of the start of it. The use of \"Wrong\" in Shelter was kind of the impetus for me to say \"Man, I should really try to do this music thing.\" I was living in San Francisco at the time and [my song in the movie] gave me the push to say \"Maybe this is something viable that I should undertake.\" I had a couple songs in other surf movies but it's been a while. My home surf spot is Topanga. I'm kind of off and on. I'll surf and then I won't surf for six months and be like \"What am I doing?! I've got to get back in the water.\"\nWhat's your most memorable surf story?\nLast year I took a trip down to Baja which was amazing. Surfing is it's own magical thing where you catch one wave and it's this kind of cleansing thing. No cell phones or anything - you're just in the water and maybe with a few friends. There's nothing like it. You're bonding with nature in a way where it's just you and this moving thing. It's therapeutic in a way.Advertisement\nLet's do a little word association. Bob Dylan or Leonard Cohen?\nOh Jesus. You can't really choose. It's like picking a child. I would say Bob Dylan if I had to because he's been a little more prolific in his career. I love Leonard Cohen though.\nGibson or Fender?\nGibson. I play Taylors though, which I love. I'm an acoustic player and Fender's acoustic history isn't nearly as remarkable as Gibson.\nJim Beam or Jack Daniels?\nI'm not really a bourbon man. I'll go with Jameson.Advertisement\nEurope or Latin America?\nEurope.\nHere's a Los Angeles one…East Side or West Side?\nEast Side. I like all that cool shit over there - Silver Lake, Echo Park, Elysian Park. All those places are quite cool.\nFestival or club show?\nClub shows are more consistent. Festivals are a crapshoot. Sometimes you'll play while a big band is playing and no one will come to your stage. But I've had some great festival experiences too.Advertisement\nDark or light?\nDark.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/sal-masekela-paired-up-with-too-hort-to-make-beautiful-music-together", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/10/sal-masekela-too-short-343x254.jpg", "title": "Sal Masekela Paired Up With Too $hort to Make Beautiful Music Together", "publish_date": "2017-10-29", "author": {"name": "Alexander Haro", "url": "https://www.theinertia.com/author/alexander-haro/", "type": "Staff"}, "text_content": "Did you know that Sal Masekela is in a band? You know, of course, that Sal is the voice of action sports, the man with the honey in his throat, the man who crooned at you throughout the X-Games and countless other action sports broadcasts. He's everywhere. He's a Vice guy. He's sat with Snoop. And damn it, he's got a voice that just won't quit. Listening to him speak is like pouring warm molasses in your ears.\nWhich is why, along with Sunny Levine, he's making music in a band called Alekesam. That's Masekela, only backwards. It's also what a magician says when they do something magical. I went to school with a guy named Simon who is a rapper. His name is Zes Nomis. That's Simon Sez, only backwards. See the similarities? That's where they end, though. Unlike Zes, Sal would never include the lyrics, \"suckin' on some titties/so many titties/breakin' out the cocaine/this is not for the kiddies.\"\nBack in 2007 or 2006, Alekesam released their first album. Since then, they've actually done very well-especially considering that Sal has so many irons in so many fires. They call their music Surf R&B, mostly because that title is vague enough to cover their bases and let them get away with making music with no real genre. In 2015, one of their songs was featured on House of Lies, and shit blew up.Advertisement \n\nHere's another fun fact: Sal's dad, Hugh Masekela, \"essentially crafted the anthem for the release of the late Nelson Mandela through his song Bring Him Back Home and had a massive impact on global jazz and the political composition of South Africa.\"\nAlekesam just released their new single, called Oh Shante, and holy shit, Too $hort's involved. Too $hort of such lyrics as \"I met this girl, her name was Joan/She loved the way I rocked the microphone/When I met Joan, I took her home/She was just like a doggy all on my bone.\" That Too $Short!Advertisement\nSee more from Alekesam on Facebook and RVCA (who partnered up with them) on Facebook and Instagra", "type": "video", "video": "https://vimeo.com/239902288"}
{"uri": "https://www.theinertia.com/music-art/it-only-takes-a-rake-and-sometimes-a-bike-to-make-these-giant-beach-drawings", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/10/Screen-Shot-2017-10-08-at-17.55.42-343x254.jpg", "title": "It Only Takes a Rake (and Sometimes a Bike) to Make These Giant Beach Drawings", "publish_date": "2017-10-09", "author": {"name": "Ian Ross", "url": "https://www.theinertia.com/author/ian-ross/", "type": "Community"}, "text_content": "[imagrebrowser id=2388]\nFinding a way to create something you have never seen before is a rewarding feeling. Just as every wave is unique energy moving through the ocean from far away, I love finding ways to put my energy into creating something new each time. As my work evolves, I am searching for balance, harmony with nature, and ways to discover what is possible if I continue to challenge myself. \nMy most recognizable and most shared works of late are these giant beach drawings done with a rake. By utilizing the smooth surface where the tide has receded, a unique type of ephemeral and impermanent art form thrives.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/when-music-inspires-our-surfing-and-surfing-inspires-our-music", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/08/willie-343x254.jpg", "title": "When Music Inspires Our Surfing and Surfing Inspires Our Music", "publish_date": "2017-10-06", "author": {"name": "Alan Stokes", "url": "https://www.theinertia.com/author/alan-stokes/", "type": "Community"}, "text_content": "The surf videos and DVD's we watched over and over as groms became the soundtrack to our lives. Growing up, I would hit the waves with these songs still playing in my head and try and emulate my heroes. Here, we dig a little deeper into how the two are combined in Fins & Strings - Youtube Killed the Video Star. It's a creative journey inspired by music and surf. From jamming to surfing to writing to recording. I've joined up with Willie and the Bandits to write and record a new track, which will be performed live.\nTickets to the Princess Pavilion performance on Friday the 27th October can be found here.\nNote: Follow Alan Stokes and Wille And The Bandits as their surf and musical story continues on their Insty channels @alan_stokes  and @willeandtheba", "type": "video", "video": "https://vimeo.com/236631605"}
{"uri": "https://www.theinertia.com/music-art/nofxs-fat-mike-talks-craft-beer-the-bands-new-music-festival-and-surfing", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/10/mike2-343x254.jpg", "title": "NOFX's Fat Mike Talks Craft Beer, the Band's New Music Festival, and Surfing", "publish_date": "2017-10-05", "author": {"name": "Corey Jones", "url": "https://www.theinertia.com/author/corey-jones/", "type": "Community"}, "text_content": "Fat Mike. Photo: Snodgrass\n\n\n\n\n\n\n\nLast month marked the launch of the inaugural Punk In Drublic Craft Beer & Music Festival, named for NOFX's classic album (and put on in collaboration with Fat Mike himself). The tour will make a stop in Huntington Beach on Saturday, October 28th and will feature co-headlining acts NOFX and Bad Religion, along with four hours of beer tastings and 100 craft beers. I chatted up Fat Mike to talk about the tour and get an update on his adventures in surfing this year.\nWhere did the idea for the Punk In Drublic Festival begin?\nIt actually started with Cameron [Collins] from Brew Ha Ha Productions. They do beer festivals and he's an old punk rocker and he was just talking to John [Reese, from Synergy Global Entertainment] and he was like \"Man, we should do a Punk In Drublic festival and get Fat Mike involved.\" They wanted to do 21 bands in Los Angeles, have it be 21 and over, and have 21 beer companies. I told them I didn't really want to be involved in such a huge thing. But I said \"Let's talk about it. Let's make a festival that's awesome. And let's tour it.\" I told them I'd only want to see five bands and have NOFX and Bad Religion on the bill. That's what I would go see.\nAre there any bands you wanted on the bill that couldn't participate?Advertisement \nI wanted The Interrupters but they were busy. And I just talked to the Bad Religion guys an hour ago and we're going to do 18 shows together next year because Tacoma this year was so fun. And Boise.\nWell that tour announcement is certainly breaking news. What about those cities made the shows different?\nThey were our first test of doing an \"over 21\" show with free beer with a tour that's only on the weekends. And it wasn't in the summer so it wasn't super hot. It's just different. Everything that I would like in a festival is what we're doing. Like, I get to make rules. I made a rule in Tacoma that between bands there would be no punk rock - only Herb Alpert.Advertisement\nIs one of the rules that the festival ends at 9? I saw that somewhere. That's early.\nIt's so people can get home. At one of the shows I asked the crowd how many people had babysitters and half the people raised their hand. But it's like \"Hey, you can keep partying if you want.\" I certainly did.\nGimmes were originally on the Huntington bill and then that disappeared. What happened?\nI don't know. We're fuck ups. I play in the Gimmes sometimes and Jay from Bad Religion plays in the Gimmes sometimes.\nYeah, I saw you guys at Punk Rock Bowling this year and it was funny because Jay was on stage playing and you were off on the side of the stage. What was that like for you?\nIt was so weird, dude. I had just decided to go to Punk Rock Bowling the day before. It's the second time I've seen The Gimmes without me in the band. It's kind of nice though because I take up a lot of space being drunk and talking a lot. I like it when it's just the Spike show.Advertisement\nYou definitely made your presence known during the Bad Religion set though.\nYou know what, that's what's so cool about punk rock. You can't do that in metal or something. I just ran on stage and said \"Jay, give me your bass!\" and he was like \"Ok!\" and I played the song. It wasn't planned. That's how good of friends we are with Bad Religion. It's why we always want to tour with them. They're my favorite band.\nThe irony to me about Punk In Drublic is that it's a beer festival where half the guys in the bands are sober.\nYeah. I don't know. I didn't' really think about that. I drink and party and so do Melvin and Jefe. Jay and Brian [from Bad Religion] have been sober for a bit. I've had beers with Greg Graffin though. He came to my house the other day. It was the coolest thing ever.\nFat Mike. Photo: Snodgrass\nHow do you expect the Huntington Beach show to differ from others stops on the tour so far?\nI expect it'll be much more violent.Advertisement\nI thought those days of violence in the punk scene were over?\nWell, that's the thing. There were about 10,000 people in Tacoma and the paramedics said only two people went to the hospital, which is very low, but they said there were 200 fights. We were giving free beer away, so…\nSpeaking of Huntington, I poked around your Instagram and it looks like you were recently on a dad-daughter road trip that stopped through Long Beach.\nAnd Redondo Beach too! Fletcher [Dragge, Pennywise guitarist] took us out on his boat. We broke down in the ocean and had to get rescued. As a trip, I have to say it's one of the best things I've done in my life. It wasn't a family trip. It was me and my daughter just spending 10 days on the road together. We didn't make any plans. It was like \"What do you want to do?\" So we'd go on a bike ride. \"Want to see a movie?\" We'd go see a movie. [My daughter] came home and said to her mom \"That was the best time I've ever had with daddy.\" It made me cry.\nYou're fairly known for your wordplay. What's the story behind the album title \"Punk In Drublic\"?\nThat's the thing, my mind is just very weird. It really is. I just think about things. I was writing a song about how Switzerland called itself neutral but they really took all the money in World War II and I just said \"Oh, Switzerland! That's funny. If you just drop seven letters it's spelled 'Nazis' backwards.\" It's weird. My mind just plays those word games all the time.Advertisement\nWhat about the cheerleaders on the cover of that album?\nThat was just some guy. He handed me the artwork and had actually offered it to some other band but they didn't like it so we used it. I don't think NOFX has the best album covers in the world. We kind of don't care that much.\nSo we're a surf website…\nOh! I surf now! I finally learned. I mean, I've tried like every three or four years, but I've never been able to get up. So, finally, I got up in Hawaii this year. The thing is, I caught like two waves and was stoked and rode them pretty long. It's not like some original way of surfing, but it's a pretty big board. I'd catch it on my knees, like a paddleboard, and leap forward, catch the wave, then stand up. It works for me because I get so fucking tired of paddling. I know it's Hawaii and it's \"easy,\" but it's the hardest thing in the world!\n\"Not that I'll ever go to f**king Teahupoo, but goddamn! Surfing has just become a totally different thing than I remember.\" - Fat Mike. Photo: Instagram\nI don't know about \"easy,\" I mean it is Hawaii and there are some monster waves in parts.\nBut you know where I was surfing right?\nWhere?Advertisement\nWaikiki. We went to another place too. I think it was called Bowls or something.\nDo you plan to surf more now that you're back in California?\nOh yeah. Definitely. Eric Melvin lives in Del Mar and I really like that beach for surfing. Little waves, you don't have to paddle out that far. You know what I do now too? I spend so much time watching surf videos. I can't stop watching. Not that I'll ever go to fucking Teahupoo, but goddamn! Surfing has just become a totally different thing than I remember.\nNote: Punk 'N Brew Craft Beer & Music Festival will be in Huntington Beach on October 28. Tickets start at $59 and are available through the festival's website.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/mind-surf-these-beautifully-surreal-surfscapes-that-are-literally-out-of-a-dream", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/09/Icebreak-1-343x254.jpg", "title": "Mind Surf These Beautifully Surreal Surfscapes That Are Literally out of a Dream", "publish_date": "2017-09-29", "author": {"name": "Blaze Syka", "url": "https://www.theinertia.com/author/blaze-syka/", "type": "Community"}, "text_content": "The past year has been a whirlwind of balancing multiple obligations and setting my art and personal goals in the right direction. At the same time, it's been full of great opportunities for new projects and some eye-opening travel, both of which have provided me with some extra creative drive and inspiration. I was honored to work on the poster for Cyrus Sutton's documentary, Island Earth, and have worked on numerous collaborations, all of which have been lots of fun to work on. The immediate future holds new special projects, as I hope to bring more ideas to life and focus on the same styles and messages of environmentalism and exploration that inspire me and drive my passion to create new artwork.\nCheck out more of Blaze's work on his website or on Instagram.", "type": "photos", "photo": "https://cdn2.theinertia.com/wp-content/gallery/blaze-syka-art_1/distortion.jpg", "caption": "Distortion. Credit: <a href=\\\"http://www.blazesyka.com/\\\"> Blaze Syka </a>"}
{"uri": "https://www.theinertia.com/music-art/bands-we-dig-check-the-freakadelic-sound-of-banana-gun", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/09/IMG_7368-1-343x254.jpg", "title": "Bands We Dig: Check the 'Freakadelic' Sound of Banana Gun", "publish_date": "2017-09-28", "author": {"name": "Nathan Rivalland", "url": "https://www.theinertia.com/author/nathan-rivalland/", "type": "Community"}, "text_content": "Bananagun\n\n\n\n\n\n\n\nRecently, I had a chat with Banana Gun, the alternative jazz, rock, blues, indie band, following their show with The Babe Rainbow and Parsnip in Melbourne. I was taken into another wicked dimension when they played and was interested to hear what makes them tick. I am always keen to see what inspires bands like these and learn what brought them to music in the first place. The five-piece band has recently jumped onto the scene with their freakadelic sounds, which have been nothing but sweet tunes to my ears.\nHere are some highlights from our chat:\nWhere did the name originate from, do you like eating bananas or something?\u2028\nBananas are our cosmic pistol and we fire bullets of vitamin B\u2028\u2028.Advertisement \nHow long have you been together?\u2028\n16 cycles\n\u2028\u2028How would you describe the music you play?Advertisement\nBits and pieces from and trans-continental flavors. We like a lot of Brazilian, Afrobeat kinda ballpark.\nSo how did you all get started? \nwe started as a three-piece - Jimi, Stella, and myself - but we wanted more percussion and color, so we gradually got Jack and Luki in the fold and now it's freakadelic\u2028.\n\u2028\u2028Favorite venue to play?\nIt's yet to arrive.\n\u2028\u2028Fave 80's song?Advertisement\nBowie stuff.\n\u2028\u2028Advice for up and coming musicians?\u2028\nDon't worry about getting a job. Do what's right.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/sounds-we-dig-words-of-wisdom-from-australias-all-girl-group-parsnip", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/09/parsnip-343x254.jpg", "title": "Bands We Dig: Words of Wisdom from Australia's All-Girl Group, Parsnip", "publish_date": "2017-09-25", "author": {"name": "Nathan Rivalland", "url": "https://www.theinertia.com/author/nathan-rivalland/", "type": "Community"}, "text_content": "Photo: Parsnip\n\n\n\n\n\n\n\nRecently, I had a chance to chat up the Australian band Parsnip. After seeing them play last at the Curtin in Melbourne, I was obsessed with their unbelievable sound and wanted to learn more about this all-girls group. The bob haircuts stood out so bright - a punctuation mark that kind of rounds out everything about their sound and their style.\nSure enough, they were some of the nicest humble people I had ever met. The ladies gave me the name Sweet Potato as I had a new babe rainbow shirt on with \"Sweet Potato\" written across the front. I thought this was pretty damn cool. Anyway, enough of my rambling, here are some highlights from our chat:\nWhere did the name originate from? Do you ladies just love parsnips? They are quite nice. I like using them in my pasta!\nThe name came from Paris, our bass player/singer/songwriter. I always thought it might be because you can make \"Paris\" from the letters in Parsnip, but I think she just chose it. It's weird and kinda sweet and good for roasting. Someone sent us a message the other day saying that they have a greyhound called Parsnip.Advertisement \nHow long have you been together?\nHmmm…the idea for a band came at Jerkfest in Geelong in 2016. So around February? Then we started practicing and played our first show in our lounge in June 2016. So one year and two months-ish.\nSo how did the band get started? Advertisement\nParis, Caz, and I met and became buddies through our boy pals in the Frowning Clouds. We'd all been in other bands before and had all always wanted to play music with other girls. We've become good friends, so it seemed like a perfect fit. Our original keyboard player Sequoia was a friend who played drums in The Clits a few years back, but she had to leave the band about six months ago. Rather conveniently my friend Bec, who I played in a band in Sydney with, had just moved to Melbourne and had keyboard skills, so we asked her to join and she said: \"I do\".\nWhen did you find out you were playing with The Babe Rainbow and Bananagun? Have you known the fellas for a while?\nI spoke to Angus about Parsnip playing with Babe Rainbow a few months back at his wedding in Byron. I've known them for about four years. We met when The Dandelion - a band that I played in in Sydney - played a bunch of shows with them. And Paris tells me that her other band Hierophants played with the Otchkies in about 2011.\nYour favorite venue to play?\nI think it depends more on what bands are playing and if you're having a good time or not.\nAre we going to see lots of Parsnip concerts in the near future?Advertisement\nYeah, we've got heaps of shows coming up in the next few months. Mostly in Melbourne, but a few interstate too. Hopefully, we'll have a chance to finish and release some recordings before the end of the year.\nAdvice for up and coming musicians?\nA song's not going to write itself and nothing's going to start unless you get it started.\nAnd the last question. Was wondering if you had space for an extra band member? \nIf you get the haircut, you're in, Sweet Potato.\nYou can check out more from the ladies of Parsnip here. ", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/iconic-bodysurfer-mark-cunningham-shares-decades-of-found-art-from-hawaiian-beaches", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/09/kelly_mark_art900-343x254.jpg", "title": "Iconic Bodysurfer Mark Cunningham Shares Decades of \"Found Art\" from Hawaiian Beaches", "publish_date": "2017-09-13", "author": {"name": "Zach Weisberg", "url": "https://www.theinertia.com/author/zach-weisberg/", "type": "Staff"}, "text_content": "Mark Cunningham is possibly the most iconic bodysurfer on the planet. Aside from almost single-handedly raising the profile of bodysurfing, he also kept ocean goers safe on the beaches of Hawaii for two decades, with most of that time on the front lines at Pipeline. He's quick with a pun, fast to make friends, and he's also an \"artist.\" He uses the term loosely, but he's amassed an impressive collection of treasures from the beaches of Oahu.\nWe dropped by a recent art show of his at The Board Club in Newport Beach to check it out.\n\"I found most of these things offshore of the island of Oahu,\" says Cunningham, who calls the collection Remains of the Wipeout. \"All of these things were on surfers or surfboards or people, and they all got hammered by a wave and sat at the bottom of the ocean. When they don't have any crust on them, I call them freshly laid, and when they're real crusty, they're artifacts. These are remains of our surfing culture. I've had a lot of friends and family helping me get these on the walls, and I'm stoked to be sharing them.\" Advertisement \nEditor's Note:: Follow Mark's adventures on Instagram here. If you're lucky, his art might come to a town near you. And if it does, check it out. If nothing else, Mark will probably tell you a good joke. He'd probably like this video about tow-in bodysurfing, too.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/jack-johnson-talks-about-the-face-splitting-surf-injury-that-kickstarted-his-music-career", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/09/jack-60-min-343x254.jpeg", "title": "Jack Johnson Talks about the Face-Splitting Surf Injury that Kickstarted His Music Career", "publish_date": "2017-09-12", "author": {"name": "Dylan Heyden", "url": "https://www.theinertia.com/author/dylan-heyden/", "type": "Staff"}, "text_content": "Oahu's North Shore is better known for cultivating surf talent than music greats. Jack Johnson nearly didn't break that mold, until he went head first into the reef one day splitting his forehead and his lip. During recovery, Jack honed his guitar skills, and the rest is history.\nIn a recent interview with 60 Minutes Australia, Jack talks to Peter Stefanovic about his upbringing, growing up surfing, and his thoughts on fame. In the fashion you'd expect from the uber relaxed singer/songwriter, Jack's almost blasé about his multi-platinum album sales, and global recognition.", "type": "video", "video": "https://youtu.be/player.html?config=%7B%22src%22%3A%22https%3A%5C%2F%5C%2Fwww.youtube.com%5C%2Fwatch%3Fv%3DQSH7RgRFGDo%22%2C%22preroll%22%3Anull%7D"}
{"uri": "https://www.theinertia.com/music-art/these-portraits-of-alessa-quizon-and-others-are-being-auctioned-for-hurricane-relief", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/09/Alessa-Quizon-copy-343x254.jpg", "title": "These Portraits of Alessa Quizon and Others Are Being Auctioned for Hurricane Relief", "publish_date": "2017-09-11", "author": {"name": "Carly Long", "url": "https://www.theinertia.com/author/carly-long/", "type": "Community"}, "text_content": "\"Winds were howling near 200 miles per hour while a group of 17 of us, including children and five dogs, barricaded a door those winds were trying desperately to take from us. Three hours of ear popping, howling, banging, crying, praying, screaming children, hugs, and last words…I'm in shock. I don't know how we survived. But we did.\"\nThose are the first words I read from my best friend and mentor. This was the woman who believed in my creative talents and took a chance and welcomed me aboard her photography business, the woman who helped me get through one of the most heartbreaking times of my life. And yes, I could only read them from a Facebook post. Days after Hurricane Irma hit the Virgin Islands and completely devastated a place that so many of us love and hold dear, I still had yet to hear from her directly. I do know she is safe though, and that's all that matters. Many people are still waiting to hear from loved ones, unsure of when communication will be established with a lucky second of wifi signal. Pray for them.\nI am selling paintings seen on my site as well as custom orders to benefit the rebuild of the U.S. Virgin Islands after Hurricane Irma. So many homes - places people gathered in town and spots where so many good memories were shared - will have to be rebuilt, but the people who endured this hurricane, their hearts, their courage, and their resiliency, has remained unwavering.\nNote: Please contact the author with interest at c.a.long@comcast.net.", "type": "photos", "photo": "https://cdn3.theinertia.com/wp-content/gallery/irma-fundraising-portraits/alessa-quizon-copy.jpg", "caption": "Alessa Quizon"}
{"uri": "https://www.theinertia.com/music-art/meet-the-surfer-whos-been-creating-art-like-this-for-40-years", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/09/pros-teahupoo-illustration-phil-roberts-343x254.jpg", "title": "Meet Phil Roberts: The Man Who's Been Creating Iconic Surf Art Like This for 40 Years", "publish_date": "2017-09-06", "author": {"name": "Mikaela Duhs", "url": "https://www.theinertia.com/author/mikaela-duhs/", "type": "Community"}, "text_content": "Photo: Phil Roberts\n\n\n\n\n\n\n\n\"Art is easier than breathing for me,\" Phil Roberts, surf artist, movie illustrator, and water park designer says about his addiction to creation.\nFrom a young age, Roberts was groomed to be an artist along the beaches and boardwalks of Melbourne, Florida. He drew caricatures of rolling waves as surfers painted long, drawn out lines on wave faces; he also drew portraits of famous Florida wave riders.\nGrowing up in the sun and the sand was an inspiration to Roberts, who was awestruck by the way the world came together before his eyes: colorful, majestic and magical. At the spry age of 66, he is still painting, sculpting, and illustrating as often as his younger years, always experimenting with new techniques.\n\"It's funny. I feel like I'm still trying to figure out what my style is,\" Roberts said. \"I paint what is interesting to me and what I like, but my design aesthetics are based in nature. I find all the answers for everything that I need.\"Advertisement \nNo matter what, Roberts keeps going back to the vast ocean oasis he grew up with for inspiration.\n\"It's just this amazing phenomenon of invisible energy making these waves come in and mold them perfectly into shapes,\" he said. \"Enjoying the ocean puts me in a transcendental state and trance which fires up my imagination. Before I know it, I'm thinking of all kinds of paintings.\"\nAlthough he is a formalistic painter and sculptor, Roberts says he couldn't imagine a world where surfing and art weren't intertwined like they are so effortlessly today.Advertisement\n\"Art and surfing are married,\" he said. \"Surfboard shapers are sculptors. Every surfer is an artist. When he's not surfing, he's got his ballpoint pen and he's doodling pictures of waves.\" For Roberts, his personal expression through surfing ignites all sorts of feelings in him that are then shown in paintings, sculptures, and drawings.\n\"Surfing is just a form of dance. It's so Christlike because you are walking on water. It's ridiculous when you are watching the reef fly beneath you, and you are just gliding,\" Roberts said.\nRoberts even uses art to demonstrate his philosophies for life. For example, he finds the process of sculpting and surfing shockingly similar. When creating molding a piece of work, the sculptor must step aside to allow the figure's identity to completely come into the clay, while also leaving a personal mark of the artist. Roberts feels the same way about surfing.\n\"The wave is its own entity.  The wave will change and evolve as you are surfing,\" Roberts said. \"Not only do you make your own mark, but you also have to step aside from yourself and allow the wave to be the wave. When the two of you are dancing together, you respect the wave, but you still have your personality, it turns into a really beautiful thing.\"\n\"Life has a strange way of putting you exactly where you are supposed to be, to do what you are supposed to do. I see that occur in my life all the time. Being at the right place, at the right time and the right moment for a new change, a new shift, a new paradigm a new person to collaborate with.\"\nAfter cartoons and caricatures, Melbourne shapers such as Mike Tabeling and Dick Catri passed Roberts' painting talents from factory to factory where he was employed to spray paint surfboards. Through his involvement in the shaping scene, other employees would indulge in surf speak during breaks and lunch time. Ideas sprouted and soon experimentation and innovation began with different shapes, bottoms, fins and stringers.Advertisement\n\"I'm seeing all of that experimental thinking, in a whole new generation of shapers now. I've seen them come up with stuff, that I say 'Yeah, we did that in the 1970's and this is as far as we got.' With the new technology, it's opened up the world again to all kinds of innovation.\"\nBecause of his immediate entrance into these exciting social circles filled with new ideas for surfing, Roberts developed a strong friendship with Tom Morey, the inventor of the boogie board. Through their mentor/mentee relationship, Roberts looks forward to gracing future innovators of surfing, art and thinking with inspiration.\n\"I live for sharing the ocean with other people,\" Roberts said. \"I wouldn't be here today if it weren't for the people that loved my artwork. I was raised by the community. I am successful because the community made me successful. I'm forever grateful for that. I am excited to pass that along to the new generation.\"", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/this-is-what-happens-when-a-professional-surfer-hits-the-road-with-a-touring-band", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/08/willie-343x254.jpg", "title": "This Is What Happens When a Professional Surfer Hits the Road With a Touring Band", "publish_date": "2017-09-01", "author": {"name": "Alan Stokes", "url": "https://www.theinertia.com/author/alan-stokes/", "type": "Community"}, "text_content": "Fins and Strings is a webisode series featuring Wille and the Bandits, Alan Stokes, and their creative journey inspired by music and surf. From jamming to surfing to writing to recording. The next few months will see the pair come together to write and record a new track, which will be performed by Stokesy and the band live.\n \nNote: Tickets to the live one off music and film performance at the Princess Pavilion on Friday the 27th October are available online here. You can also find @alan_stokes and @willeandthebandits on social media.", "type": "video", "video": "https://vimeo.com/231728816"}
{"uri": "https://www.theinertia.com/music-art/mystic-naturalism-and-my-path-to-sculpting-waves-out-of-stone", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/08/IMG_0933-343x254.jpg", "title": "Mystic Naturalism and My Path to Sculpting Waves Out of Stone", "publish_date": "2017-08-23", "author": {"name": "Andrew Hamra", "url": "https://www.theinertia.com/author/andrew-hamra/", "type": "Community"}, "text_content": "Photo: Andrew Hamra\n\n\n\n\n\n\n\nTwo years ago, I took a much-needed sabbatical following a year and a half in the start up trenches of San Francisco. I had accomplished what I needed with the product I was developing, but the city had taken its toll on me. Surfing had been my go to activity for recharging for over 20 years, so I planned a couple weeks near the water. Most of my surfing travels have taken me south to the Pacific mainland of Mexico with a few journeys as far down as Ecuador and Peru. This time, however, I was looking for something special. I decided to make the pilgrimage to Bali. As the trip started to take shape, I decided to add an additional 10 days in South Africa. It wasn't to surf, rather a nine day Ayahuasca, San Pedro, and Iboga retreat. Nine days of the most advanced psycho-therapeutic experience on the planet followed by three weeks of integration/decompression surfing in one of the most epic settings imaginable. This was a proper sabbatical.\nOddly, the experience that left the biggest impression on me in Bali was not in the water. I had picked up a board at the local surf shop near Bingin Beach and had gone back to ask the owner about some other local breaks. No one was in the shop, so I wondered around the back of the building where I heard sounds coming from a small covered shed. As soon as I entered the space, I was filled with a profound sense of peace and stillness. When my eyes finally settled, I saw the owner shaping a surfboard. After the nine day retreat I was as energetically open and sensitive to my environment as I had been in years, and the vibe I picked up on in that shed was as pure and dense as I'd come across.\nThe rest of my time in Bali was full of great surf, great food, and great naps, but it wasn't until I returned to my home in Austin, Texas where I had my creative vision. It was a lazy Sunday afternoon, and I was just fooling around on my computer. My housemate, however, was busy building a custom speaker cabinet. My next thought was that my time on this planet would be much better spent if I were creating with my hands. Right then, I looked past my buddy onto the shelf behind him and focused on a small wave-like soap stone sculpture I had made a decade earlier. And that was my vision: stone wave sculptures.\nPhoto: Andrew Hamra\nIt all just lined up from there. Using almost the same tools as a surfboard shaper, I would turn stones into waves. Now, even though I was landlocked in the heart of Texas, I could visualize waves, carve, and make art at the same time. Three years and 25 sculptures later, I can say the creative process to sculpting stone is as engaging as surfing itself (almost). The biggest difference is that I can carve stone for three to five hours straight while carving a wave usually only lasts a few seconds.Advertisement \nAccessing a flow state for such long periods has affected me on physical, psychological, and spiritual levels. Physically, working with stone is an intense process, as each stage has its own tools and feel. First is the raw relief cuts which require a diamond blade. I've found this phase particularly satisfying as it has a lot to do with pressure and rhythm. As a drummer, this is a familiar feel. Once I've scored an area into small squares, I use a hammer and chisel to chip off the stone pieces. The sound of metal hitting stone over and over is extremely hypnotic. After a couple hours of repeated scoring and chipping, my nervous system is about as blissed out and calm as ever. It's definitely cathartic.\nPhoto: Andrew Hamra\nOnce the larger pieces of stone have been removed and the shape of the wave starts to form, I switch to a curved angle grinder. The angle grinder is a unique tool and it's in this stage where a lot of the magic happens. As my movements become more subtle, I bring my breath into acute awareness. It's very similar to Tai Chi in that I'm harmonizing movement and breath into a meditative state. This state generally continues throughout the sanding process where I use both electric tools and hand techniques. Each level of sanding brings with it a more subtle feel, and there is definitely a musicality to my movements. By the end of the sanding process, my awareness is usually so heightened it's almost like I can feel any irregularities in the stone like notes that are out of tune. A finished sculpture is then a composition created from harmonious and rhythmic movements of body and breath.\nAs a surfer, I think about waves all the time. I remember reading somewhere that waves are mother nature's magnum opus, and I absolutely agree. Being out in the water watching the waves roll in, take shape, peak, break, and peel is some of the most beautiful imagery imaginable. Particularly, it is the moment the wave breaks, when the potential energy becomes kinetic, that is at the very core of my art - the shape that occurs the instant a swell becomes a wave.Advertisement\nThe breaking wave is curved, it is beautiful, and it is powerful. These thoughts play on repeat in my head while I sculpt. The term \"active imagination\" is a process in Jungian psychology used to bridge the divide between one's conscious and unconscious mind, and these concepts allow me to enter that space. Softness and fluidity are the basic elements necessary for a curve to take shape. Visualizing a curve is almost like bending time, which is key to unlocking the subconscious. While beauty is a little more esoteric, it creates the light for the journey within. The power comes from what is released. The act of chipping and grinding away hard stone into beautiful curves is the ultimate transformation. As I work, I am literally transforming old thoughts and emotions into more fluid beautiful ones. With each piece, I am trying to break through my sub conscious until I find peace in the shape of a wave in its purest form.\nPhoto: Andrew Hamra\nAs an artist and surfer, I've found that my spirituality and style go hand in hand. The name I've chosen to give it is Mystic Naturalism. Naturalism from an artistic perspective means \"a style and theory of representation based on the accurate depiction of nature,\" and from a philosophical viewpoint believes that \"reality is based on natural forces as opposed to the supernatural or spiritual.\" However, whether through ayahuasca, surfing, music, or any other countless methods, I believe mystic and spiritual states are accessible. Thus, the term Mystic Naturalism creates a unique juxtaposition and a broader abstract aesthetic framework.\nWhile my sculptures do have a figurative quality, they are more of an abstract representation of the emotions felt while experiencing a mystic state. Finding the perfect wave upon which to layer emotions derived from mystic states is my intention with each piece. It is a slow process of soul searching finding the shape, but the process itself is integral to my artistic expression. In the end, a piece is successful if moves the viewer to recall a mystic experience of their own or if they can take something new away entirely.\nMuch of my knowledge regarding the mystic approach to art comes from Wassily Kandinski's book \"Concerning the Spiritual in Art.\" He believes that art can \"unfold the human soul and lead it into receptivity of cosmic power and joy\" -Hilla Rebay. Kandinski uses the term \"Dance-Art\" which is a combination of musical movement, pictorial movement, and physical movement as a means to achieve spiritual harmony. For me, the entire process of sculpting is a conscious spiritual pursuit with the purpose of expressing the moments of mystic beauty I have experienced surfing and beyond. Moving and breathing with rhythm as I dive into my subconscious with curved lines as my guide, my art is ultimately a meditation on beauty and becoming. My aim is to stir the souls of surfers and non-surfers alike.\nPhoto: Andrew Hamra\nNote: The author's first gallery show is coming up in October, with opening night set for Friday September 29th, at the Parts & Labour Gallery on South Congress in Austin, TX. 5% of all profits on opening night will be donated to the Save Our Springs Alliance.\nFor interest or inquiries, visit www.stonewavesculptures.com or follow the author / artist on Instagram here.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/surfer-artist-to-host-surf-day-at-usmexican-frontier-to-highlight-the-absurdity-of-borders", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/08/usmex-border-343x254.jpg", "title": "Surfer-Artist to Host Surf Day at US/Mexican Frontier to Highlight the Absurdity of Borders", "publish_date": "2017-08-11", "author": {"name": "Dylan Heyden", "url": "https://www.theinertia.com/author/dylan-heyden/", "type": "Staff"}, "text_content": "US on the left, Mexico on the right. Photo: Machine Project\n\n\n\n\n\n\n\nThe physical barrier that divides the United States from Mexico at its westernmost end looks radically different on both sides of the fence. To the north, Border Field State Park - an undeveloped beach and coastal habitat that acts as a buffer between the city of Imperial Beach and Tijuana. To the south, the Plaza Monumental de Tijuana, also known as the Bullring by the Sea that still hosts bull fights as well as concerts and boxing matches. The fence that bisects the land jets out into the surf some 20 yards - a sad excuse for a physical barrier as it wouldn't take much of a swimmer to go around it. Still, the looming presence of border security forces keeps people in line. On both sides. Still, if the surf's pumping just north of the fence, it's pumping just south, too.\nThese similarities and differences that charge conversations about borders, and more importantly the physical space surrounding the western beaches of the US/Mexico border are ultimately what inspired artist and surfer Diego Palacios to organize a project that invites surfers to be in the space and experience it.\nWe caught up with Palacios to get a better sense of the origins of the project happening this Saturday on both sides of the border.\nI hesitate to use the word \"demonstration,\" but explain to me what this project is, and where the idea came from.Advertisement \nThis is art from a social practice approach. The structure is a social gathering. It is meant to be non partisan. I didn't make the political environment that surrounds the border but I use the space as one of the elements in a simple gesture. The other main element is surf culture. I was struck by the opposing sides of the border when attending a wedding of some friends that live in Playas Tijuana. On the Mexican side of the border is a park dedicated to friendship. This park is marked by a light house and was historically used as place where people could hug each other through the fence. On the US side of the border the primary markers are surveillance and a state beach that sees very little recreational use. The intention is to simply bring people to this space by providing surfboards to socially engage with the space.\nFor those who may not have heard of Machine Project, who are they and how did they get involved?\nMachine Project is a leading nonprofit art space in Los Angeles that provides institutional support to artists. They have had much recognition including an invasion of LACMA. They hold workshops ranging from technology to yodeling. I approached them with this idea and they liked it.Advertisement\nWhat's your background both personally and as an artist, and how do they relate to this project?\nI am a surfer that was born in East Los Angeles. It took a lot of effort for me to make it to the beach as a kid. I have alway been between Mexico and America. Despite being between these two worlds it is where I am most comfortable and happy. Perhaps this project is a way for me to reconcile this in-betweenness. Like a kid who's parents love each other but are always fighting.\nAnyway, I just graduated from cal state Long Beach and will be attending a graduate program in sculpture at Yale University.\nThe border's been a place for similar exposés of the absurdity of manmade divisions in the past, do you think it has a more potent quality now in this sociopolitical climate in both the US and Mexico?\nYes I do. While I don't mean for this to be a scathing critique of American border policy I do hope people can come experience this for themselves and draw their own conclusions. Interactions here are cheerful and exciting. It is a public space where we can reconsider what it is that we are saying with our actions. The insertion of surfing here is a natural fit. We come to Mexico for surf and food and a freedom we lack in the United States. It's not less free, it has different freedoms.\nTo go off of that, \"the border\" in American politics can be a divisive subject among citizens. Not only does the border physically separate people, but even within the same country as a rhetorical tool it divides. How does the project address the border as both an idea and a physical barrier.Advertisement\nIt is a divisive subject. The border is a complex conglomerate of needs and wants. Perhaps the most damaging is racist ideology. There will surely be those that block immigration reform based on these ideas. I do not believe that it is an outside hatred that should be guarded against as much as it is an internal one. That being said, it is a complex situation where contradictions exist. There are absurdist realities to the border and practical realities to the border as well. They exist together. What are the contradictions? How can those contradictions be resolved? Can they be resolved?\nThe event is free and will take place both at Border Field State Park and Playas Tijuana from 10:30 am to 5 pm. More info on Machine Project's website.", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/kelly-slaters-commentary-on-the-bachelorette-finale-is-on-point", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/08/slater-rachel-lindsay900-343x254.jpg", "title": "Kelly Slater's Commentary on the Bachelorette Finale Is ON POINT", "publish_date": "2017-08-08", "author": {"name": "Zach Weisberg", "url": "https://www.theinertia.com/author/zach-weisberg/", "type": "Staff"}, "text_content": "We watch it too, braddah. We watch it too. Image: The Inertia/ABC\n\n\n\n\n\n\n\nIf you're anything like Kelly Slater, me, or 7.47 million viewers around the world who love to watch couples sort through their dramatics in full public view, you watched Rachel Lindsay choose Bryan Abosolo on the Grand Finale of the Bachelorette last night. And if you're anything like Kelly Slater, me, or 7.47 million viewers around the world, and you wonder how it is that you invested roughly 24 hours of your waking life watching a woman sort through 31 dudes in a bizarre social experiment-turned-fishbowl-reality show, the answer is simple: It's actually pretty entertaining. Last night, surfing's greatest competitor and ambassador, Mr. Kelly Slater, took a bold step in giving too-cool surfers around the world permission to finally have the Bachelorette conversation we've all desperately wanted.\nWrote Slater on an Instagram story, \"Anyone else watch #thebachelorette (cause their girl was watching, of course) and know Bryan was her default and not the guy she was in love with? And then she was pretty condescending to Peter…cause she still digs him and can't face it. #GuiltyPleasure\"\nYes, Kelly. I did notice that (cuz my girl was watching, too, of course). That was a very insightful observation.\nTruth. Image: @kellyslater\nAnd while we're on it, I think Peter handled himself quite gracefully. He couldn't have been more straightforward with Rachel on their final date when he concluded that he was, in fact, in love with Rachel, but he wasn't prepared to propose within 24 hours. It seems he realized the time constraints of the show didn't enable him to build a foundation meaningful enough to sustain a lifetime. If Lindsay had the courage to accept a more reasonable timeline in spite of the show's mandates, then they might be exceptionally happy together. They'd have found a substantive and lasting foundation on their own terms. An admirable proposition.Advertisement \nI noticed that very much, Kelly. Thank you for noticing, too.\nI also noticed that Rachel Lindsay still had some exceptionally strong feelings for Peter that didn't feel resolved. As you noted, they seemed to manifest through a combination of anger and condescension. It's unfortunate, but sometimes, that's what pain looks like. It appears that Peter's desire for a more even-paced evolution to their relationship made her feel a bit silly, and she laid bare her insecurities about the only rejection she ultimately faced on the show as well as her decision to proceed with her relationship with Bryan by lashing out at Peter, who handled himself with class.\nDid you notice that? And who do you think will be the next Bachelor? I'm rooting for Eric. #GuiltyPleasureAdvertisement\nP.S. Did you know a former Bachelorette contestant contributes to The Inertia on occassion? He's a very funny writer and great guy. And he surfs!", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/malibus-seasick-in-paradise-exhibit-shows-the-intersection-of-art-and-surfing", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/08/CristineBlanco_Sharks_May2017_resized-1-1-343x254.jpg", "title": "Malibu's Seasick in Paradise Exhibit Shows the Intersection of Art and Surfing", "publish_date": "2017-08-07", "author": {"name": "Molly Lockwood", "url": "https://www.theinertia.com/author/molly-lockwood/", "type": "Community"}, "text_content": "Surf culture is a goldmine for artistic inspiration. That creativity can be expressed through any number of mediums, from film to photography, sculptures, graffiti, or even a tan piece of leather lying with a beach chair and a beer can. At the Depart Foundation in Malibu, all of these ideas and more are featured in a vibrant exhibit called Sea Sick in Paradise. The show's curator, Amy Yao, was very intentional in highlighting a myriad of different perspectives in the exhibit. \"I've seen a lot of shows that were the same voices over and over,\" she says. Focusing on Southern California, the show is a celebration of the vibrant and multifaceted community of people who live their lives by the sea.\nThe exhibit will be open in Malibu through September and will feature screenings and speakers, including the Pulitzer Prize winning author, William Finnegan.", "type": "photos", "photo": "https://cdn3.theinertia.com/wp-content/gallery/sea-sick-in-paradise/cristineblanco_sharks_may2017_resized-1.jpg"}
{"uri": "https://www.theinertia.com/music-art/third-eye-blinds-stephan-jenkins-joins-jimmy-miller-foundation-to-support-vets-through-surfing", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/08/stephanjenkins900thirdeyeblindsurf900-343x254.jpg", "title": "Third Eye Blind's Stephan Jenkins Joins Jimmy Miller Foundation to Support Vets through Surfing", "publish_date": "2017-08-02", "author": {"name": "Zach Weisberg", "url": "https://www.theinertia.com/author/zach-weisberg/", "type": "Staff"}, "text_content": "The sky was gold. It was rose. I was taking sips of it through my nose. \nLiterally. It was all happening. \nStephan Jenkins, lead singer of Third Eye Blind, was guiding a veteran with PTSD to the ocean to catch his first wave at El Porto in Manhattan Beach, California, and all seemed to fit together nicely. Advertisement \nSand between toes. Beach was giving a feeling - an earthy feeling I believe in. \nWhen I was twelve, blasting Semi-Charmed Life on Z104 gearing up for the next Bar Mitzvah on the Hampton Roads circuit, I had a hunch Jenkins was a surfer. Or would become a surfer. I didn't know, however, that I'd meet him in the exact environment he so poetically exalted on airwaves for the next two decades. Beyond that, I didn't expect that encounter would arrive in service of veterans suffering from PTSD.\n\"I love this group,\" said Jenkins of the Jimmy Miller Foundation. \"They honor Jimmy's life by teaching people who have PTSD, who are working through that, and we take them surfing. It's really as simple as that. That's what's so beautiful about this message. It doesn't need more than that. It's a place that centers you and brings you into focus. When a wave comes, and you take it, you are present in that moment.\"Advertisement\nAs a kid, Jenkins was drawn to surfing through trips to Santa Cruz, but he said it wasn't until twelve years ago that he made surfing foundational to his life. Now, birthdays, post-tour celebrations, and moments where he's able to give back all revolve around the ocean. Which brings us to a summer day at El Porto.\n\"I think it's incumbent upon us to find a way to support veterans and to also support active service people, because the strain that's been put on them is unprecedented in American history,\" said Jenkins. \"We have an obligation to those who do serve. We've been in conflicts now for over thirteen years, and that stress is one I that can't even imagine. So we gather in and offer the things that we have to offer. For me, that's through surfing.\"\nNancy Miller, co-founder of the Jimmy Miller Foundation told us that Stephan discovered the organization online while actively seeking out nonprofits about a year ago. Jenkins gave them a call, and quickly found himself at Camp Pendleton with the Wounded Warriors Batallion. The experience was so positive, sharing surfing as therapy for military veterans who've experienced unimaginable stress, that he continues to champion the cause.\nThe veteran Jenkins joined in the ocean minutes earlier popped up on one knee, then two feet. His hands spread to his sides, delicately balancing himself above the whitewater smiling ear to ear.\n\"They're here to feel the saltwater on their skin and on their hair,\" said Miller. \"You can hear them laughing and clapping and having the time of their lives.\"\nSounds like a Third Eye Blind song. Which makes a whole lot of sense.Advertisement\n\nEditor's Note: Learn more about the Jimmy Miller Foundation here, and check out the rest of Third Eye Blind's Tour, which runs through October 7th, 2017 here.\nVideo shot and edited by Alex Smolow", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/this-artist-is-absolutely-killin-it-on-the-streets-of-new-york", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/07/street.jpg", "title": "This Artist is Absolutely Killin' it On the Streets of New York", "publish_date": "2017-07-27", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "The before and after can be seen, here.\n\n\n\n\n\n\n\nThere's an artist. His name is Tom. Tom Bob. That doesn't sound like his real name. And who knows if his art is legal? But it's making little features of New York City streets look better. And we don't want to name which streets because we don't know. But apparetnly he's a Beatles fan, with at least two pieces depicting imagery of the band. And he gives everything else a friendly-aura, in an otherwise stark setting. Bob's Instagram page is a good follow, too. He's got a lot of fans that don't want him to ever get caught.\nSee a full before and after gallery, here.", "type": "video", "video": "https://youtu.be/NB0zttuK-OQ?feature=oembed"}
{"uri": "https://www.theinertia.com/music-art/how-these-surf-inspired-collages-pay-homage-to-my-home", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/07/Pineapple-juice.jpg", "title": "How These Surf-Inspired Collages Pay Homage to My Home", "publish_date": "2017-07-27", "author": {"name": "Filipa Costa", "url": "https://www.theinertia.com/author/filipa-costa/", "type": "Community"}, "text_content": "From deep inside my imagination, I build intricate pieces where my surfing background and hometown are always present. Collages are part of my universe, with contrasting patterns put together to form a new shape and new lines that reveal an exotic, \"crumbled\" image.\nSince 2015, mandalas have been appearing more and more in my work. Whether they're hand drawn, small, or big, they are highly symbolic instruments that remind me of surfing, alchemy, astrology, and nature.", "type": "photos", "photo": "https://cdn2.theinertia.com/wp-content/gallery/filipa-gallery/about-my-soul_.jpg"}
{"uri": "https://www.theinertia.com/music-art/these-chris-burkard-and-paul-nicklen-photos-are-going-for-as-much-as-18000-in-a-manhattan-gallery", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/07/Screen-Shot-2017-07-17-at-12.13.35-PM-copy-343x254.jpg", "title": "These Chris Burkard and Paul Nicklen Photos Are Going for as Much as $18,000 in a Manhattan Gallery", "publish_date": "2017-07-19", "author": {"name": "Mikaela Duhs", "url": "https://www.theinertia.com/author/mikaela-duhs/", "type": "Community"}, "text_content": "White water and ice faces paint a unique picture under the northern lights, illustrating just how beautiful our planet is. But how important is it to protect the things we love? Photographers Chris Burkard and Paul Nicklen have joined forces to show the wonders of the world in the form of moving water molecules frozen in time, hoping to inspire ecological conservation and protection.\nVanishing Worlds: An Exploration of Fine Art and Environmental Conservation, opened July 15 at the Paul Nicklen gallery in Lower Manhattan. It focuses on disappearing rivers and floodplains in Iceland, including Arctic landscapes. With almost six million Instagram followers between them, the two photographers are hoping to start a global conversation on how to best admire and protect these threatened ecosystems.\nTheir collaboration is an example of how fine art can be used to enlighten people that don't get to see the world's natural beauty for themselves. It highlights the challenges posed by climate change and industrial development. The collection has a range of photos selling for anything for as low as $4,000 and as high as $18,000, with most of the proceeds going to the marine conservation group Sea Legacy, a non-profit that uses visual storytelling to break down scientific oceanic research.", "type": "photos", "photo": "https://cdn3.theinertia.com/wp-content/gallery/burkard-ny-gallery/screen-shot-2017-07-17-at-12-13-14-pm-copy.jpg"}
{"uri": "https://www.theinertia.com/music-art/frankie-seelys-malibu-rose-ride-is-the-best-performance-art-experiment-in-surfing", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/07/noseridingroseriding-343x254.jpg", "title": "Frankie Seely's Malibu Rose Ride Is the Best Performance Art Experiment in Surfing", "publish_date": "2017-07-11", "author": {"name": "Beth O'Rourke", "url": "https://www.theinertia.com/author/beth-orourke/", "type": "Community"}, "text_content": "You've seen some toes on the nose, but you probably haven't seen a rose on the nose. Frankie Seely is a born and bred First Point Malibu girl, known to plenty of people in California's surf scene. A local artist once even memorialized her unmistakable noserides with a vibrantly colored mural on the wall of the Malibu Creek shopping center, directly across from that iconic wave at Surfrider Beach.\nOutside of the lineup, Frankie is an accomplished young woman. A student pursuing an astrophysics degree at UCSD, she's also an artist who experiments with performance art. And that's what led us to the roseriding idea. It's a ridiculous but oddly satisfying spoof on longboarding's ultimate move, but it also created an arresting visual for water photography - Frankie walking to the nose, placing her feet on the end of her board, and setting a beautiful orange rose down. The orange rose, cut by Frankie in her home garden in Topanga, stands for desire, enthusiasm, and passion. So while the roseride/noseride is an easy play on words, I really can't think of a better symbol to represent one of Malibu's best.\n \nYou can see more awesome noseriding and performance art on Instagram thanks to Francesca Seely, and find more from the filmmaker, Beth O'Rourke.", "type": "video", "video": "https://vimeo.com/224871884"}
{"uri": "https://www.theinertia.com/music-art/how-this-artist-finds-the-same-flow-state-in-both-surfing-and-painting", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/07/Cosmollogy-detail-343x254.jpg", "title": "How This Artist Finds the Same Flow State in Both Surfing and Painting", "publish_date": "2017-07-07", "author": {"name": "The Inertia", "url": "https://www.theinertia.com/author/theinertia-com/", "type": "Staff"}, "text_content": "This gallery is part of our #CreativeLines series, featuring talented artists whose inspiration comes from a love for the ocean. Byron Bay artist and Founder of the Byron Bay Surf Festival, James McMillan, has taken over our Instagram account to share some of his favorite creations and the awesome stories behind them. Here's what James has to say about the creative vibes he finds in both painting and surfing, called NoMindState:\n\"The paintings I do are a particular combination of images and colors organized in a spontaneous yet specific manner. I generally don't represent reality in my work; if I wanted to do that I would take a photo. I started painting around '92, and then this current style of painting emerged around 2002 when I was writing my surf book 'Blue Yonder'. At the time, I was hanging out a fair bit with @andrewkidman, @andydavisdesigns, and Derek Hynd. I got inspired and created art in between writing stories and taking photos. I like the space I get in whilst painting and it happens with surfing, too… I call it the NoMindState.\"\nNote: You can find more artist takeovers from our #CreativeLinesSeries on The Inertia's Instagram. And you can find more of James' work on Instagram here and online here. \n ", "type": "photos", "photo": "https://cdn1.theinertia.com/wp-content/gallery/james-mcmillan-creativelines/sundays-gettin-high-on-jmc-mid.jpg", "caption": "Sundays (gettin\\' high on...) : I painted this around 2008. It\\'s long gone now, in a house somewhere in Byron Shire. When I first moved to Byron from Cronulla in the summer of 05/06, I used to hang out with a spiritual community called New Earth Tribe. Each Sunday about 80 of us would gather with our drums and instruments and praise God for a couple hours. I\\'d always leave high as a kite, in a daze."}
{"uri": "https://www.theinertia.com/music-art/california-will-always-be-my-favorite-place-so-i-paint-it", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/07/MorrowRock10x20-343x254.jpg", "title": "California Will Always Be My Favorite Place, So I Paint It", "publish_date": "2017-07-04", "author": {"name": "Andrew Palmer", "url": "https://www.theinertia.com/author/andrew-palmer/", "type": "Community"}, "text_content": "My passion is surf art but I would say the real passion is for California surf art. I grew up on the central Oregon coast in a small town named Newport. When I was in middle school, I visited my aunt and uncle in San Diego and immediately fell in love with the place. I always told myself I'd move there and sure enough when I graduated college that's exactly what I did. We moved to beautiful North County San Diego in the Carlsbad/Encinitas area and lived there for about 10 years. I studied architecture and surfed in my off time. My love for the area and culture never waned and I began painting it. For me the ultimate expression of loving something is to paint it, and I did just that. Say what you will about California and any negative stereotypes it might hold. From aggro surfers to crazy drivers on the freeways, I never really gave the madness of California much attention. I guess I turned a blind eye to it and saw it with rose colored glasses. I really loved where I lived and now I miss it a lot.\nI've made a lot of road trips up the Pacific coast, often on the way to visiting family in Oregon. I especially fell in love with California's central coast. There was just something about the untapped, pristine nature that struck a cord with me. I think in a way it was a perfect blend of the rugged Oregon coast and southern California (if there is such a thing). I'll never forget reading about the first Spanish explorers who settled California. They reported back to Spain, describing California as the \"Land of milk and honey\". In my mind, Southern California probably looked a lot like our modern Central Coast. The area still feels like the wild west and is definitely a place I could retire someday.", "type": "photos", "photo": "https://cdn3.theinertia.com/wp-content/gallery/california-surf-art-andrew-palmer/beach-wagon_10x20-copy.jpg", "caption": "Andrew Palmer"}
{"uri": "https://www.theinertia.com/music-art/the-iconic-north-shore-recreated-through-photorealism-paintings", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/06/Gods-Glory-343x254.jpg", "title": "The Iconic North Shore Recreated Through Photorealism Paintings", "publish_date": "2017-06-29", "author": {"name": "Andrew Palmer", "url": "https://www.theinertia.com/author/andrew-palmer/", "type": "Community"}, "text_content": "I would say the single most important influence on my art career has been the highly successful photorealism artist Scott Jacobs of San Diego, a man mainly known for his Harley Davidson art. When I met Scott and saw his artwork I immediately knew it was what I wanted to do for a living. My jaw literally hit the floor in awe of his artwork at a gallery in Rancho Santa Fe, California. Since then, Scott has been a huge mentor in my life and still is to this day\nMy biggest struggle as an artist was probably what a lot of other artists go through, transitioning to the life of a full-time artist. I had always wanted to be an artist, but the world tells you you'll starve, so I did the logical thing and got a safe degree in business and then applied my artistic talent to study architecture. After graduation, I got a mid-level retail banking job and I hated it. At this time, I was waking up at the crack of dawn to paint, then go to work at my \"traditional job,\" coming right back home to paint at night.\nEventually, the opportunity came up to move to Oahu, so two years ago my wife and I packed up our family and moved across the Pacific. This allowed me to strongly pursue art full time and the rest is history. We've moved into our own humble little house and I'm now working full-time as an artist. It's incredibly hard but rewarding and worth it. I'd never trade it.\nI strongly believe everyone has a purpose and destiny in life. Sometimes you just need to take a leap of faith to come into it.", "type": "photos", "photo": "https://cdn2.theinertia.com/wp-content/gallery/palmer-ns-art/bluecrush-24x36.jpg", "caption": "AndrewPalmer BlueCrush 24x36 188, 1/26/16, 2:00 PM,  8C, 7442x11092 (494+117), 108%, Custom,   1/8 s, R36.3, G27.5, B46.7"}
{"uri": "https://www.theinertia.com/music-art/how-my-surfy-art-keeps-me-inspired", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/06/InkySurfer-03-343x254.jpg", "title": "How My Surfy Art Keeps Me Inspired", "publish_date": "2017-06-23", "author": {"name": "Allan Wrath", "url": "https://www.theinertia.com/author/allan-wrath/", "type": "Community"}, "text_content": "You may have seen my bearded alternative surfer folk while scrolling the feeds of Instagram. It's been my dream to be an artist since I was six when I first heard of Michaelangelo. 10 years into a career of freelance art and design and I am still inspired by that same dream that started as a kid. Now I'm married with two kids and a freelance career that is so busy, but always keeps me inspired.\n \nYou can find more of the author's awesome work on Instagram here.", "type": "photos", "photo": "https://cdn3.theinertia.com/wp-content/gallery/wrath/theinertia-01.jpg", "caption": "I was honoured last year to be approached by Billabong to create a piece for their Grom Comp. I was given a good brief to draw a tandem bike that was able to transport all their grommy kind of stuff to the beach. Basically this piece of art is what came out of my brain. What kid wouldn\\'t want a bike like this? "}
{"uri": "https://www.theinertia.com/music-art/these-are-paintings-made-by-technology-that-measures-physiological-responses-to-skating", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/06/ArtofDoing_3-343x254.jpeg", "title": "These Are Paintings Made by Technology That Measures Physiological Responses to Skating", "publish_date": "2017-06-23", "author": {"name": "Mikaela Duhs", "url": "https://www.theinertia.com/author/mikaela-duhs/", "type": "Community"}, "text_content": "Photo: Dew Tour\n\n\n\n\n\n\n\nThe dark room was illuminated by a glow of soft pink and blue, lighting up the rows of wooden skate decks hanging from the wall in a parallel masterpiece. The colors moved like lava, warping into different abstract shapes as they combined and fell together to make new visual eye candy. The liquidation of color displayed on the boards was beautiful and the emotions behind it were especially significant.\nMountain Dew and Lightwave collaborated at this year's Dew Tour in Long Beach to create an interactive art display called \"The Art of Doing.\" The exhibit's purpose was to demonstrate the intertwining worlds of skating and artistic expression, produced by innovative technology to properly display the feeling of skating into a form of visual personal expression. The high concept gallery featured six unique canvases that displayed a different athlete's individual feelings of doing, by monitoring certain vital statistics while they skated at the event facilities.\nAccording to a recent study by Lightwave, about 80% of sponsored Dew Tour athletes believe their skateboarding is a form of artistic expression as much as it is their profession and passion. Therefore, Lightwave used analytics like psychological responses to thrills of skating, such as heart rate, changes in skin temperature, and motion to represent each skater individually.  Their goal was to accurately represent emotional data and then display it in an alluring display.\nPhoto: Dew Tour\n\"This year's Dew Tour provides an exemplary use case of our technology because we're able to reveal deep emotional insights into the thrill of competition and visualize them in a brand new way,\" said Rana June, CEO of Lightwave in a press release.Advertisement \nTop Dew riders such as Curren Caples and Sean Malto agreed to participate by wearing a device that measured their heart rate, blood volume pulse, skin temperature, electrodermal activity, and motion. This biofeedback was transmitted to an engine which was analyzed using neuroscience techniques like measuring orienting responses and heart rate variability. Using this data, they were able to portray the emotional aspects of boarding through a code based artwork.\nGuests were also participants. After the art displays were viewed, the reactions of guests were recorded and turned into their own artwork that was displayed on a custom wall of skateboards.  This first of its kind exhibit blended the exhilaration of skateboarding with the beauty and simplicity of colors, swirling to create emotional experiences everyone and anyone can enjoy.\nPhoto: Dew Tour\n\n", "type": "blog"}
{"uri": "https://www.theinertia.com/music-art/im-learning-to-play-the-ukulele-and-it-feels-so-good", "category": "Arts", "thumb": "https://www.theinertia.com/wp-content/uploads/2017/06/kalaukulele900-343x254.jpg", "title": "I'm Learning to Play the Ukulele, and It Feels So Good", "publish_date": "2017-06-20", "author": {"name": "Pk Duncan", "url": "https://www.theinertia.com/author/pk-duncan/", "type": "Community"}, "text_content": "Time to get the uke on! Photo: Kala Brand Music\n\n\n\n\n\n\n\nEditor's Note: This piece is sponsored by Kala Brand Music. \nIt's official. My love for music is alive and well. I had a chance to test-drive the world's bestselling uke (although, I must admit, I'm a total beginner), but from now on, I'm taking one of these babies with me on every beach outing. Before I reason further, hear me out.\nPlaying a musical instrument throughout the grueling teenage years was a big no-no for me. As a matter of fact, it was degrading, especially if you whipped out a handy, dandy violin for your class talent show. (Don't judge me. My mother forced me into it.) I played the violin for fifteen years and hated it, sacrificing the precious, final spot in the cool group for the first chair in our orchestra.\nOver the years, I'd spend more and more time away from my violin and closer to the \"cooler\" activities, like riding my dirt bike, bodysurfing with friends, and baseball. Chicks seemed to dig that lifestyle far more than when I'd nail Minuet #1 by Bach. I switched out the violin-playing, tuxedo- wearing, chapel-performing adult-approved lifestyle for a more dissident one that involved boardshorts and (hopefully) more girls' phone numbers. I quit the violin at the age of eighteen, for obvious reasons.Advertisement \nTimes changed when I set foot onto my first college campus. I quickly learned that playing an instrument actually was a so-called \"perk\" in the adult life. A resume-builder, a bonfire surprise, if you will. It was a hidden talent that gals seemed to have developed a newfound appreciation for; it was somewhat badass and funny. And now, I lacked it.\nAfter abandoning the violin, I didn't play anything until I graduated college, which was last week. Luckily, my musical background somehow snuck up behind me a few days ago, offering me one last chance, because I was tasked with tickling the ukulele for work.\nI walked out of The Inertia HQ with an absolutely stunning Uke from Kala Brand Music and promised myself to give it one last go around. My music reading capabilities (should) come back from muscle memory, so I signed up for a lesson at my local Guitar Center just this Monday. I'm already channeling Iz.Advertisement\nI'd always thought about getting back into an instrument, but never got around to it. Last night, I perched up on my roof, uke in hand, and just toyed around on theKA-15S, which, coincidentally, is the world's best-selling ukulele, and all felt right. I was somewhere over the rainbow with a few quick strums. And for you traditionalists out there, the KA-15S has a spruce top with mahogany back and sides, you'll appreciate this one. It's a looker.\nLearn more about Kala Brand Music here. Their guitars and ukuleles are reasonably priced, with the KA-15S retailing at $78.99.\nEditor's Note: This piece is sponsored by Kala Brand Music. \nThis is the world's best-selling ukulele. And I'm using it. Photo: Kala Brand Music.", "type": "blog"}
